[
  {
    "name": "Birdcage",
    "cost": 2,
    "weight": 5,
    "description": "A small wire cage for housing a bird."
  },
  {
    "name": "Bit and Bridle",
    "cost": 2,
    "weight": 1,
    "description": "Standard equipment used to direct a mount."
  },
  {
    "name": "Falconry Glove",
    "cost": 5,
    "weight": 1,
    "description": "A heavy leather glove used by falconers."
  },
  {
    "name": "Feed",
    "cost": 0.02,
    "weight": 10,
    "description": "Standard feed typically consumed by a mount per day."
  },
  {
    "name": "Dragonmeal",
    "cost": 0.2,
    "weight": 10,
    "description": "Standard feed typically consumed by a draconic mount per day."
  },
  {
    "name": "Saddle, pack",
    "cost": 5,
    "weight": 15,
    "description": "A standard saddle for a pack mount.  A mount wearing a pack saddle cannot be ridden by a creature."
  },
  {
    "name": "Saddle, riding",
    "cost": 10,
    "weight": 25,
    "description": "A standard saddle for a riding mount."
  },
  {
    "name": "Saddle, riding (military)",
    "cost": 20,
    "weight": 25,
    "description": "A standard saddle for a riding mount.  You have advantage on ability checks and saving throws made to avoid falling out of this saddle."
  },
  {
    "name": "Saddle, exotic",
    "cost": 60,
    "weight": 30,
    "description": "An exotic saddle is required for riding any aquatic or flying mount that is not also draconic in nature."
  },
  {
    "name": "Saddle, exotic (military)",
    "cost": 70,
    "weight": 30,
    "description": "An exotic saddle is required for riding any aquatic or flying mount that is not also draconic in nature.  You have advantage on ability checks and saving throws made to avoid falling out of this saddle."
  },
  {
    "name": "Saddle, dragonrider's",
    "cost": 75,
    "weight": 40,
    "description": "A heavily padded saddle specialized for riding draconic creatures."
  },
  {
    "name": "Saddle, dragonrider's (military)",
    "cost": 85,
    "weight": 40,
    "description": "A heavily padded saddle specialized for riding draconic creatures.  You have advantage on ability checks and saving throws made to avoid falling out of this saddle."
  },
  {
    "name": "Saddlebags",
    "cost": 4,
    "weight": 8,
    "description": "Standard saddlebags that can be attached to a mount's saddle."
  }
]
