[
  {
    "name": "Aberrant Dragonmark",
    "type": "magic",
    "repeatable": true,
    "description": "You have manifested an aberrant dragonmark. Determine its appearance and the flaw associated with it. You gain the following benefits:\n<ul>\n<li>Increase your Constitution score by 1, to a maximum of 20.</li>\n    <li>You learn a cantrip of your choice from the Arcane spell list. In addition, choose a 1st-level spell from the Arcane spell list. You learn that spell and can cast it through your mark. Once you cast it, you must finish a short or long rest before you can cast it again through the mark. Constitution is your spellcasting ability for these spells.</li>\n<li>When you cast the 1st-level spell through your mark, you can expend one of your Hit Dice and roll it. If you roll an even number, you gain a number of temporary hit points equal to the number rolled. If you roll an odd number, one random creature within 30 feet of you (not including you) takes force damage equal to the number rolled. If no other creatures are in range, you take the damage.</li>\n</ul>\n",
    "choices": [
      {
        "id": "0168C2B5-E334-4274-85E2-0D1A907CD131",
        "type": "spell",
        "list": "Arcane",
        "level": 0,
        "ability": "con"
      },
      {
        "id": "7F084622-3E48-46EA-A81B-1FB596B1BE8D",
        "type": "spell",
        "list": "Arcane",
        "level": 1,
        "ability": "con"
      }
    ],
    "granted": [
      {
        "type": "asi",
        "score": "con",
        "amount": 1
      }
    ]
  },
  {
    "name": "Acrobat",
    "type": "skill",
    "description": "You become more nimble, gaining the following benefits:\n<ul>\n<li>Increase your Dexterity score by 1, to a maximum of 20.</li>\n<li>You gain proficiency in the Acrobatics skill. If you are already proficient in the skill, you add double your proficiency bonus to checks you make with it.</li>\n<li>As a bonus action, you can make a DC 15 Dexterity (Acrobatics) check. If you succeed, difficult terrain doesn't cost you extra movement until the end of the current turn.</li>\n</ul>\n",
    "granted": [
      {
        "type": "asi",
        "score": "dex",
        "amount": 1
      },
      {
        "type": "skill",
        "options": ["Acrobatics"],
        "level": 1.5
      }
    ]
  },
  {
    "name": "Actor",
    "type": "skill",
    "description": "Skilled at mimicry and dramatics, you gain the following benefits:\n<ul>\n<li>Increase your Charisma score by 1, to a maximum of 20.</li>\n<li>You have an advantage on Charisma (Deception) and Charisma (Performance) checks when trying to pass yourself off as a different person.</li>\n<li>You can mimic the speech of another person or the sounds made by other creatures. You must have heard the person speaking, or heard the creature make the sound, for at least 1 minute. A successful Wisdom (Insight) check contested by your Charisma (Deception) check allows a listener to determine that the effect is faked.</li>\n</ul>\n",
    "granted": [
      {
        "type": "asi",
        "score": "cha",
        "amount": 1
      }
    ]
  },
  {
    "name": "Alchemist",
    "type": "skill",
    "description": "You have studied the secrets of alchemy and are an expert in its practice, gaining the following benefits:\n<ul>\n<li>Increase your Intelligence score by 1, to a maximum of 20.</li>\n<li>You gain proficiency with alchemist's supplies. If you are already proficient with them, you double your proficiency bonus to checks you make with them.</li>\n<li>As an action, you can identify one potion within 5 feet of you, as if you had tasted it. You must see the liquid for this benefit to work.</li>\n<li>Over the course of any short rest, you can temporarily improve the potency of one potion of healing of any rarity. To use this benefit, you must have alchemist's supplies with you, and the potion must be within reach. If the potion is drunk no more than 1 hour after the short rest ends, the creature drinking the potion can forgo the potion's die roll and regains the maximum number of hit points that the potion can restore.</li>\n</ul>\n",
    "granted": [
      {
        "type": "asi",
        "score": "int",
        "amount": 1
      },
      {
        "type": "tool",
        "options": ["Alchemist's Supplies"],
        "level": 1.5
      }
    ]
  },
  {
    "name": "Alert",
    "type": "combat",
    "description": "Always on the lookout for danger, you gain the following benefits:\n<ul>\n<li>You can't be surprised while you are conscious.</li>\n<li>You gain a +5 bonus to initiative.</li>\n<li>Other creatures don't gain advantage on attack rolls against you as a result of being unseen by you.</li>\n</ul>\n",
    "granted": [
      {
        "type": "initiative-bonus",
        "amount": 5
      }
    ]
  },
  {
    "name": "Animal Handler",
    "type": "skill",
    "description": "You master the techniques needed to train and handle animals. You gain the following benefits:\n<ul>\n<li>Increase your Wisdom score by 1, to a maximum of 20.</li>\n<li>You gain proficiency in the Animal Handling skill. If you are already proficient in the skill, you add double your proficiency bonus to checks you make with it.</li>\n<li>You can use a bonus action on your turn to command one friendly beast within 60 feet of you that can hear you and that isn't currently following the command of someone else. You decide now what action the beast will take and where it will move during its next turn, or you issue a general command that lasts for 1 minute, such as to guard a particular area.</li>\n</ul>\n",
    "granted": [
      {
        "type": "asi",
        "score": "wis",
        "amount": 1
      },
      {
        "type": "skill",
        "options": ["Animal Handling"],
        "level": 1.5
      }
    ]
  },
  {
    "name": "Arcanist",
    "type": "skill",
    "description": "You study the arcane arts, gaining the following benefits:\n<ul>\n<li>Increase your Intelligence score by 1, to a maximum of 20.</li>\n<li>You gain proficiency in the Arcana skill. If you are already proficient in the skill, you add double your proficiency bonus to checks you make with it.</li>\n<li>You learn the Detect Magic spell. You can cast Detect Magic once without expending a spell slot, and you regain the ability to do so when you finish a long rest.</li>\n</ul>\n",
    "granted": [
      {
        "type": "asi",
        "score": "int",
        "amount": 1
      },
      {
        "type": "skill",
        "options": ["Arcana"],
        "level": 1.5
      },
      {
        "type": "spell",
        "options": ["Detect Magic"],
        "ignoreMaxLevel": true,
        "ability": "int"
      }
    ],
    "uses": {
      "id": "1B5C85A4-682D-4416-B360-4D428DA1EB9E",
      "type": "fixed",
      "amount": 1,
      "reset": 2
    }
  },
  {
    "name": "Athlete",
    "type": "skill",
    "description": "You have undergone extensive physical training to gain the following benefits:\n<ul>\n<li>Increase your Strength or Dexterity score by 1, to a maximum of 20.</li>\n<li>You gain a climbing and swimming speed equal to your walking speed.</li>\n<li>You gain proficiency in the Athletics skill, and your proficiency bonus is doubled for checks made with it.</li>\n</ul>\n",
    "choices": {
      "id": "BB8468D9-D05D-40DE-ABEE-E4209045A7A9",
      "type": "asi",
      "amount": 1,
      "options": ["str", "dex"]
    },
    "granted": [
      {
        "type": "skill",
        "options": ["Athletics"],
        "level": 2
      },
      {
        "type": "speed",
        "speed": "swim",
        "amount": -1
      },
      {
        "type": "speed",
        "speed": "climb",
        "amount": -1
      }
    ]
  },
  {
    "name": "Weapon Master",
    "type": "combat",
    "repeatable": true,
    "description": "You have taken the time to master a specific class of melee weapon.  Choose a class of melee weapon from Axes, Brawling, Clubs, Flails, Hammers, Pickaxes, Polearms, Shortblades, Spears, or Swords.  You gain a +1 bonus to attack rolls with your chosen class of weapons, and you gain additional benefits determined by your choice.  All Spears are also considered Polearms, but you do not gain the bonus to attack rolls twice if you choose this feat multiple times.</p><p>You can take this feat multiple times, and must choose a different class of melee weapon each time.",
    "choices": {
      "id": "A4DECE09-8B71-4335-8A2F-56730C579BCD",
      "type": "trait",
      "options": [
        {
          "name": "Axes",
          "traits": [
            {
              "name": "Headsman",
              "description": "When you reduce a creature to 0 hit points with an axe, you can choose to cleave their head from their body, killing them instantly.  You cannot do so against a creature without a head or one that can survive without their head."
            },
            {
              "name": "Shieldbreaker",
              "description": "When you hit a creature wielding a nonmagical shield with an opportunity attack using an axe, you can cleave through their shield, reducing the bonus it grants to their Armor Class by 1.  If this reduces the shield's bonus to 0, it is destroyed.  Damage caused by this feature can be repaired over the course of a long rest, provided the shield wasn't completely destroyed."
            }
          ]
        },
        {
          "name": "Brawling",
          "traits": [
            {
              "name": "Iron Grip",
              "description": "When you are wielding a brawling weapon, you can attempt to grapple or shove a creature in place of an attack of opportunity."
            },
            {
              "name": "Throat Chop",
              "description": "Once per turn when you hit a creature with a brawling weapon, you can force them to make a Constitution saving throw (DC = 8 + your proficiency bonus + your Strength or Dexterity modifier).  On a failed saving throw, they can't speak or cast spells with verbal components until the end of your next turn."
            }
          ]
        },
        {
          "name": "Clubs",
          "traits": [
            {
              "name": "Bonebreaker",
              "description": "As a bonus action on your turn, you can wind up for a swing with a club.  Your next attack with a club deals an additional die of damage."
            },
            {
              "name": "Concussion",
              "description": "When you hit a creature with an opportunity attack using a club, you can force them to make a Constitution saving throw (DC = 8 + your proficiency bonus + your Strength or Dexterity modifier).  On a failed saving throw, the target is dazed until the end of its next turn.  While dazed, the creature's speed is halved and it cannot take reactions.  A creature immune to being stunned is immune to being dazed."
            }
          ]
        },
        {
          "name": "Flails",
          "traits": [
            {
              "name": "Brutal Guardian",
              "description": "When you hit with an opportunity attack using a flail, the target must succeed on a Strength saving throw (DC = 8 + your proficiency bonus + your Strength or Dexterity modifier) or be knocked prone."
            },
            {
              "name": "Winding Strike",
              "description": "As a bonus action on your turn, you can prepare yourself to extend your flail to sweep over targets' shields. Until the end of this turn, your attack rolls with a flail gain a +2 bonus against any target using a shield."
            }
          ]
        },
        {
          "name": "Hammers",
          "traits": [
            {
              "name": "Crush",
              "description": "You deal double damage to objects and structures with attacks made with a hammer."
            },
            {
              "name": "Kneebreaker",
              "description": "When you hit with an opportunity attack using a hammer, you score a critical hit on a roll of 19 or 20."
            }
          ]
        },
        {
          "name": "Pickaxes",
          "traits": [
            {
              "name": "Armor Breaker",
              "description": "When you hit a creature with an opportunity attack using a pickaxe, you can remove one damage resistance of your choice until the end of your next turn."
            },
            {
              "name": "Hooked Grapple",
              "description": "When you are wielding a pickaxe, you can attempt to grapple a creature in place of an attack of opportunity.  You can grapple a creature using a pickaxe, and a creature grappled in such a way takes piercing damage equal to your proficiency bonus at the start of each of your turns."
            }
          ]
        },
        {
          "name": "Polearms",
          "traits": [
            {
              "name": "Haft Strike",
              "description": "When you take the Attack action and attack with only a polearm, you can use a bonus action to make a melee attack with the opposite end of the weapon. This attack uses the same ability modifier as the primary attack. The weapon's damage die for this attack is a d4, and it deals bludgeoning damage."
            },
            {
              "name": "Vigilant Pikeman",
              "description": "While you are wielding a polearm, other creatures provoke an opportunity attack from you when they enter the reach you have with that weapon."
            }
          ]
        },
        {
          "name": "Shortblades",
          "traits": [
            {
              "name": "Blade Dance",
              "description": "As a bonus action, you can assume an acrobatic stance, provided you have a shortblade in hand. Doing so grants advantage on Dexterity saving throws until the start of your next turn or until you're not holding a shortblade."
            },
            {
              "name": "Disarm",
              "description": "When you make an opportunity attack with a shortblade against a creature wielding a weapon, you can force them to make a Strength saving throw (DC = 8 + your proficiency bonus + your Strength or Dexterity modifier).  On a failed saving throw, the target drops one weapon of your choice, and it flies away 5 feet in a random direction."
            }
          ]
        },
        {
          "name": "Spears",
          "traits": [
            {
              "name": "Long Reach",
              "description": "As a bonus action, you can increase your reach with a spear you're holding by 5 feet until the start of your next turn."
            },
            {
              "name": "Surgebreaker",
              "description": "As a bonus action, you can set your spear to receive a charge. If a creature moves within your spear's reach on its next turn, you can make a melee attack against it with your spear as a reaction. If the attack hits, the target takes an extra die of damage."
            }
          ]
        },
        {
          "name": "Swords",
          "traits": [
            {
              "name": "Deft Defender",
              "description": "When you make an opportunity attack with a sword, you have advantage on the attack roll."
            },
            {
              "name": "Parrying Stance",
              "description": "As a bonus action, you can assume a parrying stance, provided you have a sword in hand. Doing so grants a +1 bonus to your AC until the start of your next turn or until you're not holding a sword."
            }
          ]
        }
      ]
    }
  },
  {
    "name": "Brawny",
    "type": "skill",
    "description": "You become stronger, gaining the following benefits:\n<ul>\n<li>Increase your Strength score by 1, to a maximum of 20.</li>\n<li>You gain proficiency in the Athletics skill. If you are already proficient in the skill, you add double your proficiency bonus to checks you make with it.</li>\n<li>You count as if you were one size larger for the purpose of determining your carrying capacity.</li>\n</ul>\n",
    "granted": [
      {
        "type": "asi",
        "score": "str",
        "amount": 1
      },
      {
        "type": "skill",
        "options": ["Athletics"],
        "level": 1.5
      }
    ]
  },
  {
    "name": "Burglar",
    "type": "skill",
    "description": "You pride yourself on your quickness and your close study of certain clandestine activities. You gain the following benefits:\n<ul>\n<li>Increase your Dexterity score by 1, to a maximum of 20.</li>\n<li>You gain proficiency with thieves' tools. If you are already proficient with them, you add double your proficiency bonus to checks you make with them.</li><li>If you spend at least 1 minute observing or interacting with another creature outside combat, you can discover some information about its financial situation, including how much treasure it has on it right now, and possible locations of treasure this creature have access to.</li></ul>\n",
    "granted": [
      {
        "type": "asi",
        "score": "dex",
        "amount": 1
      },
      {
        "type": "tool",
        "options": ["Thieves' Tools"],
        "level": 1.5
      }
    ]
  },
  {
    "name": "Called Shots",
    "type": "combat",
    "description": "Practice makes perfect, and with extensive practice you've mastered the art of hitting even smaller targets. Before making an attack with a ranged weapon with which you are proficient, you can choose to take a -5 penalty to the attack roll. If the attack hits, you successfully land a shot on a specific part of the creature. If applicable, the following locations can be hit, with corresponding effects. The saving throw DC for these effects are equal to 8 plus your proficiency bonus and whichever ability score modifier you used to make the attack roll.\n<ul>\n<li><strong>Head.</strong> The target must succeed on a Constitution saving throw or have disadvantage on attack rolls and saving throws until the end of its next turn.</li>\n<li><strong>Torso.</strong> You increase your critical range for this attack by 1.</li>\n<li><strong>Arms.</strong> Choose one of the creature's arms. The target creature must succeed on a Strength Saving Throw or drop whatever is in that arm, knocking the item 10ft. away from you.</li>\n<li><strong>Legs.</strong> The target creature must succeed on a Dexterity Saving Throw or fall prone. Large and larger creatures make this save with advantage.</li>\n<li><strong>Wings.</strong> The target creature must succeed on a Strength Saving Throw or plummet 20ft. Undead and constructs are immune to this effect.</li>\n</ul>\n"
  },
  {
    "name": "Cannonmaster",
    "type": "combat",
    "description": "You are a sight to behold on the battlefield, unleashing volley after volley with unprecedented speed. A strong fighter, you are drawn to the most powerful weapons available to you, packing the hardest punch with each shot. You gain the following benefits:\n<ul>\n<li>Increase your Strength by 1, to a maximum of 20.</li>\n<li>When using siege equipment such as cannons, ballista, trebuchet, or other similar weapons that require multiple actions to aim and fire, you may aim and fire them using one action. Additionally, you can use your Strength modifier for the attack and damage rolls made with these weapons.</li>\n<li>When you roll a 1 on a damage die for an attack made with a ranged weapon that uses your Strength modifier, you may roll an additional damage die.</li>\n</ul>\n",
    "granted": [
      {
        "type": "asi",
        "score": "str",
        "amount": 1
      }
    ]
  },
  {
    "name": "Chef",
    "type": "skill",
    "description": "Time and effort spent mastering the culinary arts has paid off. You gain the following benefits:\n<ul>\n<li>Increase your Constitution or Wisdom score by 1, to a maximum of 20.</li>\n<li>You gain proficiency with cook's utensils if you don't already have it.</li>\n<li>As part of a short rest, you can cook special food, provided you have ingredients and cook's utensils on hand. You can prepare enough of this food for a number of creatures equal to 4 + your proficiency bonus. At the end of the short rest, any creature who eats the food and spends one or more Hit Dice to regain hit points regains an extra 1d8 hit points.</li>\n<li>With one hour of work or when you finish a long rest, you can cook a number of treats equal to your proficiency bonus from the options below. These special treats last 8 hours after being made. A creature can use a bonus action to eat one of those treats to gain its benefits.</li>\n</ul>",
    "subFeatures": [
      {
        "name": "Fortifying Ration",
        "description": "Upon consumption, the creature chooses either Strength, Dexterity, or Constitution. For the next minute, the creature can add your Constitution modifier (minimum of +1) to any ability check or saving throw for the chosen ability score."
      },
      {
        "name": "Invigorating Ration",
        "description": "Upon consumption, the creature regains hit points equal to 1d10 + your Constitution modifier (minimum of +1)."
      },
      {
        "name": "Revitalizing Ration",
        "description": "Upon consumption, the creature ends one of the following conditions currently affecting it: blindness, deafness, poison, or they reduce their exhaustion level by 1."
      },
      {
        "name": "Stimulating Ration",
        "description": "This Ration must be consumed as part of a short rest. Upon consumption, the creature gains advantage on the roll for any Hit Dice they choose to expend during that short rest."
      }
    ],
    "choices": {
      "id": "8A686C1C-9ED0-434D-B375-13C1BE83EEE4",
      "type": "asi",
      "amount": 1,
      "options": ["con", "wis"]
    },
    "granted": [
      {
        "type": "tool",
        "options": ["Cook's Utensils"],
        "level": 1.5
      }
    ],
    "uses": {
      "id": "727B810F-9C78-4508-B74A-6528F3EDD791",
      "type": "derived",
      "source": "proficiency",
      "inverted": true,
      "reset": 1
    }
  },
  {
    "name": "Cover Fighter",
    "type": "combat",
    "description": "Experienced in the art of a firefight, you know how to avoid enemy fire while returning fire of your with deadly precision. Whether from a low wall, a tree trunk, a small trench, or the window of a building, you know how to keep your head down and keep calm amongst the hail of bullets. You gain the following benefits:\n<ul>\n<li>Increase your Dexterity or Constitution by 1, to a maximum of 20.</li>\n<li>Cover increases your Armor Class by an additional 1.</li>\n<li>While in half or three-quarters cover, you may add a +1 or +2, respectively, to a ranged weapon attack roll made against a creature, so long as your cover is in between yourself and that creature.</li>\n</ul>",
    "choices": {
      "id": "FF4505A0-D148-4730-B9DB-B88D7435DB56",
      "type": "asi",
      "amount": 1,
      "options": ["dex", "con"]
    }
  },
  {
    "name": "Crossbow Expert",
    "type": "combat",
    "description": "Thanks to extensive practice with the crossbow, you gain the following benefits:\n<ul>\n<li>You ignore the loading quality of crossbows with which you are proficient.</li>\n<li>Being within 5 feet of a hostile creature doesn't impose disadvantage on your ranged attack rolls.</li>\n<li>When you use the Attack action and attack with a one handed weapon, you can use a bonus action to attack with a hand crossbow you are holding.</li>\n</ul>"
  },
  {
    "name": "Defensive Duelist",
    "prereq": [
      {
        "dex": 13
      }
    ],
    "type": "combat",
    "description": "When you are wielding a finesse weapon with which you are proficient and another creature hits you with a melee attack, you can use your reaction to add your proficiency bonus to your AC for that attack, potentially causing the attack to miss you.\n"
  },
  {
    "name": "Devious Scoundrel",
    "type": "multiclass",
    "repeatable": true,
    "description": "You have a devious mind that allows you to perform special combat maneuvers. You gain the following benefits.\n<ul>\n    <li>You learn two Devious Exploits of your choice from among those available to the rogue class. If an exploit you use requires your target to make a saving throw to resist the exploit's effects, the saving throw DC equals 8 + your proficiency bonus + your Dexterity modifier.</li>\n<li>You gain one exploit die, which is a d6 (this die is added to any exploit dice you have from another source). This die is used to fuel your exploits. A exploit die is expended when you use it. You regain your expended exploit dice when you finish a short or long rest.</li>\n</ul>\nYou can take this feat multiple times, and gain additional exploit dice and exploit options each time.\n",
    "choices": [
      {
        "id": "10F4D3F9-B6F2-4948-912C-93EA7C95621F",
        "type": "exploit",
        "list": "Rogue",
        "ability": "dex"
      },
      {
        "id": "195A8F6E-4AEC-4A58-8BC8-B7709109112E",
        "type": "exploit",
        "list": "Rogue",
        "ability": "dex"
      }
    ],
    "granted": [
      {
        "type": "exploit-die",
        "amount": 1,
        "size": 6
      }
    ]
  },
  {
    "name": "Diplomat",
    "type": "skill",
    "description": "You master the arts of diplomacy, gaining the following benefits:\n<ul>\n<li>Increase your Charisma score by 1, to a maximum of 20.</li>\n<li>You gain proficiency in the Persuasion skill. If you are already proficient in this skill, you add double your proficiency bonus to checks you make with it.</li>\n<li>If you spend 1 minute talking to someone who can understand what you say, you can make a Charisma (Persuasion) check contested by the creature's Wisdom (Insight) check. If you or your companions are fighting the creature, your check automatically fails. If your check succeeds, the target is charmed by you as long as it remains within 60 feet of you and for 1 minute thereafter.</li>\n</ul>",
    "granted": [
      {
        "type": "asi",
        "score": "cha",
        "amount": 1
      },
      {
        "type": "skill",
        "options": ["Persuasion"],
        "level": 1.5
      }
    ]
  },
  {
    "name": "Dual Wielder",
    "type": "combat",
    "description": "You master fighting with two weapons, gaining the following benefits:\n<ul>\n<li>You gain a +1 bonus to AC while you are wielding a separate melee weapon in each hand.</li>\n<li>You can use two-weapon fighting even when the one handed melee weapons you are wielding aren't light.</li>\n<li>You can draw or stow two one-handed weapons when you would normally be able to draw or stow only one.</li>\n</ul>"
  },
  {
    "name": "Dungeon Delver",
    "type": "combat",
    "description": "Alert to the hidden traps and secret doors found in many dungeons, you gain the following benefits:\n<ul>\n<li>You have advantage on Wisdom (Perception) and Intelligence (Investigation) checks made to detect the presence of secret doors.</li>\n<li>You have advantage on saving throws made to avoid or resist traps.</li>\n<li>You have resistance to the damage dealt by traps.</li>\n<li>Travelling at a fast pace doesn't impose the normal -5 penalty on your passive Wisdom (Perception) score.</li>\n</ul>"
  },
  {
    "name": "Durable",
    "type": "combat",
    "description": "Hardy and resilient, you gain the following benefits:\n<ul>\n<li>Increase your Constitution score by 1, to a maximum of 20.</li>\n<li>When you roll a Hit Die to regain hit points, the minimum number of hit points you regain from the roll equals twice your Constitution modifier (minimum of 2).</li><li>Your hit point maximum increases by an amount equal to twice your level when you gain this feat. Whenever you gain a level thereafter, your hit point maximum increases by an additional 2 hit points.</li></ul>",
    "granted": [
      {
        "type": "asi",
        "score": "con",
        "amount": 1
      },
      {
        "type": "hit-point-level",
        "amount": 2
      }
    ]
  },
  {
    "name": "Eldritch Adept",
    "prereq": [
      {
        "spellcasting": true
      }
    ],
    "type": "multiclass",
    "repeatable": true,
    "description": "Studying occult lore, you have unlocked eldritch power within yourself: you learn one Eldritch Invocation option of your choice from the warlock class, assuming you meet its prerequisites.\nWhenever you gain a level, you can replace the invocation with another one from the warlock class.\n",
    "choices": {
      "id": "9D980628-CC1A-4ADE-BFA3-686F37D5C5AB",
      "type": "eldritch-invocation"
    }
  },
  {
    "name": "Elemental Adept",
    "prereq": [
      {
        "spellcasting": true
      }
    ],
    "type": "magic",
    "repeatable": true,
    "description": "When you gain this feat, choose one of the following damage types: acid, cold, fire, lightning, or thunder.\n<ul>\n<li>Spells you cast ignore resistance to damage of the chosen type. In addition, when you roll damage for a spell you cast that deals damage of that type, you can treat any 1 on a damage die as a 2.</li>\n<li>You can select this feat multiple times. Each time you do so, you must choose a different damage type.</li>\n</ul>",
    "choices": {
      "id": "6B94BDB6-2B88-46E7-929A-4AF5B0BE0A87",
      "type": "text",
      "options": ["acid", "cold", "fire", "lightning", "thunder"]
    }
  },
  {
    "name": "Empathic",
    "type": "skill",
    "description": "You possess keen insight into how other people think and feel. You gain the following benefits:\n<ul>\n<li>Increase your Wisdom score by 1, to a maximum of 20.</li>\n<li>You gain proficiency in the Insight skill. If you are already proficient in the skill, you add double your proficiency bonus to checks you make with it.</li>\n<li>You can use your action to try to get uncanny insight about one humanoid you can see within 30 feet of you. Make a Wisdom (Insight) check contested by the target's Charisma (Deception) check. If your check succeeds, you have advantage on attack rolls and ability checks against the target until the end of your next turn.</li>\n</ul>",
    "granted": [
      {
        "type": "asi",
        "score": "wis",
        "amount": 1
      },
      {
        "type": "skill",
        "options": ["Insight"],
        "level": 1.5
      }
    ]
  },
  {
    "name": "Exotic Weapon Training",
    "type": "martial",
    "repeatable": true,
    "description": "You have trained with specialized weapons, gaining the following benefits:\n<ul>\n<li>Increase your Strength or Dexterity score by 1, to a maximum of 20.</li>\n<li>You gain proficiency with two exotic weapons of your choice.</li>\n</ul>",
    "choices": [
      {
        "id": "4C42378D-CAEB-40B5-ADDA-EEB9D3597616",
        "type": "asi",
        "amount": 1,
        "options": ["str", "dex"]
      },
      {
        "id": "DB24F637-6454-4846-948F-905B3A07D30F",
        "type": "exotic-weapon"
      },
      {
        "id": "093252A2-B896-4008-B30A-BC03B888B0FF",
        "type": "exotic-weapon"
      }
    ]
  },
  {
    "name": "Fell Handed",
    "type": "combat",
    "description": "You master large weapons. You gain the following benefits when using a melee weapon with the Massive property:\n<ul>\n<li>You gain a +1 bonus to attack rolls you make with the weapon.</li>\n<li>Whenever you have advantage on a melee attack roll you make with the weapon and hit, you can also knock the target prone if the lower of the two d20 rolls would also hit the target.</li>\n<li>Whenever you have disadvantage on a melee attack roll you make with the weapon, the target takes bludgeoning damage equal to your Strength modifier (minimum of 0) if the attack misses but the higher of the two d20 rolls would have hit.</li>\n<li>If you use the Help action to aid an ally's melee attack while you're wielding the weapon, you knock the target's shield aside momentarily. In addition to the ally gaining advantage on the attack roll, the ally gains a +2 bonus to the roll if the target is using a shield</li>\n</ul>"
  },
  {
    "name": "Fey-Touched",
    "type": "magic",
    "repeatable": true,
    "description": "Your exposure to the Feywild's magic has changed you, granting you the following benefits:\n<ul>\n<li>Increase your Intelligence, Wisdom, or Charisma score by 1, to a maximum of 20.</li>\n    <li>You learn the Misty Step spell and one 1st-level spell of your choice. The 1st-level spell must be from the Divination or Enchantment school of magic. You can cast each of these spells without expending a spell slot. Once you cast either of these spells in this way, you can't cast that spell in this way again until you finish a long rest. You can also cast these spells using spell slots you have of the appropriate level. The spells' spellcasting ability is the ability increased by this feat.</li>\n</ul>",
    "choices": [
      {
        "id": "5D1ADD4B-41F0-4639-8702-257A73FCC4AF",
        "type": "asi",
        "amount": 1,
        "options": ["int", "wis", "cha"]
      },
      {
        "id": "575A8579-AF0D-4223-BCD1-0F182640D57A",
        "type": "spell",
        "level": 1,
        "list": ["Divination", "Enchantment"],
        "ability": "5D1ADD4B-41F0-4639-8702-257A73FCC4AF"
      }
    ],
    "granted": [
      {
        "type": "spell",
        "options": ["Misty Step"],
        "ignoreMaxLevel": true,
        "ability": "5D1ADD4B-41F0-4639-8702-257A73FCC4AF"
      }
    ],
    "uses": [
      {
        "id": "C7651AA1-31EA-4591-B494-764E3E6C6F59",
        "type": "fixed",
        "amount": 1,
        "reset": 2
      },
      {
        "id": "6FDE84AB-3EF1-49ED-910D-0FCDBA4AAB59",
        "type": "fixed",
        "amount": 1,
        "reset": 2
      }
    ]
  },
  {
    "name": "Fighting Initiate",
    "prereq": [
      {
        "martial": true
      }
    ],
    "type": "multiclass",
    "repeatable": true,
    "description": "Your martial training has helped you develop a particular style of fighting. As a result, you gain the following benefits:\n<ul>\n<li>Increase your Strength or Dexterity score by 1, to a maximum of 20.</li>\n<li>You learn one Fighting Style option of your choice from the Fighter class. If you already have a style, the one you choose must be different.</li>\n</ul>\nWhenever you reach a level that grants the Ability Score Improvement feature, you can replace this feat's fighting style with another one from the fighter class that you don't have.\n",
    "choices": [
      {
        "id": "BFD97C02-4299-44A6-A9AE-701AE682F8AB",
        "type": "asi",
        "amount": 1,
        "options": ["str", "dex"]
      },
      {
        "id": "973D48FE-D727-4F45-BF87-7ACE35D0E380",
        "type": "fighting-style",
        "options": [
          "Aggressive Grappler",
          "Archery",
          "Berserkergang",
          "Blind Fighting",
          "Charger",
          "Classical Swordplay",
          "Close-Quarters Shooter",
          "Crusher",
          "Critical Momentum",
          "Deep Cut",
          "Defensive Fighting",
          "Dual Wielding",
          "Dueling",
          "Featherweight Fighting",
          "Great Weapon Fighting",
          "Heavyweight Fighting",
          "Improvised Fighting",
          "Interception",
          "Mounted Warrior",
          "Marine Fighting",
          "Melee Marksman",
          "Mountain Fighting",
          "Piercer",
          "Pit Fighting",
          "Precision Shooter",
          "Protection",
          "Savage Attacker",
          "Sharpshooter",
          "Shield Warrior",
          "Slasher",
          "Standard Bearer",
          "Strongbow",
          "Thrown Weapon Fighting",
          "Versatile Fighting",
          "Unarmed Fighting",
          "Wrestler"
        ]
      }
    ]
  },
  {
    "name": "Frontliner",
    "type": "combat",
    "description": "Owing to your brawn, bravery, or otherwise, you prefer to fight up close and personal, charging headlong into battle. You gain the following benefits:\n<ul>\n<li>Increase your Strength, Dexterity, or Constitution by 1, to a maximum of 20.</li>\n<li>Being within 5 feet of a hostile creature doesn't impose disadvantage on your ranged weapon attacks.</li>\n<li>When you make a ranged weapon attack against a creature and hit, you may use your bonus action to make a melee attack.</li>\n</ul>",
    "choices": {
      "id": "3115F396-D2D6-4B88-AB76-8E15ED15E83C",
      "type": "asi",
      "amount": 1,
      "options": ["str", "dex", "con"]
    }
  },
  {
    "name": "Gift of the Chromatic Dragon",
    "type": "magic",
    "description": "You've manifested some of the power of chromatic dragons, granting you the following benefits:\n<ul>\n<li>As a bonus action, you can touch a simple or martial weapon and infuse it with one of the following damage types: acid, cold, fire, lightning, or poison. For the next minute, the weapon deals an extra 1d4 damage of the chosen type when it hits. After you use this bonus action, you can't do so again until you finish a long rest.</li>\n<li>When you take acid, cold, fire, lightning, or poison damage, you can use your reaction to give yourself resistance to that instance of damage. You can use this reaction a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest.</li>\n</ul>",
    "uses": [
      {
        "id": "AF2B1E52-EA0E-464D-B125-D05C1D9B33DD",
        "type": "fixed",
        "amount": 1,
        "reset": 2
      },
      {
        "id": "FB8F7E86-F595-4A8D-A192-812C014BC62D",
        "type": "derived",
        "source": "proficiency",
        "reset": 2
      }
    ]
  },
  {
    "name": "Gift of the Gem Dragon",
    "type": "magic",
    "description": "You've manifested some of the power of gem dragons, granting you the following benefits:\n<ul>\n<li>Increase your Intelligence, Wisdom, or Charisma score by 1, to a maximum of 20.</li>\n<li>When you take damage from a creature that is within 10 feet of you, you can use your reaction to emanate telekinetic energy. The creature that dealt damage to you must make a Strength saving throw (DC equals 8 + your proficiency bonus + the ability modifier of the score increased by this feat). On a failed save, the creature takes 2d8 force damage and is pushed up to 10 feet away from you. On a successful save, the creature takes half as much damage and isn't pushed. You can use this reaction a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest.</li>\n</ul>",
    "choices": {
      "id": "C7036F7F-8E0A-483E-99FF-5A398C274B54",
      "type": "asi",
      "amount": 1,
      "options": ["int", "wis", "cha"]
    }
  },
  {
    "name": "Gift of the Metallic Dragon",
    "type": "magic",
    "description": "You've manifested some of the power of metallic dragons, granting you the following benefits:\n<ul>\n<li>You learn the Cure Wounds spell. You can cast this spell without expending a spell slot. Once you cast this spell in this way, you can't do so again until you finish a long rest. You can also cast this spell using spell slots you have. The spell's spellcasting ability is Intelligence, Wisdom, or Charisma when you cast it with this feat (choose when you gain the feat).</li>\n<li>You can manifest protective wings that can shield you or others. When you or another creature you can see within 5 feet of you is hit by an attack roll, you can use your reaction to manifest spectral wings from your back for a moment. You grant a bonus to the target's AC equal to your proficiency bonus against that attack roll, potentially causing it to miss. You can use this reaction a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest.</li>\n</ul>",
    "choices": {
      "id": "874E26ED-237A-4963-9239-2F90EB327DBE",
      "type": "asi",
      "amount": 1,
      "options": ["int", "wis", "cha"]
    },
    "granted": [
      {
        "type": "spell",
        "options": ["Cure Wounds"],
        "ignoreMaxLevel": true,
        "ability": "874E26ED-237A-4963-9239-2F90EB327DBE"
      }
    ],
    "uses": [
      {
        "id": "83F1FF24-BD51-4C2C-B249-6F17E114CEFD",
        "type": "fixed",
        "amount": 1,
        "reset": 2
      },
      {
        "id": "71E6C6B9-01E3-4074-8E9D-CAD7D0BFE180",
        "type": "derived",
        "source": "proficiency",
        "reset": 2
      }
    ]
  },
  {
    "name": "Grappler",
    "prereq": [
      {
        "str": 13
      }
    ],
    "type": "combat",
    "description": "You've developed the skills necessary to hold your own in close-quarters grappling. You gain the following benefits:\n<ul>\n<li>You have advantage on attack rolls against a creature you are grappling.</li>\n<li>A creature you are grappling has disadvantage on attack rolls against any creature other than you.</li>\n<li>You can use your action to try to pin a creature grappled by you. To do so, make another grapple check. If you succeed, the creature is restrained until the grapple ends. You can only have one creature pinned at a time.</li>\n</ul>"
  },
  {
    "name": "Gunner",
    "type": "martial",
    "description": "You have a quick hand and keen eye when employing firearms, granting you the following benefits:\n<ul>\n<li>Increase your Dexterity score by 1, to a maximum of 20.</li>\n<li>You gain proficiency with firearms.</li>\n<li>Being within 5 feet of a hostile creature doesn't impose disadvantage on your ranged attack rolls.</li>\n<li>You can reload firearms using your Use an Object interaction rather than their normal reloading time.</li>\n</ul>",
    "granted": [
      {
        "type": "asi",
        "score": "dex",
        "amount": 1
      },
      {
        "type": "weapon",
        "options": ["Firearms"]
      }
    ]
  },
  {
    "name": "Gunslinger",
    "type": "combat",
    "description": "Known for having the fastest hands in the West, East, North, South, or anywhere in between. Your lighting reflexes drop foes in a flurry of gunpowder before they even know what hit them. You gain the following benefits:\n<ul>\n<li>You may add your proficiency bonus to your initiative, or again if you already do so.</li>\n<li>As part of your weapon attacks, you may draw the weapon if it is stowed.</li>\n<li>You have advantage on ability checks to notice concealed weapons on another creature.</li>\n<li>You may use your reaction to make a weapon attack against another creature that has not yet taken its turn in combat. This attack is at disadvantage unless you succeed on a Dexterity (Sleight of Hand) check contested by the target's Dexterity (Acrobatics) check. If the attack is a ranged weapon attack, it cannot exceed the weapon's normal range.</li>\n</ul>",
    "granted": [
      {
        "type": "skill",
        "options": ["initiative"],
        "level": 1.5
      }
    ]
  },
  {
    "name": "Healer",
    "type": "skill",
    "description": "You are an able physician, allowing you to mend wounds quickly and get your allies back in the fight. You gain the following benefits:\n<ul>\n<li>When you use a healer's kit to stabilize a dying creature, that creature also regains 1 hit point.</li>\n<li>As an action. you can spend one use of a healer's kit to tend to a creature and restore 1d6 + 4 hit points to it, plus additional hit points equal to the creature's maximum number of Hit Dice. The creature can't regain hit points from this feat again until it finishes a short or long rest.</li>\n</ul>"
  },
  {
    "name": "Heavily Armored",
    "prereq": [
      {
        "medium": true
      }
    ],
    "type": "martial",
    "description": "You have trained to master the use of heavy armor, gaining the following benefits:\n<ul>\n<li>Increase your Strength score by 1, to a maximum of 20.</li>\n<li>You gain proficiency with heavy armor.</li><li>The time it takes for you to don or doff heavy armor is reduced to 1 minute.</li></ul>",
    "granted": [
      {
        "type": "asi",
        "score": "str",
        "amount": 1
      },
      {
        "type": "armor",
        "options": ["Heavy"]
      }
    ]
  },
  {
    "name": "Heavy Armor Master",
    "prereq": [
      {
        "heavy": true
      }
    ],
    "type": "combat",
    "description": "You can use your armor to deflect strikes that would kill others. You gain the following benefits:\n<ul>\n<li>Increase your Strength score by 1, to a maximum of 20.</li>\n<li>While you are wearing heavy armor, bludgeoning, piercing, and slashing damage that you take from nonmagical attacks is reduced by an amount equal to your proficiency bonus.</li>\n</ul>",
    "granted": [
      {
        "type": "asi",
        "score": "str",
        "amount": 1
      }
    ]
  },
  {
    "name": "Historian",
    "type": "skill",
    "description": "Your study of history rewards you with the following benefits:\n<ul>\n<li>Increase your Intelligence score by 1, to a maximum of 20.</li>\n</ul>\n<ul>\n<li>You gain proficiency in the History skill. If you are already proficient in the skill, you add double your proficiency bonus to checks you make with it.</li>\n</ul>\n<ul>\n<li>When you take the Help action to aid another creature's ability check, you can make a DC 15 Intelligence (History) check. On a success, that creature's check gains a bonus equal to your proficiency bonus, as you share pertinent advice and historical examples. To receive this bonus, the creature must be able to understand what you're saying.</li>\n</ul>",
    "granted": [
      {
        "type": "asi",
        "score": "int",
        "amount": 1
      },
      {
        "type": "skill",
        "options": ["History"],
        "level": 1.5
      }
    ]
  },
  {
    "name": "Inspiring Leader",
    "prereq": [
      {
        "cha": 13
      }
    ],
    "type": "skill",
    "description": "You can spend 10 minutes inspiring your companions, shoring up their resolve to fight. When you do so, choose up to six friendly creatures (which can include yourself) within 30 feet of you who can see or hear you and who can understand you. Each creature can gain temporary hit points equal to your level + your Charisma modifier. A creature can't gain temporary hit points from this feat again until it has finished a short or long rest."
  },
  {
    "name": "Investigator",
    "type": "skill",
    "description": "You have an eye for detail and can pick out the smallest clues. You gain the following benefits:\n<ul>\n<li>Increase your Intelligence score by 1, to a maximum of 20.</li>\n<li>You gain proficiency in the Investigation skill. If you are already proficient in the skill, you add double your proficiency bonus to checks you make with it.</li>\n<li>You can take the Search action as a bonus action.</li>\n</ul>",
    "granted": [
      {
        "type": "asi",
        "score": "int",
        "amount": 1
      },
      {
        "type": "skill",
        "options": ["Investigation"],
        "level": 1.5
      }
    ]
  },
  {
    "name": "Jury-Rigger",
    "type": "combat",
    "description": "Guns can be fickle. They jam, break, and sometimes are plain out to get you. You've seen it all, and know how to whip your firearm back into shape at a moment's notice. You gain the following benefits.\n<ul>\n<li>Increase your Strength or Intelligence by 1, to a maximum of 20</li>\n<li>When using a firearm with a misfire die of d4 or lower, treat it as a d6. Additionally, when rolling the misfire die before an attack roll with a jammed firearm, you may use your bonus action to reroll it.</li>\n<li>You may swap attachments on your firearm over the course of 1 minute with a successful Tinker's Tools check. You may also modify your firearm's main parts in half the time, to a minimum of a short rest.</li>\n</ul>",
    "choices": {
      "id": "6146BBAB-E0F6-4602-B5AD-F8162936CE92",
      "type": "asi",
      "amount": 1,
      "options": ["str", "int"]
    }
  },
  {
    "name": "Keen Mind",
    "type": "skill",
    "description": "You have a mind that can track time, direction, and detail with uncanny precision. You gain the following benefits.\n<ul>\n<li>Increase your Intelligence score by 1, to a maximum of 20.</li>\n<li>You always know which way is north.</li>\n<li>You always know the number of hours left before the next sunrise or sunset.</li>\n<li>You can accurately recall anything you have seen or heard within the past month.</li><li>You gain proficiency in your choice of the Arcana, History, Nature, or Religion skills.</li>\n</ul>",
    "granted": [
      {
        "type": "asi",
        "score": "int",
        "amount": 1
      }
    ],
    "choices": {
      "id": "B75791C6-9D06-4C1C-9938-B97EF14BF820",
      "type": "skill",
      "limits": ["Arcana", "History", "Nature", "Religion"],
      "level": 1.5
    }
  },
  {
    "name": "Lightly Armored",
    "type": "martial",
    "description": "You have trained to master the use of light armor, gaining the following benefits.\n<ul>\n<li>Increase your Dexterity score by 1, to a maximum of 20.</li>\n<li>You gain proficiency with light armor.</li><li>If your Dexterity modifier is negative, it is not applied to your Armor Class while wearing light armor.</li></ul>",
    "granted": [
      {
        "type": "asi",
        "score": "dex",
        "amount": 1
      },
      {
        "type": "armor",
        "options": ["Light"]
      }
    ]
  },
  {
    "name": "Linguist",
    "type": "skill",
    "description": "You have studied languages and codes, gaining the following benefits:\n<ul>\n<li>You can understand any spoken language.</li>\n<li>You can ably create written ciphers. Others can't decipher a code you create unless you teach them, they succeed on an Intelligence check (DC equal to your Intelligence score + your proficiency bonus), or they use magic to decipher it.</li>\n</ul>"
  },
  {
    "name": "Lucky",
    "type": "skill",
    "description": "You have inexplicable luck that seems to kick in at just the right moment.\n<br><br>\n    You have 3 luck points. Whenever you make an attack roll, an ability check, or a saving throw, you can spend one luck point to roll an additional d20. You can choose to spend one of your luck points after you roll the die, but before the outcome is determined. You choose which of the d20s is used for the attack roll, ability check, or saving throw.\n<br><br>\n    You can also spend one luck point when an attack roll is made against you. Roll a d20 and then choose whether the attack uses the attacker's roll or yours.\n<br><br>\n    If more than one creature spends a luck point to influence the outcome of a roll, the points cancel each other out; no additional dice are rolled.\n<br><br>\n    You regain your expended luck points when you finish a long rest.",
    "uses": {
      "id": "4EBE7762-E44A-45D6-A71C-B68C96E5941E",
      "type": "fixed",
      "amount": 3,
      "reset": 2
    }
  },
  {
    "name": "Mage Slayer",
    "type": "combat",
    "description": "You have practiced techniques in melee combat against spellcasters, gaining the following benefits.\n<ul>\n<li>When a creature within 5 feet of you casts a spell, you can use your reaction to make a melee weapon attack against that creature before they cast the spell. If that attack hits, the target creature must make a Constitution saving throw in order to successfully cast the spell. The DC equals 10 or half of the damage the creature takes from the attack, whichever is higher. If the creature fails its saving throw, the spell fails and has no effect. If the creature succeeds on its saving throw, the spell is cast as normal.</li>\n<li>When you damage a creature that is concentrating on a spell, that creature has disadvantage on the saving throw it makes to maintain its concentration.</li>\n<li>You have advantage on saving throws against spells cast by creatures within 5 feet of you.</li>\n</ul>"
  },
  {
    "name": "Magic Initiate",
    "type": "multiclass",
    "repeatable": true,
    "description": "Choose a spell list: Arcane, Divine, Melodic, Occult, Primal, or Psionic. You learn two cantrips of your choice from that spell list.\n</p><p>\nIn addition, choose one 1st-level spell to learn from that same list. Using this feat, you can cast the spell once at its lowest level, and you must finish a long rest before you can cast it in this way again.</p><p> Your spellcasting ability for all three spells is Intelligence, Wisdom, or Charisma (your choice).",
    "choices": [
      {
        "id": "509FA97E-AAE1-4DD1-B05F-A7545143D587",
        "type": "text",
        "options": ["int", "wis", "cha"]
      },
      {
        "id": "DC33858F-9439-45CB-8314-8826F81493BD",
        "type": "trait",
        "options": [
          {
            "name": "Arcane",
            "traits": [
              {
                "name": "",
                "description": "You learn two cantrips and one 1st-level spell from the Arcane spell list.",
                "choices": [
                  {
                    "id": "A61E8608-CCB4-4A53-8BAC-E635638982EF",
                    "type": "spell",
                    "list": "Arcane",
                    "level": 0,
                    "ability": "509FA97E-AAE1-4DD1-B05F-A7545143D587"
                  },
                  {
                    "id": "F6BF1CBE-CB7C-408A-AB92-23C63D258C56",
                    "type": "spell",
                    "list": "Arcane",
                    "level": 0,
                    "ability": "509FA97E-AAE1-4DD1-B05F-A7545143D587"
                  },
                  {
                    "id": "AB58CFC7-F780-4C5D-9BBB-262A7C053F44",
                    "type": "spell",
                    "list": "Arcane",
                    "level": 1,
                    "ability": "509FA97E-AAE1-4DD1-B05F-A7545143D587"
                  }
                ]
              }
            ]
          },
          {
            "name": "Divine",
            "traits": [
              {
                "name": "",
                "description": "You learn two cantrips and one 1st-level spell from the Divine spell list.",
                "choices": [
                  {
                    "id": "2BEE1525-57FE-44FF-B44A-B2D769C199D1",
                    "type": "spell",
                    "list": "Divine",
                    "level": 0,
                    "ability": "509FA97E-AAE1-4DD1-B05F-A7545143D587"
                  },
                  {
                    "id": "0CBA6571-3129-47B3-90C1-A0F8573A835F",
                    "type": "spell",
                    "list": "Divine",
                    "level": 0,
                    "ability": "509FA97E-AAE1-4DD1-B05F-A7545143D587"
                  },
                  {
                    "id": "140CCAB1-ABCF-479C-BEBF-A1C6B050BFCD",
                    "type": "spell",
                    "list": "Divine",
                    "level": 1,
                    "ability": "509FA97E-AAE1-4DD1-B05F-A7545143D587"
                  }
                ]
              }
            ]
          },
          {
            "name": "Melodic",
            "traits": [
              {
                "name": "",
                "description": "You learn two cantrips and one 1st-level spell from the Melodic spell list.",
                "choices": [
                  {
                    "id": "E7B2409E-D384-45B9-9522-0BB2B5727C95",
                    "type": "spell",
                    "list": "Melodic",
                    "level": 0,
                    "ability": "509FA97E-AAE1-4DD1-B05F-A7545143D587"
                  },
                  {
                    "id": "5C1C3111-9644-498F-9EC5-625CF06B0FBD",
                    "type": "spell",
                    "list": "Melodic",
                    "level": 0,
                    "ability": "509FA97E-AAE1-4DD1-B05F-A7545143D587"
                  },
                  {
                    "id": "D9758B6A-B3DE-47A0-AC10-04358A48172C",
                    "type": "spell",
                    "list": "Melodic",
                    "level": 1,
                    "ability": "509FA97E-AAE1-4DD1-B05F-A7545143D587"
                  }
                ]
              }
            ]
          },
          {
            "name": "Occult",
            "traits": [
              {
                "name": "",
                "description": "You learn two cantrips and one 1st-level spell from the Occult spell list.",
                "choices": [
                  {
                    "id": "F9FCF920-B4D8-4B72-AA93-6C1F47F35EDD",
                    "type": "spell",
                    "list": "Occult",
                    "level": 0,
                    "ability": "509FA97E-AAE1-4DD1-B05F-A7545143D587"
                  },
                  {
                    "id": "2CC06600-0943-4B3E-9296-ECFA92B436EB",
                    "type": "spell",
                    "list": "Occult",
                    "level": 0,
                    "ability": "509FA97E-AAE1-4DD1-B05F-A7545143D587"
                  },
                  {
                    "id": "CFEAD66D-23ED-483F-9E5E-49A74E459E34",
                    "type": "spell",
                    "list": "Occult",
                    "level": 1,
                    "ability": "509FA97E-AAE1-4DD1-B05F-A7545143D587"
                  }
                ]
              }
            ]
          },
          {
            "name": "Primal",
            "traits": [
              {
                "name": "",
                "description": "You learn two cantrips and one 1st-level spell from the Primal spell list.",
                "choices": [
                  {
                    "id": "FEFAC4E0-3EC1-47D4-BFCA-EA69E83CD717",
                    "type": "spell",
                    "list": "Primal",
                    "level": 0,
                    "ability": "509FA97E-AAE1-4DD1-B05F-A7545143D587"
                  },
                  {
                    "id": "E97AE99F-C95A-498F-8010-3638155C47DC",
                    "type": "spell",
                    "list": "Primal",
                    "level": 0,
                    "ability": "509FA97E-AAE1-4DD1-B05F-A7545143D587"
                  },
                  {
                    "id": "719C19F1-A0C8-4738-8F67-DA2FB8EB92F8",
                    "type": "spell",
                    "list": "Primal",
                    "level": 1,
                    "ability": "509FA97E-AAE1-4DD1-B05F-A7545143D587"
                  }
                ]
              }
            ]
          },
          {
            "name": "Psionic",
            "traits": [
              {
                "name": "",
                "description": "You learn two cantrips and one 1st-level spell from the Psionic spell list.",
                "choices": [
                  {
                    "id": "10AD3030-6253-42CD-A8AD-6A303348799F",
                    "type": "spell",
                    "list": "Psionic",
                    "level": 0,
                    "ability": "509FA97E-AAE1-4DD1-B05F-A7545143D587"
                  },
                  {
                    "id": "D8719B0A-B7D4-484F-992D-AB6F8A323CC4",
                    "type": "spell",
                    "list": "Psionic",
                    "level": 0,
                    "ability": "509FA97E-AAE1-4DD1-B05F-A7545143D587"
                  },
                  {
                    "id": "81762691-35E3-42A6-8A31-5A08E7466AD9",
                    "type": "spell",
                    "list": "Psionic",
                    "level": 1,
                    "ability": "509FA97E-AAE1-4DD1-B05F-A7545143D587"
                  }
                ]
              }
            ]
          }
        ]
      }
    ],
    "uses": {
      "id": "168B8E69-B033-49B8-8613-DF11A0124641",
      "type": "fixed",
      "amount": 1,
      "reset": 2
    }
  },
  {
    "name": "Martial Adept",
    "type": "multiclass",
    "repeatable": true,
    "description": "You have martial training that allows you to perform special combat maneuvers. You gain the following benefits.\n<ul>\n    <li>You learn two Martial Exploits of your choice from among those available to the fighter class. If an exploit you use requires your target to make a saving throw to resist the exploit's effects, the saving throw DC equals 8 + your proficiency bonus + your Strength or Dexterity modifier (your choice).</li>\n<li>You gain one exploit die, which is a d6 (this die is added to any exploit dice you have from another source). This die is used to fuel your exploits. A exploit die is expended when you use it. You regain your expended exploit dice when you finish a short or long rest.</li>\n</ul>\nYou can take this feat multiple times, and gain additional exploit dice and exploit options each time.\n",
    "choices": [
      {
        "id": "63C920E6-7B5B-43C1-AC58-91134008E392",
        "type": "text",
        "options": ["str", "dex"]
      },
      {
        "id": "9645663B-414C-4321-AFE8-A9587D908786",
        "type": "exploit",
        "list": "Fighter",
        "ability": "63C920E6-7B5B-43C1-AC58-91134008E392"
      },
      {
        "id": "20CD041A-DC1D-432C-9869-AC1C554905CB",
        "type": "exploit",
        "list": "Fighter",
        "ability": "63C920E6-7B5B-43C1-AC58-91134008E392"
      }
    ],
    "granted": [
      {
        "type": "exploit-die",
        "amount": 1,
        "size": 6
      }
    ]
  },
  {
    "name": "Master of Disguise",
    "type": "skill",
    "description": "You have honed your ability to shape your personality and to read the personalities of others. You gain the following benefits:\n<ul>\n<li>Increase your Charisma score by 1, to a maximum of 20.</li>\n<li>You gain proficiency with the disguise kit. If you are already proficient with it, you add double your proficiency bonus to checks you make with it.</li>\n<li>If you spend 1 hour observing a creature, you can then spend 8 hours crafting a disguise you can quickly don to mimic that creature. Making the disguise requires a disguise kit. You must make checks as normal to disguise yourself, but you can assume the disguise as an action.</li>\n</ul>",
    "granted": [
      {
        "type": "asi",
        "score": "cha",
        "amount": 1
      },
      {
        "type": "tool",
        "options": ["Disguise Kit"],
        "level": 1.5
      }
    ]
  },
  {
    "name": "Medic",
    "type": "skill",
    "description": "You master the physician's arts, gaining the following benefits:\n<ul>\n<li>Increase your Wisdom score by 1, to a maximum of 20.</li>\n<li>You gain proficiency in the Medicine skill. If you are already proficient in the skill, you add double your proficiency bonus to checks you make with it.</li>\n<li>During a short rest, you can clean and bind the wounds of up to six willing beasts and humanoids. Make a DC 15 Wisdom (Medicine) check for each creature. On a success, if a creature spends a Hit Die during this rest, that creature can forgo the roll and instead regain the maximum number of hit points the die can restore. A creature can do so only once per rest, regardless of how many Hit Dice it spends.</li>\n</ul>",
    "granted": [
      {
        "type": "asi",
        "score": "wis",
        "amount": 1
      },
      {
        "type": "skill",
        "options": ["Medicine"],
        "level": 1.5
      }
    ]
  },
  {
    "name": "Medium Armor Master",
    "prereq": [
      {
        "medium": true
      }
    ],
    "type": "combat",
    "description": "You have practiced moving in medium armor to gain the following benefits:\n<ul>\n<li>Wearing medium armor doesn't impose disadvantage on your Dexterity (Stealth) checks.</li>\n<li>When you wear medium armor, you can add 3, rather than 2, to your AC if you have a Dexterity of 16 or higher.</li>\n</ul>\n"
  },
  {
    "name": "Menacing",
    "type": "skill",
    "description": "You become fearsome to others, gaining the following benefits:\n<ul>\n<li>Increase your Charisma score by 1, to a maximum of 20.</li>\n<li>You gain proficiency in the Intimidation skill. If you are already proficiency in the skill, you add double your proficiency bonus to checks you make with it.</li>\n<li>When you take the Attack action on your turn, you can replace one attack with an attempt to demoralize one humanoid you can see within 30 feet of you that can see and hear you. Make a Charisma (Intimidation) check contested by the target's Wisdom (Insight) check. If your check succeeds, the target is frightened until the end of your next turn. If your check fails, the target can't be frightened by you in this way for 1 hour.</li>\n</ul>",
    "granted": [
      {
        "type": "asi",
        "score": "cha",
        "amount": 1
      },
      {
        "type": "skill",
        "options": ["Intimidation"],
        "level": 1.5
      }
    ]
  },
  {
    "name": "Metamagic Adept",
    "prereq": [
      {
        "spellcasting": true
      }
    ],
    "type": "multiclass",
    "repeatable": true,
    "description": "You've learned how to exert your will on your spells to alter how they function:\n<ul>\n    <li>You learn two Metamagic options of your choice from the sorcerer class. You can use only one Metamagic option on a spell when you cast it, unless the option says otherwise. Whenever you reach a level that grants the Ability Score Improvement feature, you can replace one of these Metamagic options with another one from the sorcerer class.</li>\n<li>You gain 2 sorcery points to spend on Metamagic (these points are added to any sorcery points you have from another source but can be used only on Metamagic). You regain all spent sorcery points when you finish a long rest.</li>\n</ul>",
    "choices": [
      {
        "id": "ED44540C-997A-4D02-B673-34F7576CAF9D",
        "type": "metamagic"
      },
      {
        "id": "A8BBE624-8618-4221-8AF9-035E22C17AC4",
        "type": "metamagic"
      }
    ],
    "granted": [
      {
        "type": "sorcery-points",
        "amount": 2
      }
    ]
  },
  {
    "name": "Mighty Summons",
    "prereq": [
      {
        "spellcasting": true
      }
    ],
    "type": "magic",
    "description": "You have mastered summoning minions to fight for you, and your magic leaks over into their abilities. Creatures you summon by casting spells gain the following benefits:\n<ul>\n<li>Their attacks are considered magical for the purposes of overcoming resistance and immunity to nonmagical damage.</li>\n<li>They gain temporary hit points equal to your level when you summon them.</li>\n</ul>"
  },
  {
    "name": "Mobile",
    "type": "combat",
    "description": "You are exceptionally speedy and agile. You gain the following benefits:\n<ul>\n<li>Your speed increases by 10 feet.</li>\n<li>When you use the Dash action, difficult terrain doesn't cost you extra movement on that turn.</li>\n<li>When you make a melee attack against a creature, you don't provoke opportunity attacks from that creature for the rest of the turn, whether you hit or not.</li>\n</ul>"
  },
  {
    "name": "Moderately Armored",
    "prereq": [
      {
        "light": true
      }
    ],
    "type": "martial",
    "description": "You have trained to master the use of medium armor, gaining the following benefits:\n<ul>\n<li>Increase your Strength or Dexterity score by 1, to a maximum of 20.</li>\n<li>You gain proficiency with medium armor.</li><li>The time it takes for you to don medium armor is reduced to 1 minute.</li></ul>\n",
    "choices": {
      "id": "5B708195-1359-4272-8D8A-542986442D2F",
      "type": "asi",
      "amount": 1,
      "options": ["str", "dex"]
    },
    "granted": [
      {
        "type": "armor",
        "options": ["Medium"]
      }
    ]
  },
  {
    "name": "Martial Training",
    "type": "martial",
    "description": "You have trained with all manner of martial weaponry, gaining the following benefits:\n<ul>\n<li>Increase your Strength or Dexterity score by 1, to a maximum of 20.</li>\n<li>You gain proficiency with all martial weapons.</li></ul>\n",
    "choices": {
      "id": "5B708195-1359-4272-8D8A-542986442D2F",
      "type": "asi",
      "amount": 1,
      "options": ["str", "dex"]
    },
    "granted": [
      {
        "type": "weapon",
        "options": ["martial"]
      }
    ]
  },
  {
    "name": "Mounted Combatant",
    "type": "combat",
    "description": "You are a dangerous foe to face while mounted. While you are mounted and aren't incapacitated, you gain the following benefits:\n<ul>\n<li>You have advantage on melee attack rolls against any unmounted creature that is smaller than your mount.</li>\n<li>You can force an attack targeted at your mount to target you instead.</li>\n<li>If your mount is subjected to an effect that allows it to make Dexterity saving throw to take only half damage, it instead takes no damage if it succeeds on the saving throw, and only half damage if it fails.</li>\n</ul>"
  },
  {
    "name": "Mud Lover, Ground Hitter",
    "type": "combat",
    "description": "You are very accustomed to being shot at and to hitting the deck in an emergency. Unfortunately for you, cover is always a bit too far away. You gain the following benefits:\n<ul>\n<li>Increase your Dexterity or Constitution by 1, to a maximum of 20.</li>\n<li>When you are targeted by a ranged weapon attack, you may use your reaction to drop prone.</li>\n<li>Being prone does not impose disadvantage on your ranged weapon attacks.</li>\n<li>While prone, your speed increases by 10 feet.</li>\n</ul>",
    "choices": {
      "id": "53A4DBBB-3624-4DCE-9A57-463FFC07B84B",
      "type": "asi",
      "amount": 1,
      "options": ["dex", "con"]
    }
  },
  {
    "name": "Naturalist",
    "type": "skill",
    "description": "Your extensive study of nature rewards you with the following benefits:\n<ul>\n<li>Increase your Intelligence score by 1, to a maximum of 20.</li>\n<li>You gain proficiency in the Nature skill. If you are already proficient in the skill, you add double your proficiency bonus to checks you make with it.</li>\n<li>You learn the Detect Poison and Disease spells. You can cast Detect Poison and Disease once without expending a spell slot, and you regain the ability to do so when you finish a long rest.</li>\n</ul>",
    "granted": [
      {
        "type": "asi",
        "score": "int",
        "amount": 1
      },
      {
        "type": "skill",
        "options": ["Nature"],
        "level": 1.5
      },
      {
        "type": "spell",
        "options": ["Detect Poison and Disease"],
        "ignoreMaxLevel": true,
        "ability": "int"
      }
    ],
    "uses": {
      "id": "6C230CB9-CAA3-44DD-86BA-50F249515DC2",
      "type": "fixed",
      "amount": 1,
      "reset": 2
    }
  },
  {
    "name": "Observant",
    "type": "skill",
    "description": "Quick to notice details of your environment, you gain the following benefits:\n<ul>\n<li>Increase your Intelligence or Wisdom score by 1, to a maximum of 20.</li>\n<li>If you can see a creature's mouth while it is speaking a language you understand, you can interpret what it's saying by reading its lips.</li>\n<li>You have a +5 bonus to your passive Wisdom (Perception) and passive Intelligence (Investigation) scores.</li>\n</ul>",
    "choices": {
      "id": "8AB8A836-4BAB-42F4-9AE8-19F328BC9011",
      "type": "asi",
      "amount": 1,
      "options": ["int", "wis"]
    },
    "granted": [
      {
        "type": "passive-skill",
        "options": ["Insight", "Perception"],
        "amount": 5
      }
    ]
  },
  {
    "name": "Outlaw",
    "type": "combat",
    "description": "Nothing beats the smell of gunpowder in the moments after blasting away a foe. You gain the following benefits:\n<ul>\n<li>When you reduce a hostile creature to 0 hit points, you may take the Reload action as a Bonus Action until the end of your turn.</li>\n<li>When when you score a critical hit with a firearm, you may automatically reload up to 2 rounds, consuming ammo as normal.</li>\n<li>As an action, you can make as many attacks as ammunition left in the magazine of a one-handed cylinder-action firearm that you are proficient with. These attacks are always at disadvantage and cannot exceed the firearm's normal range.</li>\n<li>Lever-Action firearms that are light are considered to be one-handed for you.</li>\n</ul>"
  },
  {
    "name": "Perceptive",
    "type": "skill",
    "description": "You hone your senses until they become razor sharp. You gain the following benefits:\n<ul>\n<li>Increase your Wisdom score by 1, to a maximum of 20.</li>\n<li>You gain proficiency in the Perception skill. If you are already proficient in the skill, you add double your proficiency bonus to checks you make with it.</li>\n<li>Being in a lightly obscured area doesn't impose disadvantage on your Wisdom (Perception) checks if you can both see and hear.</li>\n</ul>",
    "granted": [
      {
        "type": "asi",
        "score": "wis",
        "amount": 1
      },
      {
        "type": "skill",
        "options": ["Perception"],
        "level": 1.5
      }
    ]
  },
  {
    "name": "Performer",
    "type": "skill",
    "description": "You master performance so that you can command any stage. You gain the following benefits:\n<ul>\n<li>Increase your Charisma score by 1, to a maximum of 20.</li>\n<li>You gain proficiency in the Performance skill. If you are already proficient in the skill, you add double your proficiency bonus to checks you make with it.</li>\n<li>While performing, you can try to distract one humanoid you can see who can see and hear you. Make a Charisma (Performance) check contested by the humanoid's Wisdom (Insight) check. If your check succeeds, you grab the humanoid's attention enough that it makes Wisdom (Perception) and Intelligence (Investigation) checks with disadvantage until you stop performing.</li>\n</ul>",
    "granted": [
      {
        "type": "asi",
        "score": "cha",
        "amount": 1
      },
      {
        "type": "skill",
        "options": ["Performance"],
        "level": 1.5
      }
    ]
  },
  {
    "name": "Pistolero",
    "type": "combat",
    "description": "You've honed your skill of aiming two weapons at the same time. You gain the following benefits:\n<ul>\n<li>When you take the Attack action and attack with a ranged weapon that you're holding in one hand, you can use a bonus action to attack with a different ranged weapon that you're holding in the other hand. You may add your ability modifier to the damage of the bonus attack.</li>\n<li>You can draw or stow two one-handed weapons when you would normally be able to draw or stow only one.</li>\n<li>You can take the Reload action to reload two light, one-handed firearms in each of your hands at once.</li>\n</ul>"
  },
  {
    "name": "Poisoner",
    "type": "skill",
    "description": "You can prepare and deliver deadly poisons, gaining the following benefits:\n<ul>\n<li>When you make a damage roll, you ignore resistance to poison damage.</li>\n<li>You can coat a weapon in poison as a bonus action, instead of an action.</li>\n<li>You gain proficiency with the poisoner's kit if you don't already have it. With one hour of work using a poisoner's kit and expending 50 gp worth of materials, you can create a number of doses of potent poison equal to your proficiency bonus. Once applied to a weapon or piece of ammunition, the poison retains its potency for 1 minute or until you hit with the weapon or ammunition. When a creature takes damage from the coated weapon or ammunition, that creature must succeed on a DC 14 Constitution saving throw or take 2d8 poison damage and become poisoned until the end of your next turn.</li>\n</ul>",
    "granted": [
      {
        "type": "tool",
        "options": ["Poisoner's Kit"],
        "level": 1
      }
    ]
  },
  {
    "name": "Quick-Fingered",
    "type": "skill",
    "description": "Your nimble fingers and agility let you perform sleight of hand. You gain the following benefits:\n<ul>\n<li>Increase your Dexterity score by 1, to a maximum of 20.</li>\n<li>You gain proficiency in the Sleight of Hand skill. If you are already proficient in the skill, you add double your proficiency bonus to checks you make with it.</li>\n<li>As a bonus action, you can make a Dexterity (Sleight of Hand) check to plant something on someone else, conceal an object on a creature, lift a purse, or take something from a pocket.</li>\n</ul>",
    "granted": [
      {
        "type": "asi",
        "score": "dex",
        "amount": 1
      },
      {
        "type": "skill",
        "options": ["Sleight of Hand"],
        "level": 1.5
      }
    ]
  },
  {
    "name": "Quipping Expertise",
    "type": "magic",
    "description": "Your quick tongue allows you to remark at any failure your enemies make, reducing their resolve to fight.  You gain the following benefits:<ul><li>You learn the Vicious Mockery cantrip.  Charisma is your spellcasting ability for it.</li><li>When a creature you can see within 30 feet of you fails an ability check or saving throw, or misses with an attack roll, you can use your reaction to cast Vicious Mockery targeting them.</li></ul>",
    "granted": [
      {
        "type": "spell",
        "options": ["Vicious Mockery"],
        "ability": "cha"
      }
    ]
  },
  {
    "name": "Resilient",
    "type": "skill",
    "repeatable": true,
    "description": "Choose one ability score. You gain the following benefits:\n<ul>\n<li>Increase the chosen ability score by 1, to a maximum of 20.</li>\n<li>You gain proficiency in saving throws using the chosen ability.</li>\n</ul>",
    "choices": {
      "id": "06F8FBA7-B3DF-4A47-AB76-568331F78409",
      "type": "asi",
      "amount": 1,
      "options": ["str", "dex", "con", "int", "wis", "cha"]
    },
    "granted": [
      {
        "type": "save-proficiency",
        "options": ["06F8FBA7-B3DF-4A47-AB76-568331F78409"]
      }
    ]
  },
  {
    "name": "Revenant Warrior",
    "type": "martial",
    "description": "You have trained extensively with double weapons. You gain the following benefits:\n<ul>\n<li>Increase your Strength or Dexterity score by 1, to a maximum of 20.</li>\n<li>You gain proficiency with one weapon of your choice that has the Double property.</li>\n<li>While wielding weapon with the Double property with two hands, you gain +1 AC.</li>\n</ul>",
    "choices": [
      {
        "id": "EE666D22-3449-4B36-9DE6-18B19AE758BD",
        "type": "asi",
        "amount": 1,
        "options": ["str", "dex"]
      },
      {
        "id": "45715457-AD5B-46C6-94B6-6204BF470F52",
        "type": "exotic-weapon",
        "limits": ["Bo Staff", "Double Scimitar", "Double Spear"]
      }
    ]
  },
  {
    "name": "Ritual Caster",
    "prereq": [
      {
        "spellcasting": true
      }
    ],
    "type": "magic",
    "repeatable": true,
    "description": "You have learned a number of spells that you can cast as rituals. These spells are written in a ritual book, which you must have in hand while casting one of them.\n<br><br>\n    When you choose this feat, you acquire a ritual book holding two 1st-level spells of your choice. Choose one of the following spell lists: Arcane, Divine, Melodic, Occult, Primal, or Psionic. You must choose your spells from that spell list, and the spells you choose must have the ritual tag. Your spellcasting ability for these rituals is Intelligence, Wisdom, or Charisma (your choice).<br><br>\nIf you come across a spell in written form, such as a magical spell scroll or a wizard's spellbook, you might be able to add it to your ritual book. The spell must be on the spell list you chose, the spell's level can be no higher than half your level (rounded up), and it must have the ritual tag. The process of copying the spell into your ritual book takes 2 hours per level of the spell, and costs 50 gp per level. The cost represents the material components you expend as you experiment with the spell to master it, as well as the fine inks you need to record it.\n",
    "choices": {
      "id": "8DA91B1C-F140-456D-A07E-8FCED82CFFD8",
      "type": "text",
      "options": ["int", "wis", "cha"]
    },
    "listed": {
      "id": "1E03FB51-E78A-43FC-A8FD-D605871C8063",
      "type": "spell",
      "list": "Arcane",
      "ritualsOnly": true,
      "spellcaster-type": 1,
      "ability": "8DA91B1C-F140-456D-A07E-8FCED82CFFD8"
    }
  },
  {
    "name": "Savage Warrior",
    "type": "multiclass",
    "repeatable": true,
    "description": "You fight with a primal ferocity that allows you to perform special combat maneuvers. You gain the following benefits.\n<ul>\n    <li>You learn two Savage Exploits of your choice from among those available to the barbarian class. If an exploit you use requires your target to make a saving throw to resist the exploit's effects, the saving throw DC equals 8 + your proficiency bonus + your Strength modifier.</li>\n<li>You gain one exploit die, which is a d6 (this die is added to any exploit dice you have from another source). This die is used to fuel your exploits. A exploit die is expended when you use it. You regain your expended exploit dice when you finish a short or long rest.</li>\n</ul>\nYou can take this feat multiple times, and gain additional exploit dice and exploit options each time.\n",
    "choices": [
      {
        "id": "333556BA-A4F7-4092-92FC-B5BEEC804372",
        "type": "exploit",
        "list": "Barbarian",
        "ability": "str"
      },
      {
        "id": "2E8BC3CB-2BEE-4912-9747-74525AF38225",
        "type": "exploit",
        "list": "Barbarian",
        "ability": "str"
      }
    ],
    "granted": [
      {
        "type": "exploit-die",
        "amount": 1,
        "size": 6
      }
    ]
  },
  {
    "name": "Sentinel",
    "type": "combat",
    "description": "You have mastered techniques to take advantage of every drop in any enemy's guard, gaining the following benefits.\n<ul>\n<li>When you hit a creature with an opportunity attack, the creature's speed becomes 0 for the rest of the turn.</li>\n<li>Creatures provoke opportunity attacks from you even if they take the Disengage action before leaving your reach.</li>\n<li>When a creature makes an attack against a target other than you (and that target doesn't have this feat), you can use your reaction to make a melee weapon attack against the attacking creature.</li>\n</ul>"
  },
  {
    "name": "Shadow-Touched",
    "type": "magic",
    "repeatable": true,
    "description": "Your exposure to the Shadowfell's magic has changed you, granting you the following benefits:\n<ul>\n<li>Increase your Intelligence, Wisdom, or Charisma score by 1, to a maximum of 20.</li>\n    <li>You learn the Invisibility spell and one 1st-level spell of your choice. The 1st-level spell must be from the Illusion or Necromancy school of magic. You can cast each of these spells without expending a spell slot. Once you cast either of these spells in this way, you can't cast that spell in this way again until you finish a long rest. You can also cast these spells using spell slots you have of the appropriate level. The spells' spellcasting ability is the ability increased by this feat.</li>\n</ul>",
    "choices": [
      {
        "id": "BD68A7F3-CEEE-410C-B7F5-7A2EA37A1EFF",
        "type": "asi",
        "amount": 1,
        "options": ["int", "wis", "cha"]
      },
      {
        "id": "0A617E0B-A697-4E14-A427-BDF4F62AC3C9",
        "type": "spell",
        "level": 1,
        "list": ["Illusion", "Necromancy"],
        "ability": "BD68A7F3-CEEE-410C-B7F5-7A2EA37A1EFF"
      }
    ],
    "granted": [
      {
        "type": "spell",
        "options": ["Invisibility"],
        "ignoreMaxLevel": true,
        "ability": "BD68A7F3-CEEE-410C-B7F5-7A2EA37A1EFF"
      }
    ],
    "uses": [
      {
        "id": "B1EDAD60-A042-439A-ADEF-79AADCF2AF04",
        "type": "fixed",
        "amount": 1,
        "reset": 2
      },
      {
        "id": "29D6D558-5422-45D9-B4EF-1D16DC29871B",
        "type": "fixed",
        "amount": 1,
        "reset": 2
      }
    ]
  },
  {
    "name": "Shield Master",
    "type": "combat",
    "description": "You use shields not just for protection but also for offense. You gain the following benefits while you are wielding a shield:\n<ul>\n<li>If you take the Attack action on your turn, you can use a bonus action to try to shove a creature within 5 feet of you with your shield.</li>\n<li>If you aren't incapacitated, you can add your shield's AC bonus to any Dexterity saving throw you make against a spell or other harmful effect.</li>\n<li>If you are subjected to an effect that allows you to make a Dexterity saving throw to take only half damage, you can use your reaction to take no damage if you succeed on the saving throw, interposing your shield between yourself and the source of the effect.</li>\n</ul>"
  },
  {
    "name": "Shield Training",
    "type": "martial",
    "description": "You've trained in the effective use of shields. You gain the following benefits:\n<ul>\n<li>Increase your Strength, Dexterity, or Constitution score by 1, to a maximum of 20.</li>\n<li>You gain proficiency with shields.</li>\n<li>In combat, you can don or doff a shield as the free object interaction on your turn.</li>\n<li>If can cast spells, you can use a shield as a spellcasting focus.</li>\n</ul>",
    "choices": {
      "id": "8C25A7F6-2F14-45FB-AD3C-D319F7D097F3",
      "type": "asi",
      "amount": 1,
      "options": ["str", "dex", "con"]
    },
    "granted": [
      {
        "type": "armor",
        "options": ["Shields"]
      }
    ]
  },
  {
    "name": "Silver-Tongued",
    "type": "skill",
    "description": "You develop your conversational skill to better deceive others. You gain the following benefits.\n<ul>\n<li>Increase your Charisma score by 1, to a maximum of 20.</li>\n<li>You gain proficiency in the Deception skill. If you are already proficient in the skill, you add double your proficiency bonus to checks you make with it.</li>\n<li>When you take the Attack action on your turn, you can replace one attack with an attempt to deceive one humanoid you can see within 30 feet of you that can see and hear you. Make a Charisma (Deception) check contested by the target's Wisdom (Insight) check. If your check succeeds, your movement doesn't provoke opportunity attacks from the target and your attack rolls against it have advantage; both benefits last until the end of your next turn or until you use this ability on a different target. If your check fails, the target can't be deceived by you in this way for 1 hour.</li>\n</ul>",
    "granted": [
      {
        "type": "asi",
        "score": "cha",
        "amount": 1
      },
      {
        "type": "skill",
        "options": ["Deception"],
        "level": 1.5
      }
    ]
  },
  {
    "name": "Skill Expert",
    "type": "skill",
    "repeatable": true,
    "description": "You have honed your proficiency with particular skills, granting you the following benefits:\n<ul>\n<li>Increase one ability score of your choice by 1, to a maximum of 20.</li>\n<li>You gain proficiency in one skill of your choice.</li>\n<li>Choose one skill in which you have proficiency. You gain expertise with that skill, which means your proficiency bonus is doubled for any ability check you make with it. The skill you choose must be one that isn't already benefiting from a feature, such as Expertise, that doubles your proficiency bonus.</li>\n</ul>",
    "choices": [
      {
        "id": "64A7C7CA-97E7-4846-B77C-73EAC1D6A272",
        "type": "asi",
        "amount": 1,
        "options": ["str", "dex", "con", "int", "wis", "cha"]
      },
      {
        "id": "C02FE6A6-9745-4817-A1BE-71F98D0E5F6F",
        "type": "skill",
        "level": 1
      },
      {
        "id": "657CB58C-51BD-417B-8B24-B79D875E956C",
        "type": "skill",
        "level": 1.5
      }
    ]
  },
  {
    "name": "Skilled",
    "type": "skill",
    "repeatable": true,
    "description": "You gain proficiency in any combination of three skills or tools of your choice.",
    "choices": [
      {
        "id": "FAAE8251-7241-4C21-8B34-F169527EE20C",
        "type": ["skill", "tool", "instrument"],
        "level": 1
      },
      {
        "id": "5ACE8410-2DE6-4FB0-A672-4DCBA14B0772",
        "type": ["skill", "tool", "instrument"],
        "level": 1
      },
      {
        "id": "0F33267C-206E-40B6-B563-5F38CFF6BA4B",
        "type": ["skill", "tool", "instrument"],
        "level": 1
      }
    ]
  },
  {
    "name": "Skulker",
    "prereq": [
      {
        "dex": 13
      }
    ],
    "type": "combat",
    "description": "You are an expert at slinking through shadows. You gain the following benefits:\n<ul>\n<li>You can try to hide when you are lightly obscured from the creature from which you are hiding.</li>\n<li>When you are hidden from a creature and miss it with a ranged weapon attack, making the attack doesn't reveal your position.</li>\n<li>Dim light doesn't impose disadvantage on your Wisdom (Perception) checks relying on sight.</li>\n</ul>\n"
  },
  {
    "name": "Spell Sniper",
    "prereq": [
      {
        "spellcasting": true
      }
    ],
    "type": "magic",
    "repeatable": true,
    "description": "You have learned techniques to enhance your attacks with certain kinds of spells, gaining the following benefits:\n<ul>\n<li>When you cast a spell that requires you to make an attack roll, the spell's range is doubled.</li>\n<li>Your ranged spell attacks ignore half cover and three-quarters cover.</li>\n<li>You learn one cantrip that requires an attack roll. Choose the cantrip from any spell list. Your spellcasting ability for the cantrip is Intelligence, Wisdom, or Charisma (your choice).",
    "choices": [
      {
        "id": "D1A4DA26-F98C-47AF-9A4A-796593D09A77",
        "type": "text",
        "options": ["int", "wis", "cha"]
      },
      {
        "id": "EC41135B-DA62-419C-9314-947C8033BA87",
        "type": "spell",
        "level": 0,
        "ability": "D1A4DA26-F98C-47AF-9A4A-796593D09A77"
      }
    ]
  },
  {
    "name": "Stealthy",
    "type": "skill",
    "description": "You know how best to hide. You gain the following benefits:\n<ul>\n<li>Increase your Dexterity score by 1, to a maximum of 20.</li>\n<li>You gain proficiency in the Stealth skill. If you are already proficient in the skill, you add double your proficiency bonus to checks you make with it.</li>\n<li>If you are hidden, you can move up to 10 feet in the open without revealing yourself if you end the move in a position where you're not clearly visible.</li>\n</ul>",
    "granted": [
      {
        "type": "asi",
        "score": "dex",
        "amount": 1
      },
      {
        "type": "skill",
        "options": ["Stealth"],
        "level": 1.5
      }
    ]
  },
  {
    "name": "Supreme Power",
    "type": "multiclass",
    "repeatable": true,
    "description": "You have discovered an immense source of power within yourself: you learn one Astounding Power of your choice from the empowered class, assuming you meet its prerequisites.\n<br><br>\n    Whenever you gain a level, you can replace the power with another one from the empowered class.\n",
    "choices": {
      "id": "96262067-15CC-46A4-AEF5-56FA94537A15",
      "type": "astounding-power"
    }
  },
  {
    "name": "Scholarly Bearing",
    "type": "multiclass",
    "repeatable": true,
    "description": "You have studied a particular field to an extreme: you learn one Scholarly Pursuit of your choice from the savant class, assuming you meet its prerequisites.\n<br><br>\n    Whenever you gain a level, you can replace the pursuit with another one from the savant class.\n",
    "choices": {
      "id": "1357A806-4EFB-450D-B0CF-6CD54350C36B",
      "type": "scholarly-pursuit"
    }
  },
  {
    "name": "Wilderness Wanderer",
    "type": "multiclass",
    "repeatable": true,
    "description": "You have spent a large amount of time in the wild: you learn one Survivalist Knack of your choice from the nomad or ranger class, assuming you meet its prerequisites.\n<br><br>\n    Whenever you gain a level, you can replace the pursuit with another one from the nomad or ranger class.\n",
    "choices": {
      "id": "7CAC97F0-A40B-4615-90B2-0541C1C281E1",
      "type": "survivalist-knack"
    }
  },
  {
    "name": "Survivalist",
    "type": "skill",
    "description": "You master wilderness lore, gaining the following benefits:\n<ul>\n<li>Increase your Wisdom score by 1, to a maximum of 20.</li>\n<li>You gain proficiency in the Survival skill. If you are already proficient in the skill, you add double your proficiency bonus to checks you make with it.</li>\n<li>You learn the Snare spell. You can cast it once without expending a spell slot, and you regain the ability to do so when you finish a long rest. Wisdom is your spellcasting ability for it.</li>\n</ul>",
    "granted": [
      {
        "type": "asi",
        "score": "wis",
        "amount": 1
      },
      {
        "type": "skill",
        "options": ["Survival"],
        "level": 1.5
      },
      {
        "type": "spell",
        "options": ["Snare"],
        "ignoreMaxLevel": true,
        "ability": "wis"
      }
    ],
    "uses": {
      "id": "F6FAA832-084B-4DA3-A254-BFF2AE0DCF5A",
      "type": "fixed",
      "amount": 1,
      "reset": 2
    }
  },
  {
    "name": "Tactician",
    "type": "multiclass",
    "repeatable": true,
    "description": "You have a tactical sixth sense that allows you to perform special combat maneuvers. You gain the following benefits.\n<ul>\n    <li>You learn two Tactical Exploits of your choice from among those available to the warlord class. If an exploit you use requires your target to make a saving throw to resist the exploit's effects, the saving throw DC equals 8 + your proficiency bonus + your Intelligence, Wisdom, or Charisma modifier (your choice).</li>\n<li>You gain one exploit die, which is a d6 (this die is added to any exploit dice you have from another source). This die is used to fuel your exploits. A exploit die is expended when you use it. You regain your expended exploit dice when you finish a short or long rest.</li>\n</ul>\nYou can take this feat multiple times, and gain additional exploit dice and exploit options each time.\n",
    "choices": [
      {
        "id": "30AAB77B-C9D0-4B2F-BCB3-F18A2F73E6E1",
        "type": "text",
        "options": ["int", "wis", "cha"]
      },
      {
        "id": "B999B06E-D76C-48E5-BC4C-452A28FDA7EF",
        "type": "exploit",
        "list": "Warlord",
        "ability": "30AAB77B-C9D0-4B2F-BCB3-F18A2F73E6E1"
      },
      {
        "id": "5992CDFA-1403-479D-9375-63F3CA10159B",
        "type": "exploit",
        "list": "Warlord",
        "ability": "30AAB77B-C9D0-4B2F-BCB3-F18A2F73E6E1"
      }
    ],
    "granted": [
      {
        "type": "exploit-die",
        "amount": 1,
        "size": 6
      }
    ]
  },
  {
    "name": "Tandem Tactician",
    "type": "combat",
    "description": "Your presence in a scrap tends to elevate your comrades. You gain the following benefits:\n<ul>\n<li>You can use the Help action as a bonus action.</li>\n<li>When you use the Help action to aid an ally in attacking a creature, increase the range of the Help action by 10 feet. Additionally, you can help two allies targeting the same creature within range when you use the Help action this way.</li>\n</ul>"
  },
  {
    "name": "Tavern Brawler",
    "type": "combat",
    "description": "Accustomed to the rough-and-tumble fighting using whatever weapons happen to be at hand, you gain the following benefits:\n<ul>\n<li>Increase your Strength or Consititution score by 1, to a maximum of 20.</li>\n<li>You are proficient with improvised weapons.</li>\n<li>The damage dice of your unarmed strike increase by one step, to a maximum of d10s.</li>\n<li>You can grapple a creature as a bonus action.</li>\n</ul>",
    "choices": {
      "id": "08218467-6D72-4B8C-869B-1AADDAEB03FB",
      "type": "asi",
      "amount": 1,
      "options": ["str", "con"]
    },
    "granted": [
      {
        "type": "weapon",
        "options": ["Improvised"]
      }
    ]
  },
  {
    "name": "Telekinetic",
    "type": "magic",
    "description": "You learn to move things with your mind, granting you the following benefits:\n<ul>\n<li>Increase your Intelligence, Wisdom, or Charisma score by 1, to a maximum of 20.</li>\n<li>You learn the Mage Hand cantrip. You can cast it without verbal or somatic components, and you can make the spectral hand invisible. If you already know this spell, its range increases by 30 feet when you cast it. Its spellcasting ability is the ability increased by this feat.</li>\n<li>As a bonus action, you can try to telekinetically shove one creature you can see within 30 feet of you. When you do so, the target must succeed on a Strength saving throw (DC 8 + your proficiency bonus + the ability modifier of the score increased by this feat) or be moved 5 feet toward or away from you. A creature can willingly fail this save.</li>\n</ul>",
    "choices": {
      "id": "8A07601E-FD43-4A60-9705-51CD579781F2",
      "type": "asi",
      "amount": 1,
      "options": ["int", "wis", "cha"]
    },
    "granted": [
      {
        "type": "spell",
        "options": ["Mage Hand"],
        "ability": "8A07601E-FD43-4A60-9705-51CD579781F2"
      }
    ]
  },
  {
    "name": "Telepathic",
    "type": "magic",
    "description": "You awaken the ability to mentally connect with others, granting you the following benefits:\n<ul>\n<li>Increase your Intelligence, Wisdom, or Charisma score by 1, to a maximum of 20.</li>\n<li>You can speak telepathically to any creature you can see within 60 feet of you. Your telepathic utterances are in a language you know, and the creature understands you only if it knows that language. Your communication doesn't give the creature the ability to respond to you telepathically.</li>\n<li>You can cast the Detect Thoughts spell, requiring no spell slot or components, and you must finish a long rest before you can cast it this way again. Your spellcasting ability for the spell is the ability increased by this feat. If you have spell slots of 2nd level or higher, you can cast this spell with them.</li>\n</ul>",
    "choices": {
      "id": "A7516C6E-88B8-4D3C-B30C-5F3B6EE5B624",
      "type": "asi",
      "amount": 1,
      "options": ["int", "wis", "cha"]
    },
    "granted": [
      {
        "type": "telepathy",
        "range": 60
      },
      {
        "type": "spell",
        "options": ["Detect Thoughts"],
        "ignoreMaxLevel": true,
        "ability": "A7516C6E-88B8-4D3C-B30C-5F3B6EE5B624"
      }
    ],
    "uses": {
      "id": "992E71D8-6B5E-43CE-A65F-320008412745",
      "type": "fixed",
      "amount": 1,
      "reset": 2
    }
  },
  {
    "name": "Theologian",
    "type": "skill",
    "description": "Your extensive study of religion rewards you with the following benefits.\n<ul>\n<li>Increase your Intelligence score by 1, to a maximum of 20.</li>\n<li>You gain proficiency in the Religion skill. If you are already proficient in the skill, you add double your proficiency bonus to checks you make with it.</li>\n<li>You learn the Detect Evil and Good spell. You can cast Detect Evil and Good once without expending a spell slot, and you regain the ability to do so when you finish a long rest.</li>\n</ul>",
    "granted": [
      {
        "type": "asi",
        "score": "int",
        "amount": 1
      },
      {
        "type": "skill",
        "options": ["Religion"],
        "level": 1.5
      },
      {
        "type": "spell",
        "options": ["Detect Evil and Good"],
        "ignoreMaxLevel": true,
        "ability": "int"
      }
    ],
    "uses": {
      "id": "31F3CA22-5E7B-4181-A928-6D1C587A5518",
      "type": "fixed",
      "amount": 1,
      "reset": 2
    }
  },
  {
    "name": "Tracker",
    "type": "skill",
    "description": "You have spent time hunting creatures and honed your skills, gaining the following benefits:\n<ul>\n<li>Increase your Wisdom score by 1, to a maximum of 20.</li>\n<li>You learn the Hunter's Mark spell. You can cast it once without expending a spell slot, and you must finish a long rest before you can cast it in this way again. You can also cast the spell using any spell slots you have. Wisdom is your spellcasting ability for this spell.</li>\n<li>You have advantage on Wisdom (Survival) checks to track creatures.</li>\n</ul>",
    "granted": [
      {
        "type": "asi",
        "score": "wis",
        "amount": 1
      },
      {
        "type": "spell",
        "options": ["Hunter's Mark"],
        "ignoreMaxLevel": true,
        "ability": "wis"
      }
    ],
    "uses": {
      "id": "B417F227-C83B-41B2-9D0B-D07A9756EDF7",
      "type": "fixed",
      "amount": 1,
      "reset": 2
    }
  },
  {
    "name": "Defiant Will",
    "type": "multiclass",
    "repeatable": true,
    "description": "Your will is endless and your constitution is impeccable.. You gain the following benefits.\n<ul>\n    <li>You learn two Defiant Exploits of your choice from among those available to the juggernaut class. If an exploit you use requires your target to make a saving throw to resist the exploit's effects, the saving throw DC equals 8 + your proficiency bonus + your Constitution modifier.</li>\n<li>You gain one exploit die, which is a d6 (this die is added to any exploit dice you have from another source). This die is used to fuel your exploits. A exploit die is expended when you use it. You regain your expended exploit dice when you finish a short or long rest.</li>\n</ul>\nYou can take this feat multiple times, and gain additional exploit dice and exploit options each time.\n",
    "choices": [
      {
        "id": "538C8283-F813-4C7A-9DDB-A068DAD7600A",
        "type": "exploit",
        "list": "Juggernaut",
        "ability": "con"
      },
      {
        "id": "65E376B0-A86D-4ECD-AAD8-7A0703A2352A",
        "type": "exploit",
        "list": "Juggernaut",
        "ability": "con"
      }
    ],
    "granted": [
      {
        "type": "exploit-die",
        "amount": 1,
        "size": 6
      }
    ]
  },
  {
    "name": "War Caster",
    "prereq": [
      {
        "spellcasting": true
      }
    ],
    "type": "magic",
    "description": "You have practiced casting spells in the midst of combat, learning techniques that grant you the following benefits:\n<ul>\n<li>You have advantage on Constitution saving throws that you make to maintain your concentration on a spell when you take damage.</li>\n<li>You can perform the somatic components of spells even when you have weapons or a shield in one or both hands.</li>\n<li>When a hostile creature's movement provokes an opportunity attack from you, you can use your reaction to cast a spell at the creature, rather than making an opportunity attack. The spell must have a casting time of 1 action and must target only that creature.</li>\n</ul>\n"
  },
  {
    "name": "Wind Walker",
    "prereq": [
      {
        "race": ["aarakocra"]
      }
    ],
    "type": "racial",
    "description": "A master of the wind, you can pick up subtle changes in the air, able to adapt to sudden changes.<ul><li>Your flight speed is increased by 10 feet.</li><li>You have advantage on saving throws against effects that involve wind. If you succeed on a saving throw against such an effect, you can use your reaction to immediately move up to half your flying speed.</li><li>In windy conditions, your flight speed is doubled.</li></ul>",
    "granted": [
      {
        "type": "speed-bonus",
        "speed": "fly",
        "amount": 10
      }
    ]
  },
  {
    "name": "Strong Wings",
    "prereq": [
      {
        "race": ["aarakocra"]
      }
    ],
    "type": "racial",
    "description": "Your flying is strong and powerful compared to other aarakocra allowing you to carry more weight during flight.<ul><li>Increase your Strength score by 1, to a maximum of 20.</li><li>You can now fly while wearing medium armor.</li></ul>",
    "granted": [
      {
        "type": "asi",
        "score": "str",
        "amount": 1
      }
    ]
  },
  {
    "name": "Angelic Protection",
    "prereq": [
      {
        "race": ["aasimar"]
      }
    ],
    "type": "racial",
    "description": "The innate resistance to magic that angels possess extends to you. You have advantage on saving throws against spells and other magical effects."
  },
  {
    "name": "Well-Rested",
    "prereq": [
      {
        "race": ["bugbear"]
      }
    ],
    "type": "racial",
    "description": "Your practiced napping leaves you invigorated when you are awake. You gain the following benefits:<ul><li>Increase your Strength or Dexterity score by 1, to a maximum of 20.</li><li>Whenever you spend one or more hit dice during a short rest, you can regain an extra 1d6 hit points.</li><li>When you fail an ability check or saving throw, you can choose to reroll it and take the higher roll.  You can use this feature once, and regain the ability to do so when you finish a long rest.</li></ul>",
    "choices": {
      "id": "A7516C6E-88B8-4D3C-B30C-5F3B6EE5B624",
      "type": "asi",
      "amount": 1,
      "options": ["str", "dex"]
    },
    "uses": {
      "id": "12D62F0D-E00F-4943-8A5D-B6F2975332A2",
      "type": "fixed",
      "amount": 1,
      "reset": 2
    }
  },
  {
    "name": "Adaptive Shapechange",
    "prereq": [
      {
        "race": ["changeling", "synthsteel"]
      }
    ],
    "type": "racial",
    "description": "Your shapechanging abilities are particularly refined, and allow you to adapt to your environment. You can cast the Alter Self spell. Charisma is your spellcasting ability for it.",
    "granted": [
      {
        "type": "spell",
        "options": ["Alter Self"],
        "ability": "cha",
        "ignoreMaxLevel": true
      }
    ],
    "uses": {
      "id": "993D89F1-320E-4990-A809-9DB00D4CDC6F",
      "type": "fixed",
      "amount": 1,
      "reset": 1
    }
  },
  {
    "name": "Draconic Ferocity",
    "prereq": [
      {
        "race": ["dragonborn"]
      }
    ],
    "type": "racial",
    "description": "You take on the ferocious presence of dragons. You gain the following benefits:<ul><li>Increase your Strength, Constitution, or Charisma score by 1, to a maximum of 20.</li><li>Instead of exhaling destructive energy, you can expend a use of your Breath Weapon trait to roar, forcing each creature of your choice within 30 feet of you to make a Wisdom saving throw (DC 8 + your proficiency bonus + your Constitution modifier). A target automatically succeeds on the save if it can't hear or see you. On a failed save, a target becomes frightened for 1 minute. If the frightened target takes any damage, it can repeat the saving throw, ending the effect on itself on a success.</li><li>You can grow retractable claws from the tips of your fingers. Extending or retracting the claws requires no action. The claws are natural weapons, which you can use to make unarmed strikes. If you hit with them, you deal slashing damage equal to 1d6 + your Strength modifier, instead of the normal bludgeoning damage for an unarmed strike.</li></ul>",
    "choices": {
      "id": "0591FBDC-C20A-4A8A-BE69-6E745C5C2CFB",
      "type": "asi",
      "amount": 1,
      "options": ["str", "con", "cha"]
    }
  },
  {
    "name": "Dwarven Fortitude",
    "prereq": [
      {
        "race": ["dwarf", "half-dwarf"]
      }
    ],
    "type": "racial",
    "description": "You have the blood of dwarf heroes flowing through your veins. You gain the following benefits:<ul><li>Increase your Constitution score by 1, to a maximum of 20.</li><li>Whenever you take the Dodge action in combat, you can spend one Hit Die to heal yourself. Roll the die, add your Constitution modifier, and regain a number of hit points equal to the total (minimum of 1).</li></ul>",
    "granted": [
      {
        "type": "asi",
        "score": "con",
        "amount": 1
      }
    ]
  },
  {
    "name": "Elven Accuracy",
    "prereq": [
      {
        "race": ["elf", "half-elf"]
      }
    ],
    "type": "racial",
    "description": "The accuracy of elves is legendary, especially that of elf archers and spellcasters. You have uncanny aim with attacks that rely on precision rather than brute force. You gain the following benefits:<ul><li>Increase your Dexterity, Intelligence, Wisdom, or Charisma score by 1, to a maximum of 20</li><li>Whenever you have advantage on an attack roll using Dexterity, Intelligence, Wisdom, or Charisma, you roll three dice, rather than two, and take the highest result.</li></ul>",
    "choices": {
      "id": "32E49E39-D7BF-4843-BE5F-F76E5FC4A40F",
      "type": "asi",
      "amount": 1,
      "options": ["dex", "int", "wis", "cha"]
    }
  },
  {
    "name": "Quickling Blood",
    "prereq": [
      {
        "race": ["fairy"]
      }
    ],
    "type": "racial",
    "description": "You have traces of quickling blood in your veins, allowing you to make your position imprecise. You can cast the Blur spell. Charisma is your spellcasting ability for it. You can cast it in this way once, and regain the ability to do so when you finish a long rest.",
    "granted": [
      {
        "type": "spell",
        "options": ["Blur"],
        "ability": "cha",
        "ignoreMaxLevel": true
      }
    ],
    "uses": {
      "id": "A06B932E-4618-4AD5-94FA-77A7054F66D6",
      "type": "fixed",
      "amount": 1,
      "reset": 2
    }
  },
  {
    "name": "Pixie Blood",
    "prereq": [
      {
        "race": ["fairy"]
      }
    ],
    "type": "racial",
    "description": "You have traces of pixie blood in your veins, allowing you to make yourself invisible. You can cast the Invisibility spell on yourself. Charisma is your spellcasting ability for it. You can cast it in this way once, and regain the ability to do so when you finish a long rest.",
    "granted": [
      {
        "type": "spell",
        "options": ["Invisibility"],
        "ability": "cha",
        "ignoreMaxLevel": true
      }
    ],
    "uses": {
      "id": "B26099FB-C7D2-4FAD-B4AF-35CFD5A94D91",
      "type": "fixed",
      "amount": 1,
      "reset": 2
    }
  },
  {
    "name": "Sprite Blood",
    "prereq": [
      {
        "race": ["fairy"]
      }
    ],
    "type": "racial",
    "description": "You have traces of sprite blood in your veins, allowing you to determine the attitudes of others. As an action, you can touch a creature and force them to make a Charisma saving throw (DC = 8 + your Charisma modifier + your proficiency bonus). On a failed saving throw, you learn the target's alignment and its bonds, ideals, and flaws.  You can use this feature once, and regain the ability to do so when you finish a short or long rest.",
    "uses": {
      "id": "3D4F0668-9921-4209-A3FD-624CB3A33982",
      "type": "fixed",
      "amount": 1,
      "reset": 1
    }
  },
  {
    "name": "Beast Magic",
    "prereq": [
      {
        "race": ["firbolg", "shifter"]
      }
    ],
    "type": "racial",
    "description": "Your connection to animals deepens. You learn the Speak with Animals spell and can cast it at will, without expending a spell slot. You also learn the Animal Friendship and Beast Sense spells, each of which you can cast once without expending a spell slot. You regain the ability to cast these two spells in this way when you finish a long rest. Wisdom is your spellcasting ability for all three spells.",
    "granted": [
      {
        "type": "spell",
        "options": ["Speak with Animals"],
        "atWill": true,
        "ignoreMaxLevel": true
      },
      {
        "type": "spell",
        "options": ["Animal Friendship", "Beast Sense"],
        "ignoreMaxLevel": true
      }
    ],
    "uses": [
      {
        "id": "105F85CC-BC33-4225-8230-DE48E4D304D5",
        "type": "fixed",
        "amount": 1,
        "reset": 2
      },
      {
        "id": "59A1A92B-4CA2-47B0-B6EF-3A0DBB143DBD",
        "type": "fixed",
        "amount": 1,
        "reset": 2
      }
    ]
  },
  {
    "name": "Antimagic Hide",
    "prereq": [
      {
        "race": ["giff"]
      }
    ],
    "type": "racial",
    "description": "Your hide is resistant to magic. You have advantage on saving throws against spells and other magical effects."
  },
  {
    "name": "Fade Away",
    "prereq": [
      {
        "race": ["gnome"]
      }
    ],
    "type": "racial",
    "description": "Your people are clever, with a knack for illusion magic. You have learned a magical trick for fading away when you suffer harm. You gain the following benefits:<ul><li>Increase your Dexterity or Intelligence score by 1, to a maximum of 20.</li><li>Immediately after you take damage, you can use a reaction to magically become invisible until the end of your next turn or until you attack, deal damage, or force someone to make a saving throw. Once you use this ability, you can't do so again until you finish a short or long rest.</li></ul>",
    "choices": {
      "id": "32E49E39-D7BF-4843-BE5F-F76E5FC4A40F",
      "type": "asi",
      "amount": 1,
      "options": ["dex", "int"]
    },
    "uses": {
      "id": "A89C0A86-5E34-4396-A778-BAC8FE7896D9",
      "type": "fixed",
      "amount": 1,
      "reset": 1
    }
  },
  {
    "name": "Like a Boss",
    "prereq": [
      {
        "race": ["goblin"]
      }
    ],
    "type": "racial",
    "description": "You are accustomed to using others to avoid being attacked. You gain the following benefits:<ul><li>Increase your Dexterity score by 1, to a maximum of 20.</li><li>When a creature you can see targets you with an attack and another creature is within 5 feet of you, you can use your reaction to impose disadvantage on the attack roll. Once you use this ability, you can't do so again until you finish a short or long rest.</li></ul>",
    "granted": [
      {
        "type": "asi",
        "score": "dex",
        "amount": 1
      }
    ],
    "uses": {
      "id": "A89C0A86-5E34-4396-A778-BAC8FE7896D9",
      "type": "fixed",
      "amount": 1,
      "reset": 1
    }
  },
  {
    "name": "Poisonous Skin",
    "prereq": [
      {
        "race": ["bullywug", "grung"]
      }
    ],
    "type": "racial",
    "description": "Once per turn if you hit a creature with an unarmed strike, they must make a Constitution saving throw (DC = 8 + your Constitution modifier + your proficiency bonus). On a failed saving throw, the target takes 2d4 poison damage.</p><p>You can use this feature a number of times equal to your proficiency bonus, and regain all expended uses when you finish a long rest.",
    "uses": [
      {
        "id": "514D67CC-FBAB-4FC1-8A87-53C3C8A9D162",
        "type": "derived",
        "source": "proficiency",
        "reset": 2
      }
    ]
  },
  {
    "name": "Everybody's Friend",
    "prereq": [
      {
        "race": ["half-elf"]
      }
    ],
    "type": "racial",
    "description": "You develop your magnetic personality to ease your way through the world. You gain the following benefits:<ul><li>Increase your Charisma score by 1, up to a maximum of 20.</li><li>You gain proficiency in Deception and Persuasion skills. If you're already proficient in either skill, your proficiency bonus is doubled for any check you make with that skill.</li></ul>",
    "granted": [
      {
        "type": "asi",
        "score": "cha",
        "amount": 1
      },
      {
        "type": "skill",
        "options": ["Deception", "Persuasion"],
        "level": 1.5
      }
    ]
  },
  {
    "name": "Orcish Aggression",
    "prereq": [
      {
        "race": ["half-orc"]
      }
    ],
    "type": "racial",
    "description": "As a bonus action, you can move up to your speed toward an enemy of your choice that you can see or hear. You must end this move closer to the enemy than you started."
  },
  {
    "name": "Touch of Yeenoghu",
    "prereq": [
      {
        "race": ["gnoll"]
      }
    ],
    "type": "racial",
    "description": "You have been touched by the magic of Yeenoghu, master of all gnolls.  Once per turn when you hit with a melee attack, you can force the target to make a Wisdom saving throw (DC = 8 + your Constitution modifier + your proficiency bonus).  On a failed saving throw, the target suffers one of the following additional effects of your choice:<ul><li>The attack deals extra psychic damage equal to your level.</li><li>The target is paralyzed until the start of your next turn.</li><li>The target is under the effects of the Confusion spell until the start of your next turn.</li></ul>You can use this feature a number of times equal to your proficiency bonus, and regain all expended uses when you finish a long rest.",
    "uses": [
      {
        "id": "D6114854-35B1-4836-8BA8-3040616CC95C",
        "type": "derived",
        "source": "proficiency",
        "reset": 2
      }
    ]
  },
  {
    "name": "Orcish Fury",
    "prereq": [
      {
        "race": ["half-orc"]
      }
    ],
    "type": "racial",
    "description": "Your fury burns tirelessly. You gain the following benefits:<ul><li>Increase your Strength or Constitution score by 1, up to a maximum of 20.</li><li>When you hit with a weapon attack, you can roll one of the weapon's damage dice an additional time and add it as extra damage of the weapon's damage type. Once you use this ability, you can't use it again until you finish a short or long rest.</li><li>Immediately after you use your Relentless Endurance trait, you can use your reaction to make one weapon attack.</li></ul>",
    "choices": {
      "id": "4FEDB0F6-D3F9-4806-8274-E8501593CFF3",
      "type": "asi",
      "amount": 1,
      "options": ["str", "con"]
    },
    "uses": {
      "id": "35423557-43CC-44EB-8C60-C2FA394040FA",
      "type": "fixed",
      "amount": 1,
      "reset": 1
    }
  },
  {
    "name": "Bountiful Luck",
    "prereq": [
      {
        "race": ["halfling"]
      }
    ],
    "type": "racial",
    "description": "Your people have extraordinary luck, which you have learned to mystically lend to your companions whenever you see them falter. You're not sure how you do it, you just wish it, and it happens. Surely a sign of fortune's favor!<ul><li>When an ally you can see within 30 feet of you rolls a 1 on the d20 for an attack roll, an ability check, or a saving throw, you can use your reaction to let the ally reroll the die. The ally must use the new roll.</li><li>When you use this ability, you can't use your Lucky racial trait before the end of your next turn</li></ul>"
  },
  {
    "name": "Fey Luck",
    "prereq": [
      {
        "race": [
          "azapian",
          "bugbear",
          "daolagiath",
          "fairy",
          "firbolg",
          "harengon",
          "hexblood",
          "rhinox",
          "satyr"
        ]
      }
    ],
    "type": "racial",
    "description": "You are blessed with the luck of fey creatures. When you roll a 1 on an attack roll, ability check, or saving throw, you can reroll the die. You must use the new result, even if it is a 1."
  },
  {
    "name": "Uphold the Legion",
    "prereq": [
      {
        "race": ["hobgoblin"]
      }
    ],
    "type": "racial",
    "description": "You were born for life in the legion. You gain the following benefits:<ul><li>Increase your Constitution or Intelligence score by 1, to a maximum of 20.</li><li>You learn two Tactical Exploits of your choice from among those available to the warlord class. If an exploit you use requires your target to make a saving throw to resist the exploit's effects, the saving throw DC equals 8 + your proficiency bonus + your Intelligence, Wisdom, or Charisma modifier (your choice).</li><li>You gain one exploit die, which is a d6 (this die is added to any exploit dice you have from another source). This die is used to fuel your exploits. A exploit die is expended when you use it. You regain your expended exploit dice when you finish a short or long rest.</li></ul>",
    "choices": [
      {
        "id": "DA5867C7-9FBE-499F-9E3B-453D7A83929F",
        "type": "asi",
        "options": ["int", "wis", "cha"],
        "amount": 1
      },
      {
        "id": "9AF64F04-F6C6-403E-9DEE-898606BF5F45",
        "type": "exploit",
        "list": "Warlord",
        "ability": "30AAB77B-C9D0-4B2F-BCB3-F18A2F73E6E1"
      },
      {
        "id": "5992CDFA-1403-479D-9375-63F3CA10159B",
        "type": "exploit",
        "list": "Warlord",
        "ability": "A958F7CA-CC40-4B53-AABA-7D1F26CC8576"
      }
    ],
    "granted": [
      {
        "type": "exploit-die",
        "amount": 1,
        "size": 6
      }
    ]
  },
  {
    "name": "Prodigy",
    "prereq": [
      {
        "race": ["human", "half-elf", "half-dwarf", "half-orc"]
      }
    ],
    "type": "racial",
    "description": "You are filled with a determination that can draw the unreachable within your reach. You gain the following benefits:<ul><li>Increase one ability score of your choice by 1, to a maximum of 20.</li><li>You gain one skill proficiency of your choice, one tool proficiency of your choice, and fluency in one language of your choice.</li><li>Choose one skill in which you have proficiency. You gain expertise with that skill, which means your proficiency bonus is doubled for any ability check you make with it. The skill you choose must be one that isn't already benefiting from a feature, such as Expertise, that doubles your proficiency bonus.</li></ul>",
    "choices": [
      {
        "id": "4947E128-34C7-4DB1-B207-79083ADBEDB1",
        "type": "asi",
        "amount": 1,
        "options": ["str", "dex", "con", "int", "wis", "cha"]
      },
      {
        "id": "D1C0A054-85D3-4D38-90EB-BB3006669A54",
        "type": "skill",
        "level": 1
      },
      {
        "id": "8A984D28-5FB7-4E22-B5E6-B0F4A05DAF59",
        "type": "tool",
        "level": 1
      },
      {
        "id": "A404FE0A-C026-43B3-BCE1-875E7BDE27F9",
        "type": "language",
        "level": 1
      },
      {
        "id": "88336792-847D-48F6-AC85-659A5A6AF808",
        "type": "skill",
        "level": 1.5
      }
    ]
  },
  {
    "name": "Kalashtar Psionics",
    "prereq": [
      {
        "race": ["kalashtar"]
      }
    ],
    "type": "racial",
    "description": "You know the Mage Hand cantrip, and the hand is invisible when you cast the cantrip with this trait. When you reach 3rd level, you can cast the Silvery Barbs spell once with this trait, and you regain the ability to do so when you finish a long rest. When you reach 5th level, you can cast the Mind Spike spell once with this trait, and you regain the ability to do so when you finish a long rest. Wisdom is your spellcasting ability for these spells. When you cast them with this trait, they don't require components.",
    "granted": [
      {
        "type": "spell",
        "options": ["Mage Hand"],
        "ability": "wis"
      },
      {
        "type": "spell",
        "options": ["Silvery Barbs"],
        "prereq": 3,
        "ability": "wis"
      },
      {
        "type": "spell",
        "options": ["Mind Spike"],
        "prereq": 5,
        "ability": "wis"
      }
    ],
    "uses": [
      {
        "id": "6FE3DE9F-CE41-4159-BC1B-A55216AC3373",
        "type": "fixed",
        "amount": 1,
        "prereq": 3,
        "reset": 2
      },
      {
        "id": "F9646F0F-1DC0-4F92-8785-2EC116BEEC74",
        "type": "fixed",
        "amount": 1,
        "prereq": 5,
        "reset": 2
      }
    ]
  },
  {
    "name": "Master of Mimicry",
    "prereq": [
      {
        "race": ["kenku"]
      }
    ],
    "type": "racial",
    "description": "You have learned to temporarily mimic even the training of others. You gain the following benefits:<ul><li>Increase your Dexterity, Intelligence, or Wisdom score by 1, to a maximum of 20.</li><li>Whenever another creature you can see uses a skill or tool, you can use your reaction to gain proficiency in that skill or tool. Proficiencies gained in this way last for 1 hour, and you can only mimic one proficiency at a time. Once you use this ability, you can't do so again until you finish a short or long rest.</li></ul>",
    "choices": [
      {
        "id": "4947E128-34C7-4DB1-B207-79083ADBEDB1",
        "type": "asi",
        "amount": 1,
        "options": ["dex", "int", "wis"]
      },
      {
        "id": "D1C0A054-85D3-4D38-90EB-BB3006669A54",
        "type": ["skill", "tool"],
        "level": 1
      }
    ],
    "uses": {
      "id": "3CE04AE0-F9AF-40E8-9B17-C14DEC3B630C",
      "type": "fixed",
      "amount": 1,
      "reset": 1
    }
  },
  {
    "name": "Touch of Sess'inek",
    "prereq": [
      {
        "race": ["lizardfolk"]
      }
    ],
    "type": "racial",
    "description": "You manifest the demonic bearing of a lizard king or queen. You gain the following benefits:<ul><li>Increase your Constitution or Wisdom score by 1, to a maximum of 20.</li><li>You learn to speak, read, and write Abyssal.</li><li>You are immune to being frightened.</li></ul>",
    "choices": [
      {
        "id": "B28597BC-2A02-4E9A-8093-4C22E54EEF9A",
        "type": "asi",
        "amount": 1,
        "options": ["con", "wis"]
      }
    ],
    "granted": [
      {
        "type": "language",
        "options": ["Abyssal"]
      },
      {
        "type": "condition-immunity",
        "options": ["Frightened"]
      }
    ]
  },
  {
    "name": "Touch of Nyx",
    "prereq": [
      {
        "race": ["harpy"]
      }
    ],
    "type": "racial",
    "description": "You have been blessed by the goddess of harpies, the primordial god of night Nyx, to wield some of her dark magic. You know the Gloom cantrip. When you reach 3rd level, you can cast the Bane spell once with this trait, and you regain the ability to do so when you finish a long rest. When you reach 5th level, you can cast the Darkness spell once with this trait, and you regain the ability to do so when you finish a long rest. Wisdom is your spellcasting ability for these spells. When you cast them with this trait, they don't require components.",
    "granted": [
      {
        "type": "spell",
        "options": ["Gloom"],
        "ability": "wis"
      },
      {
        "type": "spell",
        "options": ["Bane"],
        "prereq": 3,
        "ability": "wis"
      },
      {
        "type": "spell",
        "options": ["Darkness"],
        "prereq": 5,
        "ability": "wis"
      }
    ],
    "uses": [
      {
        "id": "EE927060-6C86-487B-BB2B-8B6D2122FD56",
        "type": "fixed",
        "amount": 1,
        "prereq": 3,
        "reset": 2
      },
      {
        "id": "F15468D9-A5A3-4AE1-BA44-63112F761078",
        "type": "fixed",
        "amount": 1,
        "prereq": 5,
        "reset": 2
      }
    ]
  },
  {
    "name": "Orcish Strength",
    "prereq": [
      {
        "race": ["orc"]
      }
    ],
    "type": "racial",
    "description": "You are big, even for an orc. You gain the following benefits:<ul><li>Increase your Strength score by 1, to a maximum of 20.</li><li>Your carrying capacity and the weight you can push, drag, and lift double.</li><li>You have advantage on checks made to push, pull, lift, or break objects.</li><li>You gain proficiency in the Athletics skill if you don't already have it, and your proficiency bonus is doubled for checks made with it.</li></ul>",
    "granted": [
      {
        "type": "asi",
        "score": "str",
        "amount": 1
      },
      {
        "type": "skill",
        "options": ["Athletics"],
        "level": 2
      }
    ]
  },
  {
    "name": "Tanarukk Blood",
    "prereq": [
      {
        "race": ["orc"]
      }
    ],
    "type": "racial",
    "description": "Through fell magic or an ancestor, you are touched by the corruptive power of Baphomet. You gain the following benefits:<ul><li>Increase your Strength or Constitution score by 1, to a maximum of 20.</li><li>You have resistance to fire and poison damage.</li><li>You gain a bite attack as a natural weapon, which you can use to make unarmed strikes. If you hit with it, you deal piercing damage equal to 1d8 + your Strength modifier, instead of the bludgeoning damage normal for an unarmed strike.</li></ul>",
    "choices": {
      "id": "261AA845-AB2A-4FB7-AD99-446CCED36E2E",
      "type": "asi",
      "amount": 1,
      "options": ["str", "con"]
    },
    "granted": [
      {
        "type": "damage-resistance",
        "options": ["Fire", "Poison"]
      }
    ]
  },
  {
    "name": "Tortle Defender",
    "prereq": [
      {
        "race": ["tortle"]
      }
    ],
    "type": "racial",
    "description": "You have mastered using your shell to better protect yourself and others. You gain the following benefits:<ul><li>Increase your Strength or Wisdom score by 1, to a maximum of 20.</li><li>Your natural armor trait now provides a base AC of 18. As normal, your Dexterity modifier doesn't affect this number.</li><li>As a reaction when you are forced to make a Dexterity saving throw, choose any number of creatures within 5 feet of you. Each chosen creature is considered to have half cover against any harmful attacks or effects while within 5 feet of you until the start of your next turn. Once you use this ability, you can't do so again until you've finished a short or long rest.</li></ul>",
    "choices": {
      "id": "B0A17589-27A8-4361-8220-F99EF5FDF25B",
      "type": "asi",
      "amount": 1,
      "options": ["str", "wis"]
    },
    "granted": [
      {
        "type": "unarmored",
        "base": 18
      }
    ],
    "uses": {
      "id": "9C426133-0DAB-421A-AF9A-4ACBBCE4D26A",
      "type": "fixed",
      "amount": 1,
      "reset": 1
    }
  },
  {
    "name": "Serpent Form",
    "prereq": [
      {
        "race": ["yuan-ti"]
      }
    ],
    "type": "racial",
    "description": "You have unlocked more of your serpentfolk heritage. You gain the following benefits:<ul><li>Increase your Intelligence or Charisma score by 1, to a maximum of 20.</li><li>You can use an action to polymorph into a poisonous snake, constrictor snake, or giant poisonous snake, or back into your true form. Your statistics are the same in each form. Any equipment you are wearing or carrying isn't transformed. If you die, you stay in your current form.</li></ul>",
    "choices": {
      "id": "CD69B182-F545-4D31-B23B-55A1E8566AA6",
      "amount": 1,
      "type": "asi",
      "options": ["int", "cha"]
    }
  },
  {
    "name": "Kor Weapon Training",
    "prereq": [
      {
        "race": ["kor"]
      }
    ],
    "type": "racial",
    "description": "You have trained extensively with chain and rope weapons. You gain the following benefits:<ul><li>You gain proficiency with the flying sword, kusarigama, or meteor hammer.</li><li>While wielding one of the above weapons, you gain a +1 bonus to your Armor Class.</li><li>While wielding one of the above weapons, you can grapple a creature up to 10 feet away from you using the weapon. You can only have one creature grappled in this manner at a time.</li></ul>",
    "choices": {
      "id": "96475C71-D543-48C0-93CF-AEF96A50DBA5",
      "type": "exotic-weapon",
      "limits": ["Flying Sword", "Kusarigama", "Meteor Hammer"]
    }
  },
  {
    "name": "Improved Glide",
    "prereq": [
      {
        "race": ["hadozee"]
      }
    ],
    "type": "racial",
    "description": "Your gliding membranes have improved, and you have learned to better use them to your advantage in combat. You gain the following benefits:<ul><li>Increase your Dexterity score by 1, to a maximum of 20.</li><li>You can move up to 10 feet horizontally for each foot descended while gliding.</li><li>If you fall 10 feet or more and hit a creature with a melee attack, you can also knock them prone.</li></ul>",
    "granted": [
      {
        "type": "asi",
        "score": "dex",
        "amount": 1
      }
    ]
  },
  {
    "name": "Breath Versatility",
    "prereq": [
      {
        "race": ["demi-dragon"]
      }
    ],
    "type": "racial",
    "description": "You can alter your breath. You gain the following benefits:<ul><li>Increase your Constitution or Charisma score by 1, to a maximum of 20.</li><li>When you use your breath weapon, you can freely choose between using a line breath or a cone breath. If you choose a line, you can increase the width of your breath from 5 feet to 10 feet.</li></ul>",
    "choices": {
      "id": "DF1DD6C9-9A8B-4486-9F58-E05543814082",
      "type": "asi",
      "options": ["con", "cha"],
      "amount": 1
    }
  },
  {
    "name": "Misfit's Adaptation",
    "prereq": [
      {
        "race": ["demi-dragon"]
      }
    ],
    "repeatable": true,
    "type": "racial",
    "description": "Your body continues to change in unexpected ways. You gain the following benefits:<ul><li>Increase your Strength, Constitution, or Charisma score by 1, to a maximum of 20.</li><li>Choose one individual feature from a morph category available to the Embodiment of the Metamorph. You gain the chosen effect, which is permanent. If you already had access to morphs and have learned the associated morph category, you can choose whether to change this or your other Waning morph whenever you change morphs.</li></ul>You can take this feat multiple times. Each time you do, choose a different morph.",
    "choices": [
      {
        "id": "9CA4E7B4-D7B4-439B-9EF1-58968B29BAEF",
        "type": "asi",
        "options": ["str", "con", "cha"]
      },
      {
        "id": "181C08F1-8011-4535-AAA5-BBAE75CB5F0A",
        "type": "trait",
        "options": [
          {
            "name": "Gold Luck",
            "description": "You harness the mystic fortuity of the gold dragon. Whenever you or an ally makes an attack roll, an ability check, or a saving throw, you can choose to roll an additional d20. You can take this action after you roll the die, but before the outcome is determined. You choose which of the d20s is used for the attack roll, ability check, or saving throw. You can use this feature once, and regain the ability to do so after finishing a short or long rest.",
            "uses": {
              "id": "B4DBFCB2-A51C-42A5-A98D-6D8EAC67A463",
              "type": "fixed",
              "amount": 1,
              "reset": 1
            }
          },
          {
            "name": "Sheltering Wings",
            "description": "Flexible armor plating grows across your wings, allowing you to use them as shelter for your allies. When a creature you can see attacks a target other than you that is within 5 feet of you, you can use your reaction to impose disadvantage on the attack roll."
          },
          {
            "name": "Warrior's Will",
            "description": "You adorn your form with a symbol of bravery and prepare yourself to face opposition. You gain advantage on Wisdom saving throws.",
            "granted": [{ "type": "save-advantage", "options": ["wis"] }]
          },
          {
            "name": "Ivory Charge",
            "description": "Your horns split into a branching crown of antlers, capable of punching holes through hide and armor alike. You gain an antler natural weapon, which counts as a martial melee weapon for you. You can use it to make melee weapon attacks, with which you are proficient. Your antlers deal piercing damage equal to 3d4 + your Strength modifier. If you move at least 10 feet in a straight line during your turn, you gain advantage on the first attack you make with your antlers."
          },
          {
            "name": "Stone Scales",
            "description": "You assimilate available minerals in order to create a thick layer of defensive stone scales. Your Armor Class becomes equal to 16 + your Constitution modifier. You are considered as wearing heavy armor, but don't suffer penalties to your Dexterity (Stealth) or as a result of lacking heavy armor proficiency. You lose access to the Flight feature, as well as the speed benefit of Stride.",
            "granted": [{ "type": "unarmored", "base": 16, "scores": ["con"] }]
          },
          {
            "name": "Capable Form",
            "description": "Your body grows better suited to grasping and manipulating objects. You can ignore the disadvantage imposed on attack on attack rolls by Mythic Build. Additionally, you gain proficiency with simple and martial weapons as well as with two tools of your choice.",
            "choices": [
              { "id": "82C4D610-BB76-4D11-9880-87D553ED1922", "type": "tool" },
              { "id": "F60A3BE6-20BC-45D6-9047-97D01AD1D652", "type": "tool" }
            ],
            "granted": [{ "type": "weapon", "options": ["Simple", "Martial"] }]
          },
          {
            "name": "Esoteric Ward",
            "description": "Runic glyphs carved across your body guard you against a variety of magics. You gain advantage on all Intelligence, Charisma, and Strength saving throws against magical effects."
          },
          {
            "name": "Veiled Wings",
            "description": "Your wings expand, elegantly veiling you from your foes. Your Glide & Fly speed increases by 10 ft, and you can take the Disengage action as a bonus action."
          },
          {
            "name": "Reverberating Roar",
            "description": "Your voice grows deeper, seeming to come from a much larger creature. As a bonus action, you can roar, inciting fear and hesitation in your enemies. Each creature of your choice within 20 feet of you are forced to make a Wisdom saving throw against your Dragon Spark save DC. A target automatically succeeds on the save if it can't hear or see you. On a failed save, a target can't take reactions until the start of your next turn. A creature that succeeds on this saving throw is immune to your roar until the end of your next turn."
          },
          {
            "name": "Tunnel Wyrm",
            "description": "You gain a burrowing speed equal to half your walking speed. You can tunnel through loose dirt, gravel, and similar materials, but not through solid materials. If you burrow at half speed, you can reinforce your tunnel as you move, allowing others to pass through-otherwise your tunnel slowly collapses behind you. Additionally, as an action while burrowing near the surface, you can hollow out a portion of space in the terrain, which immediately collapses into a 15-feet wide and deep sinkhole. Creatures caught in the area must succeed on a Dexterity saving throw against your Dragon Spark DC or fall into the sinkhole and drop prone. On a succesful save, a creature can instead choose to move to the nearest available space without provoking opportunity attacks. If you spend 1 minute creating the sinkhole, it will instead collapse when the first creature that is Small or larger moves into its space. You can use this property twice, after which you must finish a short or long rest before you can use it again.",
            "uses": {
              "id": "74D10329-FF1B-45FC-A14E-7CE79A8F1DF8",
              "type": "fixed",
              "amount": 2,
              "reset": 1
            },
            "granted": [{ "type": "speed", "speed": "burrow", "amount": -0.5 }]
          },
          {
            "name": "Blasting Breath",
            "description": "Your elemental spark is always at the ready. You can use your action to exhale a bolt of elemental energy and spit it at a creature you can see within a range of 120. Make a ranged Dragon Spark attack. On a hit, the target takes 1d10 + your dragon spark ability score modifier damage. The damage is the same damage type as your Dragon's Breath. The number of damage dice increases by one at levels 5, 11, and 17."
          },
          {
            "name": "Wyrm Tongue",
            "description": "Your suave voice is affable and soothing. You have gain proficiency in Deception or Persuasion (your choice). You can change your choice every time you finish a short or long rest. Additionally, you learn two languages of your choice.",
            "choices": [
              {
                "id": "A2250BD4-82B8-4200-9C7D-9CB31ECCFC8F",
                "type": "language"
              },
              {
                "id": "E2F1ACE7-3E82-488A-9E21-EF6BF8EB7E8E",
                "type": "language"
              },
              {
                "id": "96E48F6D-18D9-4002-B89F-7DF02058EBA4",
                "type": "skill",
                "limits": ["Deception", "Persuasion"],
                "level": 1
              }
            ]
          },
          {
            "name": "Rending Jaws",
            "description": "Your jaw muscles grow more powerful, and your fangs grow serrated and cruel, capable of puncturing armor and rending flesh. When you hit with a bite attack, the target suffers a -1 to Armor Class for 1 minute. This effect can only be applied once per creature."
          },
          {
            "name": "White Cunning",
            "description": "You instill yourself with the primal awareness of the white dragon. You have advantage on initiative checks and you ignore non-magical difficult terrain.",
            "granted": [{ "type": "initiative-advantage" }]
          },
          {
            "name": "Driving Strikes",
            "description": "The tip of your tail develops a tough, bony club, and the force of your blows leaves your enemies reeling. When you make a tail attack on your turn, your reach for it is 5 feet greater than normal. Additionally, when you hit a target twice on the same turn with any combination of natural weapons, the target must succeed on a Strength saving throw (DC = 8 + your proficiency bonus + your Strength modifier) or be pushed 10 feet away from you."
          },
          {
            "name": "Elemental Maw",
            "description": "Volatile energy fills your gullet. Once on each of your turns when you hit with a bite attack, you deal an additional 1d6 damage of your Dragon's Breath damage type."
          },
          {
            "name": "Darting Predator",
            "description": "You adapt to better surprise your foes with short bursts of speed. You can take the Dash action as a bonus action."
          },
          {
            "name": "Drowning Terror",
            "description": "You gain a swimming speed equal to your walking speed, and you can breathe both air and water. Whenever you grapple a target that is unable to breathe freely-such as an aquatic creature on land or vice versa-at the start of each of its turns, the target of your grapple must succeed on a Wisdom save against your Dragon Spark DC or become frightened of drowning until it can again breathe freely. Additionally, when you are dragging or carrying a grappled creature with you, your speed is no longer halved.",
            "granted": [{ "type": "speed", "speed": "swim", "amount": -1 }]
          },
          {
            "name": "Skewering Quills",
            "description": "You develop clusters of sharp quills along your limbs which you can fire in an arc at your foes. You gain a quills natural weapon, which counts as a martial ranged weapon for you and which you are proficient with. You can use them to make ranged weapon attacks with a range of 60/120, and you add your Strength modifier to the attack and damage rolls when you attack with them. On a hit, they deal 1d10 piercing damage. Hit or miss, one square occupied by the targeted creature is then filled with quills, and you can additionally choose two squares within 5 feet of that square to also fill with quills as your inaccurate bombardment harmlessly scatters across the area. Any creature that subsequently enters a square filled with quills must succeed on a Dexterity saving throw against your Dragon Spark save DC or stop moving this turn and take 1 piercing damage. A creature moving through the area at half speed doesn't need to make the save. You can use this attack a number of times equal to 1 + your Constitution modifier (minimum 1), after which you must finish a short or long rest to use it again.",
            "uses": {
              "id": "9DEF8826-7002-4E6D-87AA-CB4273F3C07E",
              "type": "derived",
              "source": "score",
              "score": "con",
              "modifier": "+1",
              "reset": 1
            }
          },
          {
            "name": "Thorny Spines",
            "description": "You grow a series of sharp, slender spikes across your body. Any enemy that deals damage to you in melee suffers 1d4 piercing damage. At the start of each of your turns you deal 1d4 piercing damage to any creature grappling you or any creature grappled by you."
          },
          {
            "name": "Breath of Bolstering Essence",
            "description": "Your magical essence is a wellspring of vitality waiting to be shared. As an action, you exhale revitalizing power unto a creature of your choice within 10 feet of you, restoring a number of hit points equal to your demi-dragon level. At your option, you can expend one or more of your Hit Dice, up to half your demi-dragon level. For each Hit Die spent in this way, roll the die then add your Constitution modifier, and add the result to the total amount of hit points you restore to the target. Once you use this feature, you cannot use it again until you finish a short or long rest.",
            "uses": {
              "id": "8718E1A5-D7DE-4AC6-B9CD-71FED0F41D95",
              "type": "fixed",
              "amount": 1,
              "reset": 1
            }
          },
          {
            "name": "Enthralling Dragonsong",
            "description": "You can sing a wordless aria that pacifies your audience. As a bonus action and on each subsequent turn while your song lasts, every creature of your choice within 20 feet of you must succeed on a Wisdom saving throw against your Dragon Spark or become charmed by you until your song ends. A creature that cannot hear you or which has successfully saved against your song is immune to this use of your song. The song ends after 1 minute, if you are incapacitated, or if you do not maintain it with a bonus action each turn. Once you use this feature, you cannot use it again until you finish a short or long rest.",
            "uses": {
              "id": "CD2BCB17-0BF7-4BD9-9E60-45FBC87BD569",
              "type": "fixed",
              "amount": 1,
              "reset": 1
            }
          },
          {
            "name": "Numinous Dragonsong",
            "description": "As a bonus action, you can sing a wordless hymn that guides your allies. Your song lasts until the start of your next turn, and while it lasts you and creatures of your choice within 20 feet of you gain a bonus to death saving throws and Constitution saving throws made to maintain concentration equal to your dragon spark ability score modifier (with a minimum bonus of +1). While singing, you gain blindsight out to 10 feet. If you already have blindsight, it instead increases by 10 feet. The song ends if you are incapacitated or if you do not maintain it with a bonus action each turn."
          },
          {
            "name": "Shape Breath",
            "description": "When you breathe destructive energy, you can shape pockets of relative safety within the area of your breath. When you use your Dragon's Breath feature, you can choose a number of creatures that are within the area of the breath weapon and which you can see equal to 1 + your dragon spark ability score modifier (minimum 1). The chosen creatures need not make a saving throw, and take no damage from your Dragon's Breath."
          },
          {
            "name": "Draining Scales",
            "description": "You alter your scales to siphon magical energy. Whenever you are a target of any spell of 1st level or higher, you gain temporary hit points equal to your Constitution modifier (minimum 1) before the spell's effects are resolved."
          },
          {
            "name": "Silver Mist",
            "description": "You take on the aspect of the silver dragon, and can walk on clouds. As a reaction that you can take at any time when you or another creature that is Large or smaller within 60 feet of you falls, you can create a cloud beneath the target as a reaction. The cloud supports the creature's weight and can harmlessly break their fall as if it were a physical object. As part of creating the cloud, you can choose to have it immediately move up to 10 feet up or down, where it will then float in place for up to 1 hour, or until you create a new one."
          },
          {
            "name": "Chameleon Scales",
            "description": "Your scales gain the ability to change color, letting you blend in with your surroundings. You can take the Hide action as a bonus action on your turn. You have advantage on Stealth checks made to hide in dim light and in natural terrain, such as rocks, plants, or sand."
          },
          {
            "name": "Venemous Sting",
            "description": "Your tail develops a stinger, loaded with poison. Your tail attack deals your choice of piercing or bludgeoning damage. When you deal damage with a tail attack, you can choose to inject the target with poison. The target must succeed on a Constitution saving throw against your Dragon Spark save DC. On a failure, the target takes an additional 2d6 poison damage and is poisoned until the end of its next turn."
          },
          {
            "name": "Skittering Crawl",
            "description": "You gain a climbing speed equal to your walking speed. If you move at least 20 feet on the ground or as part of a climb, you can choose to take the Dodge action as a bonus action.",
            "granted": [{ "type": "speed", "speed": "climb", "amount": -1 }]
          },
          {
            "name": "Snatching Tail",
            "description": "Your tail becomes flexible, letting you unexpectedly catch your foes and yank them around. When you hit a creature that is up to one size category larger than you with your tail, you can choose to force them to roll a Strength saving throw (DC = 8 + your proficiency bonus + your Strength modifier). On a failure, they are pulled to a space of your choosing within 10 feet of you. The space must be on the ground and unoccupied."
          }
        ]
      }
    ]
  },
  {
    "name": "War Plating",
    "prereq": [
      {
        "race": ["demi-dragon"]
      }
    ],
    "type": "racial",
    "description": "You've trained in wearing heavy armor into combat. You gain the following benefits:<ul><li>Increase your Strength score by 1, to a maximum of 20.</li><li>You gain proficiency with heavy armor.</li><li>When you don a heavy armor, you can choose to forgo using its AC calculation. If you do, bludgeoning, piercing, and slashing damage that you take from nonmagical attacks is reduced by 3.</li><li>Wearing heavy armor no longer restricts the Flight or Stride features.</li></ul>",
    "granted": [
      {
        "type": "asi",
        "score": "str",
        "amount": 1
      },
      {
        "type": "armor",
        "options": ["Heavy"]
      }
    ]
  },
  {
    "name": "Hardy Hibernator",
    "prereq": [
      {
        "race": ["panserbjorn"]
      }
    ],
    "type": "racial",
    "description": "Like bears, you are capable of hibernating for a long time without food. You gain the following benefits:<ul><li>Increase your Constitution score by 1, to a maximum of 20.</li><li>As long as you otherwise eat at normal levels, you can go for up to three months without food.</li><li>You have a burrow speed of 10 feet. You can tunnel through loose dirt, gravel, and similar materials, but not through solid materials. If you burrow at half speed, you can reinforce your tunnel as you move, letting others safely pass throughotherwise it slowly collapses behind you.</li></ul>",
    "granted": [
      {
        "type": "speed",
        "speed": "burrow",
        "amount": 10
      }
    ]
  },
  {
    "name": "Bull's Fury",
    "prereq": [
      {
        "race": ["minotaur"]
      }
    ],
    "type": "racial",
    "description": "You have trained to use your horns as effectively as any weapon. You gain the following benefits:<ul><li>Increase your Strength or Constitution score by 1, to a maximum of 20.</li><li>Your Goring Charge can now target multiple enemies. When used in this way, you can target a number of creatures up to your proficiency bonus, and you can move through their spaces without triggering any opportunity attacks.</li><li>If you drop below half your maximum hit points, you regain a use of your Goring Charge feature. You can only recover a use in this way once per long rest.</li></ul>",
    "choices": {
      "id": "B1746FEA-D9BA-4F02-B328-A1AAB5D66EB0",
      "type": "asi",
      "amount": 1,
      "options": ["str", "con"]
    },
    "uses": {
      "id": "4BE47AE6-1D04-46E0-99BC-24C777362E58",
      "type": "fixed",
      "amount": 1,
      "reset": 2
    }
  },
  {
    "name": "Bull's Constitution",
    "prereq": [
      {
        "race": ["minotaur"]
      }
    ],
    "type": "racial",
    "description": "You embody your species's legendary resilience.  You gain the following benefits:<ul><li>Increase your Constitution score by 1, to a maximum of 20.</li><li>As a reaction, you can reduce any instance of damage you receive by a number equal to your proficiency modifier.</li><li>When you would fail a Strength or Constitution saving throw, you may reroll it and use the new roll. You can use this feature once, regaining its use after a short or long rest.</li></ul>",
    "granted": [
      {
        "type": "asi",
        "score": "con",
        "amount": 1
      }
    ],
    "uses": {
      "id": "D7DE93C5-7318-498C-B8EA-74D317C0B120",
      "type": "fixed",
      "amount": 1,
      "reset": 1
    }
  },
  {
    "name": "Blood Frenzy",
    "prereq": [
      {
        "race": ["praedaren"]
      }
    ],
    "type": "racial",
    "description": "You gain the frenzied blood sense of sharks, gaining the following benefits:<ul><li>Increase your Strength, Dexterity, or Wisdom score by 1.</li><li>You have advantage on attack rolls against creatures below half of their maximum hit points if the target is within 100 feet of you.</li></ul>",
    "choices": {
      "id": "B896ECDE-9953-479D-A9BB-735F5F0427B6",
      "type": "asi",
      "amount": 1,
      "options": ["str", "dex", "wis"]
    }
  },
  {
    "name": "Crab's Resilience",
    "prereq": [
      {
        "race": ["testasian"]
      }
    ],
    "type": "racial",
    "description": "Your body possesses the innate resilience of crabs and lobsters.  You gain the following benefits:<ul><li>Increase your Constitution by 1.</li><li>If you lose a body part, you can re-grow it over the course of 1d4 long rests.</li><li>When you roll a Hit Die to regain hit points, the minimum number of hit points you regain from the roll equals twice your Constitution modifier (minimum of 2).</li></ul>",
    "granted": [
      {
        "type": "asi",
        "score": "con",
        "amount": 1
      }
    ]
  },
  {
    "name": "Mechanical Resolve",
    "prereq": [
      {
        "race": ["autognome", "cyborg", "synthsteel", "warforged"]
      }
    ],
    "type": "racial",
    "description": "You gain 3 points of Resolve. You can expend resolve to power the following features:<ul><li>When you make a death saving throw and fail, you may spend a point of Resolve to ignore it.</li><li>When you would make a Wisdom saving throw but before you do so, you may spend a point of Resolve and make a Constitution saving throw instead.</li><li>When you make a Constitution saving throw but before being told the outcome of your roll, you may spend a point of Resolve and roll one more time. You must take the new roll.</li></ul>You regain all expended Resolve points when you finish a long rest.",
    "uses": {
      "id": "0FFF7D7B-C054-4F6D-9607-1066B658D225",
      "type": "fixed",
      "amount": 3,
      "reset": 2
    }
  },
  {
    "name": "Feline Grace",
    "prereq": [
      {
        "race": ["tabaxi"]
      }
    ],
    "type": "racial",
    "description": "Your incredible reflexes and agility further improve. You gain the following benefits:<ul><li>Increase your Dexterity score by 1, to a maximum of 20.</li><li>You can use your Feline Agility trait twice before you must move 0 feet on one of your turns to use the trait again. You can still only use this ability once per turn when you move.</li><li>You don't take damage from falling 20 feet or less if you aren't incapacitated.</li></ul>",
    "granted": [
      {
        "type": "asi",
        "score": "dex",
        "amount": 1
      }
    ]
  },
  {
    "name": "Precision Claws",
    "prereq": [
      {
        "race": ["tabaxi"]
      }
    ],
    "type": "racial",
    "description": "Your claws are particularly precise. You gain the following benefits:<ul><li>Increase your Dexterity score by 1, to a maximum of 20.</li><li>You can use your claws as thieves' tools. You are proficient with using your claws in this way, and your proficiency bonus is doubled for such a check.</li></ul>",
    "granted": [
      {
        "type": "asi",
        "score": "dex",
        "amount": 1
      },
      {
        "type": "tool",
        "options": ["Thieves' Tools"],
        "level": 2
      }
    ]
  },
  {
    "name": "Prehensile Trunk",
    "prereq": [
      {
        "race": ["loxodon"]
      }
    ],
    "type": "racial",
    "description": "Your trunk has grown more dexterous and proficient.  You gain the following benefits:<ul><li>Increase your Dexterity score by 1, to a maximum of 20.</li><li>Your trunk can fully act as a third arm.  The trunk can manipulate an object, open or close a door or container, pick up or set down a Tiny object, or wield a weapon that has the light property. </li></ul>",
    "granted": [
      {
        "type": "asi",
        "score": "dex",
        "amount": 1
      }
    ]
  },
  {
    "name": "Full Gallop",
    "prereq": [
      {
        "race": ["taurian"]
      }
    ],
    "type": "racial",
    "description": "Excelling at high speed, you can rapidly move across the land.  You gain the following benefits:<ul><li>Your walking speed increases by 10 feet.</li><li>You can take the Dash action as a bonus action.</li><li>When you are alone, your travel pace is increased by 1 mile per day.</li></ul>"
  },
  {
    "name": "Wings of the Night",
    "prereq": [
      {
        "race": ["tiefling"]
      }
    ],
    "type": "racial",
    "description": "One of your ancestors was a horned devil, vrock, or similar winged fiend.  You manifest the wings of a creature of the night, such as a bat or skeletal dragon, which grant you a flying speed equal to your walking speed while you are not wearing medium or heavy armor.",
    "granted": [
      {
        "type": "speed",
        "speed": "fly",
        "amount": -1
      }
    ]
  },
  {
    "name": "Dragon Wings",
    "prereq": [
      {
        "race": ["dragonborn"]
      }
    ],
    "type": "racial",
    "description": "You sprout large wings resembling those of a dragon, which grant you a flying speed equal to your walking speed while you are not wearing medium or heavy armor.",
    "granted": [
      {
        "type": "speed",
        "speed": "fly",
        "amount": -1
      }
    ]
  },
  {
    "name": "Barbed Hide",
    "prereq": [
      {
        "race": ["tiefling"]
      }
    ],
    "type": "racial",
    "description": "One of your ancestors was a barbed devil or other spiky fiend. Barbs protrude from your head. You gain the following benefits:<ul><li>Increase your Constitution or Charisma score by 1, up to a maximum of 20.</li><li>You gain proficiency in the Intimidation skill. If you're already proficient in it, your proficiency bonus is doubled for any check you make with it.</li><li>As a bonus action, you can cause small barbs to protrude all over your body or cause them to retract. At the start of each of your turns while the barbs are out, you deal 1d6 piercing damage to any creature grappling you or any creature grappled by you.</li></ul>",
    "choices": {
      "id": "E5175B2F-096B-4FD6-BEA0-B47464F90E31",
      "type": "asi",
      "options": ["con", "cha"],
      "amount": 1
    },
    "granted": [
      {
        "type": "skill",
        "options": ["Intimidation"],
        "level": 1.5
      }
    ]
  },
  {
    "name": "Chains of Hell",
    "prereq": [
      {
        "race": ["tiefling"]
      }
    ],
    "type": "racial",
    "description": "One of your ancestors was a chain devil.  When you hit with an attack, spectral chains manifest, performing one of the following additional effects:<ul><li>The target is pulled 10 feet towards you.</li><li>The target's movement speed is reduced by 10 feet.</li><li>The target cannot take reactions until the start of your next turn.</li></ul>You can use this feature a number of times equal to your proficiency bonus, and regain all expended uses when you finish a long rest.",
    "uses": {
      "id": "B3BD14B2-139D-42CE-B312-8930D2EC3236",
      "type": "derived",
      "source": "proficiency",
      "reset": 2
    }
  },
  {
    "name": "Fearless",
    "prereq": [
      {
        "race": ["kender"]
      }
    ],
    "type": "racial",
    "description": "Though all kender are brave, you have a reptuation for being particularly fearless, gaining the following benefits:<ul><li>Increase your Constitution or Wisdom score by 1, to a maximum of 20.</li><li>You are immune to the frightened condition.</li></ul>",
    "choices": {
      "id": "61A0EC98-0227-414A-8DDE-0297FACF7A4D",
      "type": "asi",
      "options": ["con", "wis"],
      "amount": 1
    },
    "granted": [
      {
        "type": "condition-immunity",
        "options": ["Frightened"]
      }
    ]
  },
  {
    "name": "Call to the Woods",
    "prereq": [
      {
        "race": ["leshy"]
      }
    ],
    "type": "racial",
    "description": "You have gained the ability to share a little bit of the innate magic that animates you, at least for a time.  As an action, you can touch a tree or shrub within 5 feet of you and awaken it, transforming it into an awakened tree or awakened shrub.</p><p>The awakened plant is friendly towards you, though it is under no obligation to obey your commands.  It remains awakened for 1 hour, at which point it reverts to a normal plant.</p><p>You can awaken a plant once, and regain the ability to do so when you finish a long rest.",
    "uses": {
      "id": "9A57BD34-6841-4FF1-8018-0AEAD55CDB23",
      "type": "fixed",
      "amount": 1,
      "reset": 2
    }
  },
  {
    "name": "Gearhead",
    "type": "skill",
    "description": "You gain a greater understanding of technology, gaining the following benefits:\n<ul>\n<li>Increase your Intelligence score by 1, to a maximum of 20.</li>\n<li>You gain proficiency in the Technology skill. If you are already proficient in the skill, you add double your proficiency bonus to checks you make with it.</li>\n<li>You learn the Identify spell. You can cast Identify once without expending a spell slot or material components, and you regain the ability to do so when you finish a long rest.</li>\n</ul>\n",
    "granted": [
      {
        "type": "asi",
        "score": "int",
        "amount": 1
      },
      {
        "type": "skill",
        "options": ["Technology"],
        "level": 1.5
      },
      {
        "type": "spell",
        "options": ["Identify"],
        "ignoreMaxLevel": true,
        "ability": "int"
      }
    ],
    "uses": {
      "id": "3A49CF8E-8B48-4E02-BD1A-698BBDB1C7C2",
      "type": "fixed",
      "amount": 1,
      "reset": 2
    }
  },
  {
    "name": "Socialite",
    "type": "skill",
    "description": "You have a knack for fitting in and understanding culture, gaining the following benefits:\n<ul>\n<li>Increase your Intelligence score by 1, to a maximum of 20.</li>\n<li>You gain proficiency in the Society skill. If you are already proficient in the skill, you add double your proficiency bonus to checks you make with it.</li>\n<li>If you have spent at least 1 hour interacting with people of a certain culture, you can pass yourself off as a member of that culture.</li>\n</ul>\n",
    "granted": [
      {
        "type": "asi",
        "score": "int",
        "amount": 1
      },
      {
        "type": "skill",
        "options": ["Society"],
        "level": 1.5
      }
    ]
  },
  {
    "name": "Enduring",
    "type": "skill",
    "description": "You are remarkably resilient, able to withstand a great deal of hardship, gaining the following benefits:\n<ul>\n<li>Increase your Constitution score by 1, to a maximum of 20.</li>\n<li>You gain proficiency in the Endurance skill. If you are already proficient in the skill, you add double your proficiency bonus to checks you make with it.</li>\n<li>You can hold your breath for up to 15 minutes.</li><li>You can go up to 2 weeks without food before you suffer any ill effects.</li><li><li>You can go up to 5 days without water before you suffer any ill effects.</li><li>You can choose to remain awake during a long rest without suffering a level of exhaustion.  Once you do so, you must finish a long rest without reminaing awake before you can do so again.</li></li>\n</ul>\n",
    "granted": [
      {
        "type": "asi",
        "score": "con",
        "amount": 1
      },
      {
        "type": "skill",
        "options": ["Endurance"],
        "level": 1.5
      }
    ],
    "uses": {
      "id": "BBF6EE23-86A5-4E7C-95D3-3FC342C694A7",
      "type": "fixed",
      "amount": 1,
      "reset": 2
    }
  },
  {
    "name": "Might of the Meager",
    "prereq": [
      {
        "race": [
          "autognome",
          "bio-tinker",
          "cyborg",
          "dhampir",
          "dullahan",
          "ghost",
          "ghoul",
          "gnome",
          "goblin",
          "grung",
          "halfling",
          "hexblood",
          "illithid",
          "kender",
          "kobold",
          "lanternfolk",
          "leshy",
          "mousefolk",
          "mummy",
          "reborn",
          "skeleton",
          "tiefling",
          "verdan",
          "wight",
          "zombie"
        ]
      }
    ],
    "type": "racial",
    "description": "You may be small, but you are fierce.  You gain the following benefits:<ul><li>Increase your Strength score by 1, to a maximum of 20.</li><li>You are considered one size larger for determining your carrying capacity and the weight you can push, drag, and lift.</li><li>You can wield Heavy and Massive weapons as though you were a Medium creature.</li><li>You can grapple and drag creatures as though you were a Medium creature.</li></ul>",
    "granted": [
      {
        "type": "asi",
        "score": "str",
        "amount": 1
      }
    ]
  },
  {
    "name": "Squat Nimbleness",
    "prereq": [
      {
        "race": [
          "autognome",
          "bio-tinker",
          "cyborg",
          "dhampir",
          "dullahan",
          "ghost",
          "ghoul",
          "gnome",
          "goblin",
          "grung",
          "halfling",
          "hexblood",
          "illithid",
          "kender",
          "kobold",
          "lanternfolk",
          "leshy",
          "mousefolk",
          "mummy",
          "reborn",
          "skeleton",
          "tiefling",
          "verdan",
          "wight",
          "zombie"
        ]
      }
    ],
    "type": "racial",
    "description": "You are uncommonly nimble for your race. You gain the following benefits:<ul><li>Increase your Strength or Dexterity score by 1, to a maximum of 20.</li><li>Increase your walking speed by 5 feet.</li><li>You gain proficiency in Acrobatics or Athletics.</li><li>You have advantage on any Strength (Athletics) or Dexterity (Acrobatics) check you make to escape from being grappled.</li></ul>",
    "choices": [
      {
        "id": "49C34350-3A2E-407E-80DD-5DD4DC4EE575",
        "type": "asi",
        "options": ["str", "dex"],
        "amount": 1
      },
      {
        "id": "9839E24A-D423-4AD7-A830-AE4D8CA3B42E",
        "type": "skill",
        "limits": ["Acrobatics", "Athletics"],
        "level": 1
      }
    ],
    "granted": [
      {
        "type": "speed-bonus",
        "amount": 5
      }
    ]
  },
  {
    "name": "Fell Body",
    "prereq": [
      {
        "race": ["nocturne"]
      }
    ],
    "type": "racial",
    "description": "You've learned to merge with the shadows around you. You gain the following benefits:<ul><li>Your Dexterity score increases by 1, to a maximum of 20.</li><li>You can see in magical darkness as if it was non-magical.</li><li>You are resistant to necrotic damage.</li><li>You do not require sleep.</li></ul>",
    "granted": [
      {
        "type": "asi",
        "score": "dex",
        "amount": 1
      },
      {
        "type": "damage-resistance",
        "options": ["Necrotic"]
      }
    ]
  },
  {
    "name": "Shadow Walker",
    "prereq": [
      {
        "race": ["nocturne"]
      }
    ],
    "type": "racial",
    "description": "Fell magic runs strong in you, unlocking a resilience possess by other Shadowfell denizens while enhancing your nocturnian qualities. You gain the following benefits:<ul><li>You can use your Shade Walk trait to move a maximum additional distance equal to your base walking speed instead of half.</li><li>As an action, while within 5 feet of another creature, you can step into that creature's shadow and remain there. While in a creature's shadow you occupy the same space as the creature, are considered invisible and cannot affect your surroundings. As an action or if you take any damage leave that creature's shadow, appearing in an unoccupied space within 5 feet.</li></ul>"
  },
  {
    "name": "Brutal Brawler",
    "type": "multiclass",
    "repeatable": true,
    "description": "You fight dirty, brutal, and with whatever is necessary. You gain the following benefits.\n<ul>\n    <li>You learn two Brutal Exploits of your choice from among those available to the brawler class. If an exploit you use requires your target to make a saving throw to resist the exploit's effects, the saving throw DC equals 8 + your proficiency bonus + your Strength or Dexterity modifier (your choice).</li>\n<li>You gain one exploit die, which is a d6 (this die is added to any exploit dice you have from another source). This die is used to fuel your exploits. A exploit die is expended when you use it. You regain your expended exploit dice when you finish a short or long rest.</li>\n</ul>\nYou can take this feat multiple times, and gain additional exploit dice and exploit options each time.\n",
    "choices": [
      {
        "id": "CD5FE698-337E-4882-B12F-CF6EB94FC920",
        "type": "text",
        "options": ["str", "dex"]
      },
      {
        "id": "ED1C1488-F526-41B5-8894-7B124E039514",
        "type": "exploit",
        "list": "Brawler",
        "ability": "CD5FE698-337E-4882-B12F-CF6EB94FC920"
      },
      {
        "id": "873700B7-940A-4687-967D-2E24BB16F1E2",
        "type": "exploit",
        "list": "Brawler",
        "ability": "CD5FE698-337E-4882-B12F-CF6EB94FC920"
      }
    ],
    "granted": [
      {
        "type": "exploit-die",
        "amount": 1,
        "size": 6
      }
    ]
  },
  {
    "name": "Wild Soul",
    "type": "multiclass",
    "repeatable": true,
    "description": "You are at home in the wilderness, and you are an expert survivalists. You gain the following benefits.\n<ul>\n    <li>You learn two Wild Exploits of your choice from among those available to the nomad class. If an exploit you use requires your target to make a saving throw to resist the exploit's effects, the saving throw DC equals 8 + your proficiency bonus + your Strength or Dexterity modifier (your choice).</li>\n<li>You gain one exploit die, which is a d6 (this die is added to any exploit dice you have from another source). This die is used to fuel your exploits. A exploit die is expended when you use it. You regain your expended exploit dice when you finish a short or long rest.</li>\n</ul>\nYou can take this feat multiple times, and gain additional exploit dice and exploit options each time.\n",
    "choices": [
      {
        "id": "A83CDC90-801B-4CBE-A36D-4DEB51EEDDE7",
        "type": "text",
        "options": ["str", "dex"]
      },
      {
        "id": "B8FD32A4-3FF2-49FE-B5A9-088A66E4A297",
        "type": "exploit",
        "list": "Nomad",
        "ability": "A83CDC90-801B-4CBE-A36D-4DEB51EEDDE7"
      },
      {
        "id": "1F928FC7-E0FF-4167-878D-77C589E0FC61",
        "type": "exploit",
        "list": "Nomad",
        "ability": "A83CDC90-801B-4CBE-A36D-4DEB51EEDDE7"
      }
    ],
    "granted": [
      {
        "type": "exploit-die",
        "amount": 1,
        "size": 6
      }
    ]
  },
  {
    "name": "Deadeye Shot",
    "type": "multiclass",
    "repeatable": true,
    "description": "Your eye is sharp and your hand is quick. You gain the following benefits.\n<ul>\n    <li>You learn two Deadeye Exploits of your choice from among those available to the gunslinger class. If an exploit you use requires your target to make a saving throw to resist the exploit's effects, the saving throw DC equals 8 + your proficiency bonus + your Dexterity modifier.</li>\n<li>You gain one exploit die, which is a d6 (this die is added to any exploit dice you have from another source). This die is used to fuel your exploits. A exploit die is expended when you use it. You regain your expended exploit dice when you finish a short or long rest.</li>\n</ul>\nYou can take this feat multiple times, and gain additional exploit dice and exploit options each time.\n",
    "choices": [
      {
        "id": "006E9085-DD20-4A1C-A11C-6441232A9576",
        "type": "exploit",
        "list": "Gunslinger",
        "ability": "dex"
      },
      {
        "id": "DAF9C5C6-AFBF-400C-A20F-9C63A4EFB90A",
        "type": "exploit",
        "list": "Gunslinger",
        "ability": "dex"
      }
    ],
    "granted": [
      {
        "type": "exploit-die",
        "amount": 1,
        "size": 6
      }
    ]
  },
  {
    "name": "Rune Carver",
    "type": "multiclass",
    "description": "You've studied the magic of Jotunn runes, granting you the following benefits:<ul><li>You know the Comprehend Languages spell and can cast it at will, but only as a ritual.  Intelligence is your spellcasting ability for it.</li><li>You learn three Runes of your choice.  When you cast a spell of 1st-level or higher, you can invoke one of these runes to modify the spell's effects.  You can invoke runes a number of times equal to your proficiency bonus, and regain all expended uses when you finish a long rest.</li></ul>",
    "choices": [
      {
        "id": "DD8A8E5D-A97C-4BF0-B5B1-47CD3F4D6A5B",
        "type": "runecarver"
      },
      {
        "id": "19A9194B-215E-484A-8127-54397012260A",
        "type": "runecarver"
      },
      {
        "id": "57A7F449-2388-4A33-9A65-FCD805459906",
        "type": "runecarver"
      }
    ],
    "granted": [
      {
        "type": "spell",
        "options": ["Comprehend Languages"],
        "ritualsOnly": true,
        "ability": "int",
        "ignoreMaxLevel": true
      }
    ],
    "uses": [
      {
        "id": "42958C48-B706-45E9-8FD4-F95CE80D6A22",
        "type": "derived",
        "source": "proficiency",
        "reset": 2
      }
    ]
  },
  {
    "name": "Jotunn Magic",
    "type": "magic",
    "description": "You have learned the runic magic of the giants, gaining the following benefits:<ul><li>Increase your Strength, Constitution, Wisdom, or Charisma score by 1.</li><li>Choose a type of giant.  You gain additional benefits based on your choice.</li></ul>You can take this feat multiple times, and must choose a different kind of giant each time.",
    "choices": [
      {
        "id": "0A2672E3-59A1-4267-9825-F805BD54E820",
        "type": "asi",
        "options": ["str", "con", "wis", "cha"],
        "amount": 1
      },
      {
        "id": "76B055C9-E04D-478E-8F36-8DB4846250F9",
        "type": "trait",
        "options": [
          {
            "name": "Soul of the Storm Giant",
            "traits": [
              {
                "name": "Maelstrom Aura",
                "description": "As a bonus action, you surround yourself with an aura of magical wind and lightning that extends 10 feet from you in every direction but not through total cover. The aura lasts until the start of your next turn or until you are incapacitated. While the aura is active, you have resistance to lightning and thunder damage. In addition, attack rolls against you have disadvantage, and whenever another creature starts its turn within the aura, you can force the creature to make a Strength saving throw (DC equals 8 + your proficiency bonus + the modifier of the ability increased by this feat). On a failed save, the creature's speed is halved until the start of its next turn. You can use this bonus action a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest.",
                "uses": [
                  {
                    "id": "42958C48-B706-45E9-8FD4-F95CE80D6A22",
                    "type": "derived",
                    "source": "proficiency",
                    "reset": 2
                  }
                ]
              }
            ]
          },
          {
            "name": "Guile of the Cloud Giant",
            "traits": [
              {
                "name": "Cloudy Escape",
                "description": "When a creature you can see hits you with an attack roll, you can use your reaction to give yourself resistance to that attack's damage. You then teleport to an unoccupied space that you can see within 30 feet of yourself. You can use this reaction a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest.",
                "uses": [
                  {
                    "id": "D47184B2-64A1-42B6-BD19-88BA686C77FA",
                    "type": "derived",
                    "source": "proficiency",
                    "reset": 2
                  }
                ]
              }
            ]
          },
          {
            "name": "Ember of the Fire Giant",
            "traits": [
              {
                "name": "Born of Flame",
                "description": "You gain resistance to fire damage.",
                "granted": [
                  {
                    "type": "damage-resistance",
                    "options": ["Fire"]
                  }
                ]
              },
              {
                "name": "Searing Ignition",
                "description": "When you take the Attack action on your turn, you can replace a single attack with a magical burst of flame. Each creature of your choice in a 15-foot-radius sphere centered on you must make a Dexterity saving throw (DC equals 8 + your proficiency bonus + the modifier of the ability increased by this feat). On a failed save, a creature takes fire damage equal to 1d8 + your proficiency bonus, and it has the blinded condition until the start of your next turn. On a successful save, the creature takes half as much damage only. You can use your Searing Ignition a number of times equal to your proficiency bonus (but no more than once per turn), and you regain all expended uses when you finish a long rest.",
                "uses": [
                  {
                    "id": "88FCAEFE-B45B-4AD7-90CF-8F15A89ABF29",
                    "type": "derived",
                    "source": "proficiency",
                    "reset": 2
                  }
                ]
              }
            ]
          },
          {
            "name": "Fury of the Frost Giant",
            "traits": [
              {
                "name": "Born of Ice",
                "description": "You gain resistance to cold damage.",
                "granted": [
                  {
                    "type": "damage-resistance",
                    "options": ["Cold"]
                  }
                ]
              },
              {
                "name": "Frigid Retaliation",
                "description": "Immediately after a creature you can see within 30 feet of you hits you with an attack roll and deals damage, you can use your reaction to retaliate with a conjured blast of ice. The creature must make a Constitution saving throw (DC equals 8 + your proficiency bonus + the modifier of the ability increased by this feat). On a failed save, the creature takes cold damage equal to 1d8 + your proficiency bonus, and its speed is reduced to 0 until the end of its next turn. You can use this reaction a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest.",
                "uses": [
                  {
                    "id": "3E66B336-220C-4709-AA76-9E79F5335465",
                    "type": "derived",
                    "source": "proficiency",
                    "reset": 2
                  }
                ]
              }
            ]
          },
          {
            "name": "Keenness of the Stone Giant",
            "traits": [
              {
                "name": "Cavernous Sight",
                "description": "You gain darkvision out to 60 feet.",
                "granted": [
                  {
                    "type": "darkvision",
                    "range": 60
                  }
                ]
              },
              {
                "name": "Stone Throw",
                "description": "As a bonus action, you can conjure a boulder and throw it. Make a ranged weapon attack against a creature or object within 60 feet of you. On a hit, the rock deals 1d10 force damage, and the target must succeed on a Strength saving throw (DC equals 8 + your proficiency bonus + the modifier of the ability increased by this feat) or be knocked prone. You can use this bonus action a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest.",
                "uses": [
                  {
                    "id": "617A6E14-2789-47A6-946F-46B4EA522589",
                    "type": "derived",
                    "source": "proficiency",
                    "reset": 2
                  }
                ]
              }
            ]
          },
          {
            "name": "Vigor of the Hill Giant",
            "traits": [
              {
                "name": "Bulwark",
                "description": "When you are subjected to an effect that would move you at least 5 feet or knock you prone, you can use your reaction to steady yourself and negate the effect."
              },
              {
                "name": "Iron Stomach",
                "description": "Whenever you eat food as part of a short rest and spend one or more Hit Dice to regain hit points, you regain additional hit points equal to your Constitution modifier + your proficiency bonus."
              }
            ]
          }
        ]
      }
    ]
  },
  {
    "name": "Jotunn Strike",
    "type": "magic",
    "description": "You have absorbed primeval magic that gives you an echo of the might of giants.  Choose a type of giant.  Once per turn, when you hit a target with a melee weapon attack or a ranged weapon attack using a thrown weapon, you can imbue the attack with an additional effect depending on the type of giant you chose.  The saving throw DC for these effects equals 8 + your proficiency bonus + your Strength or Constitution modifier. You can use this feat a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest.",
    "choices": [
      {
        "id": "76B055C9-E04D-478E-8F36-8DB4846250F9",
        "type": "trait",
        "options": [
          {
            "name": "Storm Giant",
            "traits": [
              {
                "name": "",
                "description": "The target takes an extra 1d6 lightning damage. If the target is a creature, it must succeed on a Constitution saving throw, or it has disadvantage on attack rolls until the start of your next turn.",
                "uses": [
                  {
                    "id": "42958C48-B706-45E9-8FD4-F95CE80D6A22",
                    "type": "derived",
                    "source": "proficiency",
                    "reset": 2
                  }
                ]
              }
            ]
          },
          {
            "name": "Cloud Giant",
            "traits": [
              {
                "name": "",
                "description": "The target takes an extra 1d6 thunder damage. If the target is a creature, it must succeed on a Wisdom saving throw, or you become invisible to it until the start of your next turn or until immediately after you make an attack roll or cast a spell.",
                "uses": [
                  {
                    "id": "D47184B2-64A1-42B6-BD19-88BA686C77FA",
                    "type": "derived",
                    "source": "proficiency",
                    "reset": 2
                  }
                ]
              }
            ]
          },
          {
            "name": "Fire Giant",
            "traits": [
              {
                "name": "",
                "description": "The target takes an extra 2d6 fire damage.",
                "uses": [
                  {
                    "id": "88FCAEFE-B45B-4AD7-90CF-8F15A89ABF29",
                    "type": "derived",
                    "source": "proficiency",
                    "reset": 2
                  }
                ]
              }
            ]
          },
          {
            "name": "Frost Giant",
            "traits": [
              {
                "name": "",
                "description": "The target takes an extra 1d6 cold damage. If the target is a creature, it must succeed on a Constitution saving throw, or its speed is reduced to 0 until the start of your next turn.",
                "uses": [
                  {
                    "id": "3E66B336-220C-4709-AA76-9E79F5335465",
                    "type": "derived",
                    "source": "proficiency",
                    "reset": 2
                  }
                ]
              }
            ]
          },
          {
            "name": "Stone Giant",
            "traits": [
              {
                "name": "",
                "description": "The target takes an extra 1d6 force damage. If the target is a creature, it must succeed on a Strength saving throw or be pushed 10 feet from you in a straight line.",
                "uses": [
                  {
                    "id": "617A6E14-2789-47A6-946F-46B4EA522589",
                    "type": "derived",
                    "source": "proficiency",
                    "reset": 2
                  }
                ]
              }
            ]
          },
          {
            "name": "Hill Giant",
            "traits": [
              {
                "name": "",
                "description": "The target takes an extra 1d6 damage of the weapon's type. If the target is a creature, it must succeed on a Strength saving throw or be knocked prone.",
                "uses": [
                  {
                    "id": "822469CF-AF10-4AAA-A184-13B785C89397",
                    "type": "derived",
                    "source": "proficiency",
                    "reset": 2
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  }
]
