[
  "You lose concentration on any spells you are concentrating on, and an antimagic field surrounds you for the next minute.",
  "You trigger a surge at the start of each of your turns for the next minute, rerolling this result on subsequent rolls.",
  "You trigger two surges, rerolling this result on subsequent rolls.",
  "You cast spell~1stlevel on yourself.",
  "You cast spell~2ndlevel on yourself.",
  "You cast spell~3rdlevel on yourself.",
  "You cast spell~4thlevel on yourself.",
  "You cast spell~5thlevel on yourself.",
  "You cast spell~1stlevel on a random target within range.",
  "You cast spell~2ndlevel on a random target within range.",
  "You cast spell~3rdlevel on a random target within range.",
  "You cast spell~4thlevel on a random target within range.",
  "You cast spell~5thlevel on a random target within range.",
  "You cast spell~1stlevel on yourself.",
  "You cast spell~2ndlevel on yourself.",
  "You cast spell~3rdlevel on yourself.",
  "You cast spell~4thlevel on yourself.",
  "You cast spell~5thlevel on yourself.",
  "You cast spell~1stlevel on a random target within range.",
  "You cast spell~2ndlevel on a random target within range.",
  "You cast spell~3rdlevel on a random target within range.",
  "You cast spell~4thlevel on a random target within range.",
  "You cast spell~5thlevel on a random target within range.",
  "You cast spell~1stlevel on yourself.",
  "You cast spell~2ndlevel on yourself.",
  "You cast spell~3rdlevel on yourself.",
  "You cast spell~4thlevel on yourself.",
  "You cast spell~5thlevel on yourself.",
  "You cast spell~1stlevel on a random target within range.",
  "You cast spell~2ndlevel on a random target within range.",
  "You cast spell~3rdlevel on a random target within range.",
  "You cast spell~4thlevel on a random target within range.",
  "You cast spell~5thlevel on a random target within range.",
  "A halo of letters appears around your head. For the next hour, you are aware if someone you can hear is lying.",
  "For the next minute, any flammable object you touch that isn't being worn or carried by another creature bursts into flame.  Giggling laughter can be heard from the fire.",
  "Roll a d10. Your height changes by a number of inches equal to the roll. If the roll is odd, you shrink. If the roll is even, you grow.",
  "Ill omen falls upon you. When making an ability check, attack roll, or saving throw, the DM may force you to roll with disadvantage once.",
  "For 10 minutes, you speak in a stranger's unusual voice. The voice is disruptive, but how it sounds is up to you.",
  "You grow a long beard made of feathers that remains until you sneeze, at which point the feathers explode out from your face.",
  "For the next minute, creatures within 30 feet of yougain 5 temporary hit points at the start of your turn.",
  "Your hair turns bright pink. A remove curse spell can end this effect.",
  "The air charges with magic. Creatures have disadvantage on saving throws against the next spell you cast in the next minute that involves a saving throw.",
  "You infuse creatures with magic. Creatures within 30 feet of you have advantage against the next effect that involves a saving throw.",
  "Your skin turns a vibrant shade of blue. A remove curse spell can end this effect.",
  "You encase yourself in a block of earth that fills all 5-foot spaces surrounding you. If a creature is in a space where theearth appears, they are pushed to the nearest unoccupied space. Each 5-foot section of the block has 20 hit points, and an AC of 17.",
  "An eye appears on your forehead for the next hour. During that time, you have advantage on Perception checks that rely on sight.",
  "Your hands become iron fists for the next minute. You cannot move your fingers, but your unarmed strikes deal 1d8 bludgeoning damage.",
  "For the next minute, all your spells with a casting time of 1 action have a casting time of 1 bonus action.",
  "You become slightly intoxicated and have difficulty concentrating. You have disadvantage on maintaining concentration on spells for the next hour.",
  "For the next minute, any spell you cast with that costs one action allows you to immediately fly 15 feet via magic winds that carry you briefly and deposit you on a surface. This movement doesn't provoke attacks of opportunity.",
  "You are transported to the Astral Plane until the end of your next turn, after which time you return to the space you previously occupied or the nearest unoccupied space if that space is occupied.",
  "Maximize the damage of the next damaging spell you cast within the next minute.",
  "Roll a d10. Your age changes by a number of years equal to the roll. If the roll is odd, you get younger (minimum 1 year old). If the roll is even, you get older.",
  "Your next damaging spell cast within the next minute creates a spectral fist that knocks the target(s) prone.",
  "1d6 flumphs controlled by the DM appear in unoccupied spaces within 60 feet of you and are frightened of you. They vanish after 1 minute.",
  "For the next hour, you leave a trail of flowers, fungi, and moss wherever you step.",
  "You regain 2d10 hit points.",
  "You turn into a potted plant until the start of your next turn. While a plant, you are incapacitated and have vulnerability to all damage. If you drop to 0 hit points, your pot breaks, and your form reverts.",
  "For the next minute, you can teleport up to 20 feet as a bonus action on each of your turns.",
  "For the next minute, you are moved 5 feet in random direction at the end of each of your turns.",
  "For the next hour, you can walk on walls and ceilings.",
  "A unicorn controlled by the DM appears in a space within 5 feet of you, then disappears 1 minute later.",
  "A loud voice narrates your thoughts and actions for the next minute. It can be heard clearly from up to 100 feet away.",
  "You can't speak for the next minute. Whenever you try, pink bubbles float out of your mouth.",
  "You cry uncontrollably for the next minute. Whenever you try to speak, you hiccup wildly and snot shoots from your nose.",
  "A spectral shield hovers near you for the next minute, granting you a +2 bonus to AC and immunity to magic missile.",
  "A banana appears on your shoulder for the next minute. While holding the banana in your hand or mouth, you gain a +2 bonus to all saving throws.",
  "You are immune to being intoxicated by alcohol for the next 5d6 days. A tattoo that says Drunkard appears on your forehead for the same amount of time.",
  "Your hair falls out but grows back within 24 hours.",
  "Your skin rots and decomposes. You gain disadvantage on all Persuasion checks, but undead of CR 1 or lower ignore you unless attacked. A remove curse spell can end this effect.",
  "A modron chosen and controlled by the DM appears in an unoccupied space within 5 feet of you, then disappears 1 minute later.",
  "You can speak with small animals for 1 hour. Birds and critters seek you to tell you random secrets they've acquired.",
  "You regain your lowest-level expended spell slot, or a number of sorcery points equal to your proficiency bonus.",
  "Your eyes glow like multicolored lanterns for the next 24 hours.",
  "For the next minute, you must shout when you speak.",
  "An illusory copy of you appears. At the start of your next turn, it runs to the nearest creature you regard as an enemy within 60 feet and explodes, dealing 3d10 force damage in a 20 foot radius. If there is no enemy, it runs to you.",
  "You percieve the nearest creature as saying something hurtful about you. You are frightened of that creature until the end of your next turn.",
  "A random creature within 30 feet is charmed by you until the end of your next turn.",
  "Each creature within 30 feet of you becomes invisible for the next minute. The invisibility ends on a creature when it attacksor casts a spell.",
  "You no longer require food, other than at least one cup of tea a day. If you roll this outcome again, then you revert.",
  "You gain resistance to all damage for the next minute.",
  "A random creature within 60 feet of you becomespoisoned for 1d4 hours. If they use an action to vomit, they take 3d10 poison damage and the poisoned condition ends.",
  "You glow with bright light in a 30-foot radius for the next minute. Any creature that ends its turn within 5 feet of you is blinded until the end of its next turn.",
  "Illusory butterflies and flower petals flutter in the air within 10 feet of you for the next minute.",
  "A massive farting sound emenates from you. It is audible from 300 feet away.",
  "You can take one additional action immediately.",
  "Your tongue turns into silver. You speak and understand all languages for an hour.",
  "Each creature within 30 feet of you takes 1d10 necrotic damage. You regain hit points equal to the sum of the necrotic damage dealt.",
  "Toxic pustules grow on your body and explode. Creatures within 5 feet take 3d10 acid damage. For the next 1d6 days you have disadvantage on all Charisma checks.",
  "If you die within the next minute, you immediately come back to life as if by the reincarnate spell.",
  "You become athletic. You have advantage on all Strength, Dexterity, and Constitution checks for the next minute.",
  "Your size increases by one size category for the next minute.",
  "Your size decreases by one size category for the next minute.",
  "Charisma radiates from you for the next minute. You mayuse your action to strike a pose. A creature of your choice that cansee you gains a d8 inspiration die that they may add to an attack roll,ability check, or saving throw. This die lasts until the end of theminute and does not stack if the creature already has one of these die.",
  "You and all creatures within 30 feet of you gain vulnerability to piercing damage for the next minute.",
  "You are surrounded by faint, ethereal music for the next minute.",
  "A pillar of wild magic explodes from you, and you regain all expended spell slots and sorcery points.",
  "All of your teeth fall out of your mouth, and slowly regrow over 10 minutes.",
  "Up to 3 corpses within 30 feet of you rise as zombies hostile to all non-undead creatures.",
  "Your body and all your gear take on a glassy appearance for the next minute. During this time, ranged attacks that target you bounce off and target other random creatures within 30 feet of you instead.",
  "For the next minute, the only languages you know are Deep Speech, Primordial, and Sylvan.",
  "Your body (none of your clothing or gear) teleports 10 feet in a random direction.",
  "A deck of many things appears hovering in front of you expectantly, only visible and touchable by you. It disappears at the end of your next turn.",
  "If you take acid, cold, fire, lightning, or thunder damage within the next minute, you gain resistance to that type of damage for 1 hour.",
  "You gain a random form of short-term madness.",
  "You break your attunement with 1d3 of your magic items to which you are attuned.",
  "Your feet and hands disappear. You fall prone and drop everything you are carrying. You cannot stand up or hold or manipulate objects until your appendages reappear at the start of your next turn.",
  "An overexcited flock of colorful birds (use the stat block of a swarm of ravens) appears in your space and attacks you. The flock disappears 1 minute later.",
  "You fall asleep and have extremely happy dreams for the next minute, or until you take damage or a creature uses its action to shake you awake.",
  "All the coins you have on your person fall to the ground at your feet. It takes an action to pick up 100 scattered coins.",
  "You suddenly realize that you are nothing more than a fictional character in a game played by other creatures in another plane of existence, which causes you to be stunned. This existential crisis lasts until the start of your next turn, after which you shake it off as nonsense.",
  "You feel lucky. You automatically succeed on the next saving throw you make within the next minute.",
  "You lose your proficiency bonus for the next minute.",
  "Your pants fall down. Until you use a bonus action or action to raise them up again, your walking speed is reduced to 10 feet and you have disadvantage on Strength and Dexterity saving throws. If you are not wearing pants, you instead fall prone.",
  "You immediately make an unarmed strike against a random creature within 5 feet of you. If there is no creature within range, you target yourself.",
  "All the rations you are carrying turn to soap.",
  "You become colorblind until your next long rest.",
  "Everything made of gold on your person (including coins) turns into silver, and everything silver turns to gold.",
  "A coil of 50 feet of hempen rope immediately appears and ties you up. You are restrained. A creature can break the ropes by dealing 5 slashing or fire damage to them or by succeeding on a DC 11 (Strength) Athletics check. You can also escape with a successful DC 11 Dexterity (Acrobatics) check.",
  "A tiny rain cloud appears above your head and rains in a 5-foot radius centered on you for the next minute. Open flames in the area are extinguished.",
  "Roll a d10. Your weight changes by a number of pounds equal to the roll. If the roll is odd, you lose the weight. If the roll is even, you gain it.",
  "You switch souls with a random creature within 30 feet of you. You control it on its next turn, and it controls you on your next turn. You go back to your regular bodies at the end of your next turn, if the body is still alive.",
  "You lose the ability to hear for 1 day.",
  "You teleport to an alternate plane, then return to the location where you started after 1 minute.",
  "You transform into a large empty barrel for 1 minute, during which time you considered petrified.",
  "Your hair grows to double its current length over the next minute.",
  "You feel the incredible urge to relieve yourself. Until you do, your Strength and Intelligence are reduced by 1. If you don't relieve yourself in the next 2 minutes, the above effects are removed, but your Charisma score is reduced by 4 for 1 hour or until you change your trousers.",
  "You are surrounded by a faint, offensive odor for 1 minute. You gain disadvantage on all Charisma checks.",
  "Your eyes glow red. A remove curse spell can end this effect.",
  "Your spell components seem to have been rearranged. During the next hour, you must make an Intelligence check against your spell save DC to cast any spell that requires a material component.",
  "A magic mouth appears on a nearby wall or flat surface. When you speak, your voice comes from the magic mouth. This lasts for 1 minute.",
  "You lose the ability to smell for 1 hour.",
  "For the next day, each time you say a word with the \"s\" sound, it sounds like a hissing snake.",
  "One randomly-chosen non-magical item in your possession that weighs 1 pound or less vanishes and is forever gone.",
  "One randomly-chosen non-magical item in your possession that weighs 1 pound or less is duplicated.",
  "Your feet sink into the ground, making you completely immobile for one minute. This has no effect if you were not standing on the ground when the spell was cast.",
  "For the next minute, you have double vision. This gives you disadvantage on ranged attacks and Perception checks involving sight.",
  "You gain darkvision with a radius of 60 feet for 1 minute. If you already have darkvision, you lose it for 1 minute.",
  "You fall victim to a horrible cramp in both legs, reducing your speed by 10 feet for 1 hour.",
  "Approximately 100 gallons of water appear over your head and those within 10 feet of you, evenly distributed above everybody within the radius.",
  "For the next minute, you gain resistance to necrotic and radiant damage.",
  "The next spell you cast within the next hour uses a spell slot of one level lower than what it normally requires. If the spell is a spell of 1st level, you still must expend a spell slot to cast it.",
  "For the next hour, you are unable to read as the letters all appeared jumbled.",
  "During the next hour, you may re-roll any one save, attack roll, or skill check. If you do, you must take the new roll's result.",
  "The next spell you cast within the hour uses a slot level one level higher than what it normally requires.",
  "Your clothes become filthy.",
  "For the next hour, any time you make an ability check, roll 1d4 and add the result.",
  "For the next hour, any time you make an attack roll, roll 1d4 and add the result.",
  "For the next hour, any time you make a saving throw, roll 1d4 and add the result.",
  "For the next hour, any spell you cast does not require a verbal component.",
  "For the next hour, any spell you cast does not require a somatic component.",
  "For the next hour, you appear to others to be the opposite gender.",
  "All food and drink within 30 feet of you is purified.",
  "All food and drink within 30 feet of you is turned rotten.",
  "For the next minute, you are unable to cast any spell that deals damage.",
  "For the next minute, you can pass through any solid, non-magical wall that is 6 or fewer inches thick.",
  "You summon forth a tiny blue rabbit that sounds like a frog and smells like a cat.",
  "An elephant suddenly appears in front of you, explains that he's very sorry he didn't show up earlier and wanders off humming.",
  "You find yourself surrounded by 1d100 rats.",
  "Your ears grow comically large.  You have advantage on Perception checks that rely on hearing. A remove curse spell can end this effect.",
  "You emit steam and mist for the next hour. The steam is harmless and easily dispersed by movement or even a light breeze",
  "You learn the true name of a random creature within 30 feet of you.",
  "Dinner is served for all creatures within 50 feet.",
  "Your teeth become elongated, sharp, and pointed. A remove curse spell can end this effect.",
  "For the next minute, all damage you deal is replaced by healing, and all healing you do is replaced by force damage of equal amounts."
]
