[
  {
    "name": "Abacus",
    "cost": 2,
    "weight": 2,
    "description": "A set of beads threaded onto various rods, used for making calculations"
  },
  {
    "name": "Acid",
    "cost": 25,
    "weight": 1,
    "description": "As an action, you can splash the contents of this vial onto a creature within 5 feet of you or throw the vial up to 20 feet, shattering it on impact. In either case, make a ranged attack against a creature or object, treating the acid as an improvised weapon. On a hit, the target takes 2d6 acid damage."
  },
  {
    "name": "Alchemist's Doom",
    "cost": 150,
    "weight": 1,
    "description": "This sticky, adhesive fluid ignites into magical flames when exposed to air. As an action, you can throw this flask up to 20 feet, shattering it on impact. Make a ranged attack against a creature or object, treating the alchemist's grenade as an improvised weapon. On a hit, the target takes 2d6 damage at the start of each of its turns. A creature can end this damage by using its action to make a DC 13 Dexterity check to extinguish the flames. When the grenade is made, the damage type is determined as acid, cold, fire, lightning, or poison."
  },
  {
    "name": "Alchemist's Grenade",
    "cost": 50,
    "weight": 1,
    "description": "This sticky, adhesive fluid ignites into magical flames when exposed to air. As an action, you can throw this flask up to 20 feet, shattering it on impact. Make a ranged attack against a creature or object, treating the alchemist's grenade as an improvised weapon. On a hit, the target takes 1d4 damage at the start of each of its turns. A creature can end this damage by using its action to make a DC 10 Dexterity check to extinguish the flames. When the grenade is made, the damage type is determined as acid, cold, fire, lightning, or poison."
  },
  {
    "name": "Ammunition Belt",
    "cost": 10,
    "weight": 20,
    "description": "Ammunition belts are how ammunition is delivered into the mechanism of the crank gun. Each ammo belt weighs 20 pounds, which is counted toward to the total weight of the gun while attached to it. Each belt can hold up to 60 pistol cartridges.</p><p>Once exhausted, the ammunition belt must be loaded over the course of 10 minutes. An ammunition belt cannot be loaded while attached to a crank gun.</p><p>Removing or attaching an ammo belt to a crank gun requires an action. A crank gun may only have one ammo belt attached to it at a time."
  },
  {
    "name": "Anvil",
    "cost": 10,
    "weight": 75,
    "description": "A platform on which to smith, with various countours for shaping metal."
  },
  {
    "name": "Astrolabe",
    "cost": 25,
    "weight": 5,
    "description": "An instrument used for measuring the positions of celestial bodies, for aid in navigation"
  },
  {
    "name": "Atlas",
    "cost": 35,
    "weight": 5,
    "description": "A book of several maps and information regarding a specific area"
  },
  {
    "name": "Ball Bearings (1000)",
    "cost": 1,
    "weight": 2,
    "description": "As an action, you can spill these tiny metal balls from their pouch to cover a level, square area that is 10 feet on a side. A creature moving across the covered area must succeed on a DC 10 Dexterity saving throw or fall prone. A creature moving through the area at half speed doesn't need to make the save. Ball bearings can also be used as sling ammunition."
  },
  {
    "name": "Bag of Sand",
    "cost": 0.01,
    "weight": 1,
    "description": "A small pouch of sand used for making various measurements."
  },
  {
    "name": "Bathtub, collapsible",
    "cost": 15,
    "weight": 20,
    "description": "After 10 minutes of assembly, this collection of wooden slats provides support for a cylindrical watertight canvas cloth. It can hold enough water to allow 1 Medium creature to bathe in comfort without any of the risks that might come from entering lakes, rivers, or other bodies of water."
  },
  {
    "name": "Bedroll",
    "cost": 1,
    "weight": 7,
    "description": "You never know where you're going to sleep, and a bedroll helps you get better sleep in a hayloft or on the cold ground. A bedroll consists of bedding and a blanket thin enough to be rolled up and tied. In an emergency, it can double as a stretcher."
  },
  {
    "name": "Bell",
    "cost": 1,
    "weight": 1,
    "description": "A standard bell that rings, typically used for signaling."
  },
  {
    "name": "Blanket",
    "cost": 0.5,
    "weight": 3,
    "description": "A thick, quilted, blanket made to keep you warm in cold weather."
  },
  {
    "name": "Block & Tackle",
    "cost": 1,
    "weight": 5,
    "description": "A set of pulleys with a cable threaded through them and a hook to attach to objects, a block and tackle allows you to hoist up to four times the weight you can normally lift."
  },
  {
    "name": "Book",
    "cost": 25,
    "weight": 5,
    "description": "A book might contain poetry, historical accounts, information pertaining to a particular field of lore, diagrams and notes on gnomish contraptions, or just about anything else that can be represented using text or pictures. A book of spells is a spellbook."
  },
  {
    "name": "Brush",
    "cost": 5,
    "weight": 0.5,
    "description": "A painter's brush. These come in many different sizes."
  },
  {
    "name": "Caltrops (20)",
    "cost": 1,
    "weight": 2,
    "description": "As an action, you can spread a bag of caltrops to cover a square area that is 5 feet on a side. Any creature that enters the area must succeed on a DC 15 Dexterity saving throw or stop moving this turn and take 1 piercing damage. Taking this damage reduces the creature's walking speed by 10 feet until the creature regains at least 1 hit point. A creature moving through the area at half speed doesn't need to make the save."
  },
  {
    "name": "Candle",
    "cost": 0.01,
    "weight": 0.25,
    "description": "For 1 hour, a candle sheds bright light in a 5-foot radius and dim light for an additional 5 feet."
  },
  {
    "name": "Chain (10 ft)",
    "cost": 5,
    "weight": 10,
    "description": "A chain has 10 hit points. It can be burst with a successful DC 20 Strength check."
  },
  {
    "name": "Chain (10 ft), adamantine",
    "cost": 200,
    "weight": 8,
    "description": "Chain that has 35 hit points, is immune to nonmagical damage, and cannot be burst with a Strength check."
  },
  {
    "name": "Chalk",
    "cost": 0.01,
    "weight": 0.25,
    "description": "A piece of chalk used for writing and marking on various surfaces."
  },
  {
    "name": "Climber's Kit",
    "cost": 25,
    "weight": 12,
    "description": "A climber's kit includes special pitons, boot tips, gloves, and a harness. You can use the climber's kit as an action to anchor yourself; when you do, you can't fall more than 25 feet from the point where you anchored yourself, and you can't climb more than 25 feet away from that point without undoing the anchor."
  },
  {
    "name": "Crank Gun Stand",
    "cost": 15,
    "weight": 30,
    "description": "A crank gun stand is a special tripod made for supporting crank guns. It stands about three feet tall and has implements and attachment points needed to mount any crank gun to it. Doing so requires five minutes and the use of someone proficient with Tinker's Tools."
  },
  {
    "name": "Compass",
    "cost": 10,
    "weight": 0.25,
    "description": "A small device consisting of a needle and a magnet that can be used to navigate. Compasses only work on the material plane."
  },
  {
    "name": "Cot",
    "cost": 3,
    "weight": 15,
    "description": "A bedroll suspended on stilts to allow one to sleep off of the ground. In an emergency, it can double as a stretcher."
  },
  {
    "name": "Crampons (2)",
    "cost": 2,
    "weight": 0.5,
    "description": "A crampon is a metal plate with spikes that is strapped to the sole of a boot. A creature wearing crampons can't fall prone while moving across slippery ice."
  },
  {
    "name": "Crowbar",
    "cost": 2,
    "weight": 5,
    "description": "Using a crowbar grants advantage to Strength checks where the crowbar's leverage can be applied.  A crowbar can be used as a club in a pinch."
  },
  {
    "name": "Grappling Hook",
    "cost": 2,
    "weight": 4,
    "description": "When tied to the end of a rope, a grappling hook can secure the rope to a battlement, window ledge, tree limb, or other protrusion."
  },
  {
    "name": "Gun Belt",
    "cost": 20,
    "weight": 5,
    "description": "A gun belt is a belt made to hold one-handed firearms. A gun belt has two holsters on it for firearms, and you can draw any number of firearms in gun belt holsters as part of the same action, provided you have hands to hold them in."
  },
  {
    "name": "Gunpowder, Horn",
    "cost": 35,
    "weight": 2,
    "description": "A horn filled with black powder. Setting fire to a container full of gunpowder can cause it to explode, dealing 3d6 fire damage to creatures within 10 feet of it. A successful DC 12 Dexterity saving throw halves the damage. Setting fire to an ounce of gunpowder causes it to flare for 1 round, shedding bright light in a 30-foot radius and dim light for an additional 30 feet."
  },
  {
    "name": "Gunpowder, Keg",
    "cost": 250,
    "weight": 20,
    "description": "A sturdy keg filled with black powder. Setting fire to a container full of gunpowder can cause it to explode, dealing 7d6 fire damage to creatures within 10 feet of it. A successful DC 12 Dexterity saving throw halves the damage. Setting fire to an ounce of gunpowder causes it to flare for 1 round, shedding bright light in a 30-foot radius and dim light for an additional 30 feet."
  },
  {
    "name": "Hammer",
    "cost": 1,
    "weight": 3,
    "description": "This one-handed hammer with an iron head is useful for pounding pitons into a wall.  A hammer can be used as a light hammer."
  },
  {
    "name": "Hammer, Sledge",
    "cost": 2,
    "weight": 10,
    "description": "This two-handed, iron-headed hammer is good for smashing open treasure chests.  A sledgehammer can be used as a warhammer."
  },
  {
    "name": "Holy Water",
    "cost": 25,
    "weight": 1,
    "description": "As an action, you can splash the contents of this flask onto a creature within 5 feet of you or throw it up to 20 feet, shattering it on impact. In either case, make a ranged attack against a target creature, treating the holy water as an improvised weapon. If the target is a fiend or undead, it takes 2d6 radiant damage."
  },
  {
    "name": "Hourglass",
    "cost": 25,
    "weight": 5,
    "description": "A standard hourglass used to measure the passage of time."
  },
  {
    "name": "Hunting Trap",
    "cost": 5,
    "weight": 25,
    "description": "When you use your action to set it, this trap forms a saw-toothed steel ring that snaps shut when a creature steps on a pressure plate in the center. The trap is affixed by a heavy chain to an immobile object, such as a tree or a spike driven into the ground. A creature that steps on the plate must succeed on a DC 13 Dexterity saving throw or take 1d4 piercing damage and stop moving. Thereafter, until the creature breaks free of the trap, its movement is limited by the length of the chain (typically 3 feet long). A creature can use its action to make a DC 13 Strength check, freeing itself or another creature within its reach on a success. Each failed check deals 1 piercing damage to the trapped creature."
  },
  {
    "name": "Incense, ceremonial",
    "cost": 5,
    "weight": 1,
    "description": "A block of incense, typically used by priests."
  },
  {
    "name": "Incense, insect repellant",
    "cost": 5,
    "weight": 1,
    "description": "A block of incense that emits a smell that keeps normal, nonmagical insects at bay in a 20-foot radius."
  },
  {
    "name": "Ink",
    "cost": 10,
    "weight": 0.1,
    "description": "Ink is typically used with an ink pen to write."
  },
  {
    "name": "Ink Pen",
    "cost": 0.01,
    "weight": 0.25,
    "description": "An ink pen is a wooden stick with a special tip on the end. The tip draws ink in when dipped in a vial and leaves an ink trail when drawn across a surface."
  },
  {
    "name": "Ladder (10 ft)",
    "cost": 0.1,
    "weight": 25,
    "description": "This item is a straight, simple wooden ladder."
  },
  {
    "name": "Ladder, Folding (10 ft)",
    "cost": 1,
    "weight": 25,
    "description": "This ladder can fold for ease of storage."
  },
  {
    "name": "Lamp",
    "cost": 0.5,
    "weight": 1,
    "description": "A lamp casts bright light in a 15-foot radius and dim light for an additional 30 feet. Once lit, it burns for 6 hours on a flask (1 pint) of oil."
  },
  {
    "name": "Lantern, Bullseye",
    "cost": 10,
    "weight": 2,
    "description": "A bullseye lantern casts bright light in a 60-foot cone and dim light for an additional 60 feet. Once lit, it burns for 6 hours on a flask (1 pint) of oil."
  },
  {
    "name": "Lantern, Hooded",
    "cost": 5,
    "weight": 2,
    "description": "A hooded lantern casts bright light in a 30-foot radius and dim light for an additional 30 feet. Once lit, it burns for 6 hours on a flask (1 pint) of oil. As an action, you can lower the hood, reducing the light to dim light in a 5-foot radius."
  },
  {
    "name": "Lock, simple",
    "cost": 1,
    "weight": 1,
    "description": "A key is provided with the lock. Without the key, a creature proficient with thieves' tools can pick this lock with a successful DC 10 Dexterity check."
  },
  {
    "name": "Lock, average",
    "cost": 10,
    "weight": 1,
    "description": "A key is provided with the lock. Without the key, a creature proficient with thieves' tools can pick this lock with a successful DC 15 Dexterity check."
  },
  {
    "name": "Lock, good",
    "cost": 50,
    "weight": 1,
    "description": "A key is provided with the lock. Without the key, a creature proficient with thieves' tools can pick this lock with a successful DC 20 Dexterity check."
  },
  {
    "name": "Lock, excellent",
    "cost": 250,
    "weight": 1,
    "description": "A key is provided with the lock. Without the key, a creature proficient with thieves' tools can pick this lock with a successful DC 25 Dexterity check."
  },
  {
    "name": "Magnet",
    "cost": 50,
    "weight": 1,
    "description": "A device that can be attached to anything made of iron or steel."
  },
  {
    "name": "Magnifying Glass",
    "cost": 10,
    "weight": 0.5,
    "description": "This lens allows a closer look at small objects. It is also useful as a substitute for flint and steel when starting fires. Lighting a fire with a magnifying glass requires light as bright as sunlight to focus, tinder to ignite, and about 5 minutes for the fire to ignite. A magnifying glass grants advantage on any ability check made to appraise or inspect an item that is small or highly detailed."
  },
  {
    "name": "Mallet",
    "cost": 1,
    "weight": 3,
    "description": "A one-handed hammer with a softer head made of cork or rubber."
  },
  {
    "name": "Manacles",
    "cost": 2,
    "weight": 6,
    "description": "These metal restraints can bind a Small or Medium creature. Escaping the manacles requires a successful DC 20 Dexterity check. Breaking them requires a successful DC 20 Strength check. Each set of manacles comes with one key. Without the key, a creature proficient with thieves' tools can pick the manacles' lock with a successful DC 15 Dexterity check. Manacles have 15 hit points."
  },
  {
    "name": "Manacles, Small",
    "cost": 1,
    "weight": 3,
    "description": "These metal restraints can bind a Tiny creature. Escaping the manacles requires a successful DC 20 Dexterity check. Breaking them requires a successful DC 20 Strength check. Each set of manacles comes with one key. Without the key, a creature proficient with thieves' tools can pick the manacles' lock with a successful DC 15 Dexterity check. Manacles have 15 hit points."
  },
  {
    "name": "Manacles, Large",
    "cost": 5,
    "weight": 10,
    "description": "These metal restraints can bind a Large or Huge creature. Escaping the manacles requires a successful DC 20 Dexterity check. Breaking them requires a successful DC 20 Strength check. Each set of manacles comes with one key. Without the key, a creature proficient with thieves' tools can pick the manacles' lock with a successful DC 15 Dexterity check. Manacles have 15 hit points."
  },
  {
    "name": "Manacles, False",
    "cost": 10,
    "weight": 6,
    "description": "These manacles appear real, but can be broken out of much easier. No ability check is required to escape these manacles. A creature within 5 feet can identify the manacles as false with a successful DC 15 Intelligence (Investigation) check."
  },
  {
    "name": "Manacles, Cold Iron",
    "cost": 100,
    "weight": 6,
    "description": "These manacles are made of cold iron, and are thus innately warded against transposition magic.  A creature restrained by cold iron manacles cannot use transposition magic to escape them.  They are otherwise normal manacles."
  },
  {
    "name": "Manacles, Adamantine",
    "cost": 500,
    "weight": 4,
    "description": "These manacles are made of adamantine, and are thus far tougher than normal manacles. They have 45 hit points, the DCs to escape or pick the lock is increased to 30, and they are immune to nonmagical damage."
  },
  {
    "name": "Map Case",
    "cost": 1,
    "weight": 1,
    "description": "A leather case that can hold a single map."
  },
  {
    "name": "Mess Kit",
    "cost": 0.2,
    "weight": 1,
    "description": "This tin box contains a cup and simple cutlery. The box clamps together, and one side can be used as a cooking pan and the other as a plate or shallow bowl."
  },
  {
    "name": "Mirror",
    "cost": 2,
    "weight": 0.5,
    "description": "A steel mirror is handy when you want to look around corners, signal friends with reflected sunlight, keep an eye on a medusa, make sure that you look good enough to present yourself to the queen, or examine wounds that you've received on hard-to-see parts of your body."
  },
  {
    "name": "Nail",
    "cost": 0.1,
    "weight": 0.5,
    "description": "Standard iron spikes typically used with a hammer."
  },
  {
    "name": "Oil",
    "cost": 0.1,
    "weight": 1,
    "description": "Oil usually comes in a clay flask that holds 1 pint. As an action, you can splash the oil in this flask onto a creature within 5 feet of you or throw it up to 20 feet, shattering it on impact. Make a ranged attack against a target creature or object, treating the oil as an improvised weapon. On a hit, the target is covered in oil. If the target takes any fire damage before the oil dries (after 1 minute), the target takes an additional 5 fire damage from the burning oil. You can also pour a flask of oil on the ground to cover a 5-foot-square area, provided that the surface is level. If lit, the oil burns for 2 rounds and deals 5 fire damage to any creature that enters the area or ends its turn in the area. A creature can take this damage only once per turn."
  },
  {
    "name": "Paper",
    "cost": 0.2,
    "weight": 0.1,
    "description": "A sheet of standard paper is made from cloth fibers."
  },
  {
    "name": "Parchment",
    "cost": 0.1,
    "weight": 0.1,
    "description": "A sheet of parchment is a piece of goat hide or sheepskin that has been prepared for writing on."
  },
  {
    "name": "Perfume",
    "cost": 5,
    "weight": 1,
    "description": "A fragrant commodity typically used by the wealthy."
  },
  {
    "name": "Pickaxe",
    "cost": 0.2,
    "weight": 10,
    "description": "A miner's pick is designed to concentrate the force of its blow on a small area."
  },
  {
    "name": "Piton",
    "cost": 0.02,
    "weight": 0.25,
    "description": "When a wall doesn't offer handholds and footholds, you can make your own. A piton is a steel spike with an eye through which you can loop a rope."
  },
  {
    "name": "Pole, 10 foot",
    "cost": 0.05,
    "weight": 7,
    "description": "When you suspect a trap, you can put the end of your 10-foot pole through that hole in the wall instead of reaching in with your hand."
  },
  {
    "name": "Pole, 10 foot (folding)",
    "cost": 0.5,
    "weight": 7,
    "description": "This 10 foot pole can fold for ease of storage."
  },
  {
    "name": "Quiver",
    "cost": 1,
    "weight": 1,
    "description": "A leather quiver that can be worn over the back.  A standard quiver can hold 20 arrows or bolts, or 4 javelins."
  },
  {
    "name": "Raincatcher",
    "cost": 1,
    "weight": 5,
    "description": "A rain catcher is a simple contraption consisting of a 5-foot-square leather tarp and a wooden frame with legs. When the tarp is stretched across the wooden frame, it forms a basin that can catch 2 gallons of drinking water per inch of rainfall and hold up to 8 gallons. The tarp and wooden frame fold up for easy transport. A rain catcher costs 1 gp and weighs 5 pounds."
  },
  {
    "name": "Ram",
    "cost": 4,
    "weight": 35,
    "description": "You can use a portable ram to break down doors. When doing so, you gain a +4 bonus on the Strength check. One other character can help you use the ram, giving you advantage on this check."
  },
  {
    "name": "Rope, Hempen (50 ft)",
    "cost": 1,
    "weight": 10,
    "description": "Rope, has 2 hit points and can be burst with a DC 17 Strength check."
  },
  {
    "name": "Rope, Silk (50 ft)",
    "cost": 10,
    "weight": 5,
    "description": "Rope, has 4 hit points and can be burst with a DC 19 Strength check."
  },
  {
    "name": "Rope, Pride Silk (50 ft)",
    "cost": 25,
    "weight": 2,
    "description": "Rope, has 8 hit points and can be burst with a DC 23 Strength check."
  },
  {
    "name": "Saw",
    "cost": 5,
    "weight": 5,
    "description": "A simple device used in carpentry. A saw can also be used as a terbutje in a pinch."
  },
  {
    "name": "Scale",
    "cost": 5,
    "weight": 3,
    "description": "A scale includes a small balance, pans, and a suitable assortment of weights up to 2 pounds. With it, you can measure the exact weight of small objects, such as raw precious metals or trade goods, to help determine their worth."
  },
  {
    "name": "Sealing Wax",
    "cost": 0.5,
    "weight": 1,
    "description": "When you press a signet ring into warm sealing wax, you leave an identifying mark."
  },
  {
    "name": "Sextant",
    "cost": 25,
    "weight": 5,
    "description": "A navigation instrument consisting of an arc and a small spyglass, primarily used for navigation at sea."
  },
  {
    "name": "Shovel",
    "cost": 2,
    "weight": 5,
    "description": "A standard shovel used for digging."
  },
  {
    "name": "Signal Whistle",
    "cost": 0.05,
    "weight": 0.5,
    "description": "A small whistle used for signaling."
  },
  {
    "name": "Signet Ring",
    "cost": 5,
    "weight": 0,
    "description": "Each signet ring has a distinctive design carved into it. When you press this ring into warm sealing wax, you leave an identifying mark."
  },
  {
    "name": "Skillet, Iron",
    "cost": 2,
    "weight": 8,
    "description": "A heavy iron skillet used for cooking."
  },
  {
    "name": "Snowshoes",
    "cost": 2,
    "weight": 4,
    "description": "Snowshoes reduce the likelihood of their wearer getting stuck in the deep snow."
  },
  {
    "name": "Soap",
    "cost": 0.01,
    "weight": 0.25,
    "description": "A commodity used for bathing."
  },
  {
    "name": "Splitter Wedge",
    "cost": 0.05,
    "weight": 0.5,
    "description": "A wooden wedge used for felling trees."
  },
  {
    "name": "Spyglass, 2x",
    "cost": 100,
    "weight": 1,
    "description": "Objects viewed through this spyglass are magnified to two times their size."
  },
  {
    "name": "Spyglass, 3x",
    "cost": 100,
    "weight": 1,
    "description": "Objects viewed through this spyglass are magnified to three times their size."
  },
  {
    "name": "Spyglass, 4x",
    "cost": 100,
    "weight": 1,
    "description": "Objects viewed through this spyglass are magnified to four times their size."
  },
  {
    "name": "Spyglass, 5x",
    "cost": 100,
    "weight": 1,
    "description": "Objects viewed through this spyglass are magnified to five times their size."
  },
  {
    "name": "Spyglass, adjustable",
    "cost": 150,
    "weight": 1,
    "description": "Objects viewed through this spyglass are magnified. You can adjust the magnification from 2x to 5x."
  },
  {
    "name": "String (10 ft)",
    "cost": 0.1,
    "weight": 0.25,
    "description": "A 10-foot length of string, typically found in a burglar's pack."
  },
  {
    "name": "Tent",
    "cost": 2,
    "weight": 20,
    "description": "A simple and portable canvas shelter, a tent sleeps two."
  },
  {
    "name": "Tinderbox",
    "cost": 0.05,
    "weight": 1,
    "description": "This small container holds flint, fire steel, and tinder (usually dry cloth soaked in light oil) used to kindle a fire. Using it to light a torch - or anything else with abundant, exposed fuel - takes an action. Lighting any other fire takes 1 minute."
  },
  {
    "name": "Torch",
    "cost": 0.01,
    "weight": 1,
    "description": "A torch burns for 1 hour, providing bright light in a 20-foot radius and dim light for an additional 20 feet. If you make a melee attack with a burning torch and hit, it deals 1 fire damage."
  },
  {
    "name": "Watch",
    "cost": 50,
    "weight": 0.25,
    "description": "A small clock used for timekeeping."
  },
  {
    "name": "Whetstone",
    "cost": 0.01,
    "weight": 1,
    "description": "A standard whetstone used to sharpen blades."
  }
]
