[
  {
    "name": "Bagpipes",
    "cost": 30,
    "weight": 6,
    "description": "A set of pipes connected to a cloth bag."
  },
  {
    "name": "Birdpipes",
    "cost": 12,
    "weight": 2,
    "description": "Pan pipes or satyr pipes, also known as the shalm, these are sacred to Lliira and popular with wood elf and wild elf bards."
  },
  {
    "name": "Drum",
    "cost": 6,
    "weight": 3,
    "description": "A percussion instrument consisting of cloth or hide stretched over a wooden cylinder."
  },
  {
    "name": "Dulcimer",
    "cost": 25,
    "weight": 10,
    "description": "A large drum."
  },
  {
    "name": "Flute",
    "cost": 2,
    "weight": 1,
    "description": "A long, thin wood instrument."
  },
  {
    "name": "Glaur",
    "cost": 3,
    "weight": 2,
    "description": "Short, curved horns like a cornucopia. Played with valves, glaur sound like trumpets, while those without valves, known as gloon, have a more mournful sound."
  },
  {
    "name": "Hand Drum",
    "cost": 6,
    "weight": 3,
    "description": "A double-headed skin drum fitted with handles along its side."
  },
  {
    "name": "Horn",
    "cost": 3,
    "weight": 2,
    "description": "A simple wind instrument used for signalling."
  },
  {
    "name": "Longhorn",
    "cost": 6,
    "weight": 1,
    "description": "A Faerûnian flute of sophisticated make, found only in areas with skilled artisans, as in great cities or elven enclaves."
  },
  {
    "name": "Lute",
    "cost": 35,
    "weight": 2,
    "description": "A commonly used stringed instrument."
  },
  {
    "name": "Lyre",
    "cost": 30,
    "weight": 2,
    "description": "A stringed instrument similar to a small harp."
  },
  {
    "name": "Pan Flute",
    "cost": 5,
    "weight": 0.5,
    "description": "A set of pipes often used by satyrs."
  },
  {
    "name": "Shawn",
    "cost": 2,
    "weight": 1,
    "description": "A long wind instrument."
  },
  {
    "name": "Songhorn",
    "cost": 2,
    "weight": 1,
    "description": "A recorder, a simple type of flute, usually carved from wood."
  },
  {
    "name": "Tantan",
    "cost": 6,
    "weight": 3,
    "description": "A tambourine, a popular instrument with halflings and humans south of the Dalelands."
  },
  {
    "name": "Thelarr",
    "cost": 2,
    "weight": 1,
    "description": "Also known as a whistlecane, a simple and easy-to-make wind instrument cut from a reed. They are so simple, in fact, that skilled bards frequently make and give them away to children - to the parents' delight or regret."
  },
  {
    "name": "Tocken",
    "cost": 6,
    "weight": 3,
    "description": "A hanging set of carved oval bells, usually played with a pair of light wooden hammers (or open handed). They are most common in underground cultures, where the resonant tones can carry."
  },
  {
    "name": "Viol",
    "cost": 30,
    "weight": 1,
    "description": "A stringed instrument played with a bow."
  },
  {
    "name": "Wargong",
    "cost": 30,
    "weight": 6,
    "description": "A metal gong, traditionally made from a shield, particularly the shield of an enemy. Both goblins and dwarves make and play wargongs, their sound echoing through tunnels in the Underdark."
  },
  {
    "name": "Whistle-Stick",
    "cost": 5,
    "weight": 2,
    "description": "A hollow tube similar to an oversized flute used by grung."
  },
  {
    "name": "Yarting",
    "cost": 35,
    "weight": 2,
    "description": "A southern instrument from Amn and Calimshan that is a Faerûnian analog to the guitar. Numerous variations have spread across the continent."
  },
  {
    "name": "Zulkoon",
    "cost": 30,
    "weight": 6,
    "description": "A complex pump organ that originated with the zulkirs of Thay, who use it in the casting of their spells. It is considered to have a dramatic, but sinister, sound."
  }
]
