[
  {
    "name": "Clothes, common",
    "cost": 0.5,
    "ac": 10,
    "maxDex": null,
    "strReq": null,
    "stealth": "",
    "weight": 2,
    "description": "This set of clothes could consist of a loose shirt and baggy breeches, or a loose shirt and skirt or overdress. Cloth wrappings are used for shoes.",
    "type": -1
  },
  {
    "name": "Clothes, costume",
    "cost": 1,
    "ac": 10,
    "maxDex": null,
    "strReq": null,
    "stealth": "",
    "weight": 4,
    "description": "This set of clothes is fashioned after a particular costume, typically meant for entertaining.",
    "type": -1
  },
  {
    "name": "Clothes, fine",
    "cost": 15,
    "ac": 10,
    "maxDex": null,
    "strReq": null,
    "stealth": "",
    "weight": 6,
    "description": "This set of clothes is designed specifically to be expensive and to show it, including fancy, tailored clothes in whatever fashion happens to be the current style in the courts of the nobles. Precious metals and gems could be worked into the clothing.",
    "type": -1
  },
  {
    "name": "Clothes, hot weather",
    "cost": 10,
    "ac": 10,
    "maxDex": null,
    "strReq": null,
    "stealth": "",
    "weight": 2,
    "description": "Covering your body from head to foot in light, airy cloth keeps you cooler than baring your skin to the sun. This outfit typically consists of a loose linen robe and either a turban or loose head covering and veil. Its wearer automatically succeeds on saving throws against the effects of extreme heat.",
    "type": -1
  },
  {
    "name": "Clothes, robes",
    "cost": 1,
    "ac": 10,
    "maxDex": null,
    "strReq": null,
    "stealth": "",
    "weight": 6,
    "description": "A standard set of robes, commonly used by wizards.",
    "type": -1
  },
  {
    "name": "Clothes, vestments",
    "cost": 1,
    "ac": 10,
    "maxDex": null,
    "strReq": null,
    "stealth": "",
    "weight": 6,
    "description": "Religious clothing, typically found in a priest's pack.",
    "type": -1
  },
  {
    "name": "Clothes, cold weather",
    "cost": 10,
    "ac": 11,
    "maxDex": null,
    "strReq": null,
    "stealth": "",
    "weight": 12,
    "description": "This outfit consists of a heavy fur coat or cloak over layers of wool clothing, as well as a fur-lined hat or hood, goggles, and fur-lined leather boots and gloves. As long as cold weather clothing remains dry, its wearer automatically succeeds on saving throws against the effects of extreme cold.",
    "type": -1
  },
  {
    "name": "Clothes, traveler's",
    "cost": 2,
    "ac": 11,
    "maxDex": null,
    "strReq": null,
    "stealth": "",
    "weight": 4,
    "description": "This set of clothes could consist of boots, a wool skirt or breeches, a sturdy belt, a shirt (perhaps with a vest or jacket), and an ample cloak with a hood.",
    "type": -1
  },
  {
    "name": "Gambeson",
    "cost": 5,
    "ac": 11,
    "maxDex": null,
    "strReq": null,
    "stealth": "",
    "weight": 5,
    "description": "A gambeson is wool clothing typically worn beneath armor for added comfort and protection, but it offers modest protection on its own.",
    "type": -1
  },
  {
    "name": "Outlaw's Duster",
    "cost": 150,
    "ac": 11,
    "maxDex": null,
    "strReq": null,
    "stealth": "",
    "weight": 5,
    "description": "A heavy leather duster with many hidden pockets.",
    "type": -1
  },
  {
    "name": "Outfit, pride silk",
    "cost": 500,
    "ac": 12,
    "maxDex": null,
    "strReq": null,
    "stealth": "",
    "weight": 4,
    "description": "A set of fine clothing made from a material that affords it modest protection.",
    "type": -1
  },
  {
    "name": "Padded",
    "cost": 5,
    "ac": 11,
    "maxDex": null,
    "strReq": null,
    "stealth": "Disadvantage",
    "weight": 8,
    "description": "Padded armor consists of quilted layers of cloth and batting.",
    "type": 0
  },
  {
    "name": "Leather",
    "cost": 10,
    "ac": 11,
    "maxDex": null,
    "strReq": null,
    "stealth": "",
    "weight": 10,
    "description": "The breastplate and shoulder protectors of this armor are made of leather that has been stiffened by being boiled in oil. The rest of the armor is made of softer and more flexible materials.",
    "type": 0
  },
  {
    "name": "Leather, dark",
    "cost": 50,
    "ac": 11,
    "maxDex": null,
    "strReq": null,
    "stealth": "(special)",
    "weight": 10,
    "description": "Leather armor that is made of darker materials and includes a cloak, making it ideal for stealth.",
    "type": 0
  },
  {
    "name": "Studded Leather",
    "cost": 45,
    "ac": 12,
    "maxDex": null,
    "strReq": null,
    "stealth": "",
    "weight": 13,
    "description": "Made from tough but flexible leather, studded leather is reinforced with close-set rivets or spikes.",
    "type": 0
  },
  {
    "name": "Studded Leather, dark",
    "cost": 75,
    "ac": 12,
    "maxDex": null,
    "strReq": null,
    "stealth": "(special)",
    "weight": 13,
    "description": "Studded leather armor that is made of darker materials and includes a cloak, making it ideal for stealth.",
    "type": 0
  },
  {
    "name": "Hide",
    "cost": 10,
    "ac": 12,
    "maxDex": 3,
    "strReq": null,
    "stealth": "",
    "weight": 12,
    "description": "This crude armor consists of thick furs and pelts. It is commonly worn by barbarian tribes, evil humanoids, and other folk who lack access to the tools and materials needed to create better armor.",
    "type": 0
  },
  {
    "name": "Brigandine",
    "cost": 25,
    "ac": 13,
    "maxDex": 2,
    "strReq": null,
    "stealth": "",
    "weight": 15,
    "description": "Made of raw hides, tanned leather, and small metal plates or sections of chain mail, this armor is favored by bandits, barbarians, and primitive cultures.",
    "type": 1
  },
  {
    "name": "Chain Shirt",
    "cost": 50,
    "ac": 13,
    "maxDex": 2,
    "strReq": null,
    "stealth": "",
    "weight": 20,
    "description": "Made of interlocking metal rings, a chain shirt is worn between layers of clothing or leather. This armor offers modest protection to the wearer's upper body and allows the sound of the rings rubbing against one another to be muffled by outer layers.",
    "type": 1
  },
  {
    "name": "Scale Mail",
    "cost": 50,
    "ac": 14,
    "maxDex": 2,
    "strReq": null,
    "stealth": "Disadvantage",
    "weight": 25,
    "description": "This armor consists of a coat and leggings (and perhaps a separate skirt) of leather covered with overlapping pieces of metal, much like the scales of a fish. The suit includes gauntlets.",
    "type": 1
  },
  {
    "name": "Lamellar",
    "cost": 200,
    "ac": 14,
    "maxDex": 2,
    "strReq": null,
    "stealth": "",
    "weight": 20,
    "description": "This armor consists of leather amor covered with heavier metal, similar to scale mail.",
    "type": 1
  },
  {
    "name": "Breastplate",
    "cost": 400,
    "ac": 14,
    "maxDex": 2,
    "strReq": null,
    "stealth": "",
    "weight": 20,
    "description": "This armor consists of a fitted metal chest piece worn with supple leather. Although it leaves the legs and arms relatively unprotected, this armor provides good protection for the wearer's vital organs while leaving the wearer relatively unencumbered.",
    "type": 1
  },
  {
    "name": "Half Plate",
    "cost": 750,
    "ac": 15,
    "maxDex": 2,
    "strReq": null,
    "stealth": "Disadvantage",
    "weight": 40,
    "description": "Half plate consists of shaped metal plates that cover most of the wearer's body. It does not include leg protection beyond simple greaves that are attached with leather straps.",
    "type": 1
  },
  {
    "name": "Ring Mail",
    "cost": 30,
    "ac": 14,
    "maxDex": 1,
    "strReq": null,
    "stealth": "",
    "weight": 40,
    "description": "This armor is leather armor with heavy rings sewn into it. The rings help reinforce the armor against blows from swords and axes. Ring mail is inferior to chain mail, and it's usually worn only by those who can't afford better armor.",
    "type": 2
  },
  {
    "name": "Chain Mail",
    "cost": 50,
    "ac": 15,
    "maxDex": 1,
    "stealth": "Disadvantage",
    "weight": 55,
    "description": "Made of interlocking metal rings, chain mail includes a layer of quilted fabric worn underneath the mail to prevent chafing and to cushion the impact of blows. The suit includes gauntlets.",
    "type": 2
  },
  {
    "name": "Light Plate",
    "cost": 75,
    "ac": 16,
    "maxDex": 0,
    "strReq": 13,
    "stealth": "",
    "weight": 50,
    "description": "Light plate consists of interlocking metal plates like plate armor, but is lighter and as such provides further mobility.",
    "type": 2
  },
  {
    "name": "Splint",
    "cost": 200,
    "ac": 17,
    "maxDex": 0,
    "strReq": 15,
    "stealth": "Disadvantage",
    "weight": 60,
    "description": "This armor is made of narrow vertical strips of metal riveted to a backing of leather that is worn over cloth padding. Flexible chain mail protects the joints.",
    "type": 2
  },
  {
    "name": "Plate",
    "cost": 1500,
    "ac": 18,
    "maxDex": 0,
    "strReq": 15,
    "stealth": "Disadvantage",
    "weight": 65,
    "description": "Plate consists of shaped, interlocking metal plates to cover the entire body. A suit of plate includes gauntlets, heavy leather boots, a visored helmet, and thick layers of padding underneath the armor. Buckles and straps distribute the weight over the body.",
    "type": 2
  },
  {
    "name": "Heavy Plate",
    "cost": 3000,
    "ac": 19,
    "maxDex": 0,
    "strReq": 18,
    "stealth": "Disadvantage",
    "weight": 75,
    "description": "Heavy plate is heavier than normal plate armor and provides further protection. However, the added cost of metal makes this armor very expensive.",
    "type": 2
  },
  {
    "name": "Fortress Plate",
    "cost": 5000,
    "ac": 20,
    "maxDex": 0,
    "strReq": 20,
    "stealth": "(special)",
    "weight": 85,
    "description": "Fortress plate, sometimes also called stoneplate, is extraordinarily heavy armor. No part of a wearer's body is left unprotected, and they are not so much wearing the armor as they are vaguely located inside of it.",
    "type": 2
  }
]
